[
  "IMAX1002 og VB6040, H24 2 Oppgave/Oppgåve 2 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. 1 2 0 La A = 3 8 0 0 0 1 Kva er determinanten til matrisa A? det(A) = ☐ Rund av svaret til nærmaste heiltal. Maks poeng: 6 3 Oppgave/Oppgåve 3 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. [2x - 3z La T: R³ → R² være lineærtransformasjonen gitt ved T(x, y, z) = [2y+4z] x Finn ei matrise A slik at T(x, y, z) = A. y A = Z Maks poeng: 6 3/10 ",
  "2(a) [mm] 200 87.5 25 150 25 50 50 A N -25 75 Et sammensatt tverrsnitt har geometri som vist i figuren. z-aksen er en symmetriakse for tverrsnitts geometrien. a) Regn ut beliggenheten til arealsenter C (yc og zc). (0) mm, YC = zc = (130) mm. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 ",
  "11 Konvergensrate Feil som funksjon av steglengde 10¹ E 10° 10-1 10-1 10° h Over ser dere et logaritmisk plot av feilen € som en funksjon av steglengden h for en numerisk metode. Vi ser at € = k ha, der k og a er konstanter. Det er oppgitt at a er et heltall. Dere skal bestemme a ut fra grafen. a = Dersom vi bruker steglengde h = 0.09 får vi feilen € = 0.09. Hvilken steglengde h må vi velge for at feilen skal bli € = 0.01? h = Maks poeng: 5 ",
  "i Institutt for havromsoperasjoner og byggteknikk / Institutt for konstruksjonsteknikk / Institutt for vareproduksjon og byggteknikk Eksamensoppgave i MEKA1101/MEKT1101/MEKG1101/TKT4118/VB6046 Eksamensdato: 5. desember 2024 Eksamenstid (fra-til): 15:00-19:00 Faglig kontakt: Torodd Skjerve Nord (Ålesund) / Victorien Prot (Trondheim) / Per Harald Ninive (Gjøvik) Tlf.: 97 77 94 31/98 49 77 31 / 99 58 76 72 Møter i eksamenslokalet: NEI Hjelpemiddelkode/Tillatte hjelpemidler: D / Ingen trykte eller håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye og gjør dine egne antagelser. Presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning/avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. FAGSPESIFIKK INFORMASJON Håndtegninger: I en del oppgaver skal håndberegninger leveres på ark, disse oppgavene er merket tydelig. Manglende håndberegninger på disse oppgavene vil gi redusert uttelling selv om svaret ført inn i Inspera er rett. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke <<Vis besvarelse». Du er selv ansvarlig for å fylle inn riktige koder på eventuelle håndtegningsark. Les derfor informasjonen på omslagsarket nøye. Eksamenskontoret kan ikke garantere at feilaktig utfylte ark blir lagt til besvarelsen din. Vekting av oppgavene: Maksimal uttelling er angitt for hver oppgave, oppgavesettet summerer til 100 poeng. oppgave 1: 16 poeng oppgave 2: 10 poeng oppgave 3: 25 poeng oppgave 4: 23 poeng oppgave 5: 16 poeng oppgave 6: 10 poeng Formelark: Formelarket finner du bakerst i oppgavesettet. Varslinger: Eventuelle beskjeder under eksamen (f.eks. ved feil i oppgavesettet), sendes ut via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra/avbrutt eksamen: Dersom du ønsker å levere blankt/avbryte eksamen, gå til “hamburgermenyen\" i øvre høyre hjørne og velg «<Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din under tidligere prøver i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige under «<tidligere prøver». 1(a) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A ய 4m a) Vis at fagverket er statisk bestemt. Skriv ditt svar her Format ΣΧ B D 4m 30 kN Words: 0 Maks poeng: 3 1(b) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A E 4m B 4m 30 kN b) Bestem opplagerkreftene i A og E. Angi svaret i et heltall antall kN. La positiv x-akse peke mot høyre og positiv z-akse peke oppover på figuren. Angi svaret med negativt fortegn dersom du mener opplagerkreftene i x-retning peker mot venstre, eller hvis du mener opplagerkreftene i z-retning peker nedover. Ax = (-80) Az = (30) Ex = (80) Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 3 1(c) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m E 4m c) Hvilken eller hvilke staver er nullstaver? Velg ett alternativ: ○ Stav AE og BD Stav DE Det er ingen nullstaver ○ Stav AD og BD ○ Stav AE ○ Stav BD B D 4m 30 kN C Merk at håndberegningene eller begrunnelsene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 1(d) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A E 4m B D 4m 30 kN C d) Finn største strekkraft og største trykkraft i fagverket ved å bruke knutepunktsmetoden. Angi svaret i (positivt) heltall antall kN. Merk at vi kun er ute etter tallverdier. Maks. strekkraft = (50) kN Maks. trykkraft = (80) KN Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 6 2(a) [mm] 200 87.5 25 150 25 50 50 A N -25 75 Et sammensatt tverrsnitt har geometri som vist i figuren. z-aksen er en symmetriakse for tverrsnitts geometrien. a) Regn ut beliggenheten til arealsenter C (yc og zc). (0) mm, YC = zc = (130) mm. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 2(b) Et sammensatt tverrsnitt har geometri som vist i figuren. z-aksen er en symmetriakse for tverrsnitts geometrien. 200 mm Z 150 mm 50 mm 25 mm→ K 25 mm y 75 mm b) Beregn tverrsnittets annet areal moment Iy. Bruk Steiners teorem Rund av svaret ditt til nærmeste heltall. Iy = (83 - 84) 106 mm². Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 6 "
]