[
  "IMAX1002 og VB6040, H24 i Forside Eksamensoppgåve i IMAA1002, IMAG1002, IMAT1002, VB6040 Matematikk for ingeniørfag 1 Dato: 10.12.2024 Fagleg kontakt: IMAA1002 ( Ålesund ) Elias Sandal IMAG1002 og VB6040 ( Gjøvik ) Anders Oulie IMAT1002 ( Trondheim ) Torkil Utvik Stai Alice Petronella Hedenlund Kjem til eksamenslokalet: NEI Hjelpemiddelkode / Tillatne hjelpemiddel: C: Spesifiserte trykte og handskrivne hjelpemidlar tillat. Bestemt, enkel kalkulator tillat. Vi spesifiserer at ingen trykte eller handskrivne hjelpemidlar er tillatne, med unntak av det vedlagte formelarket. Tillatne kalkulatorar: • Casio FX - 82CW, Casio FC100 V2, Casio fx - 82ES PLUS og Casio fx - 82EX • Citizen SR - 270X og Citizen SR - 270X College • Hewlett Packard HP30S ANNA INFORMASJON: Les oppgåvene nøye og gjer opp dine eigne meiningar. Presiser i svara kva for føresetnadar du har lagt til grunn i tolking / avgrensing av oppgåva. Fagleg kontaktperson kontaktast berre dersom det er direkte feil eller manglar i oppgåvesettet. Vend deg til ei eksamensvakt om du meiner det er feil eller manglar. Noter spørsmålet ditt på førehand. FAGSPESIFIKK INFORMASJON Handteikningar: I oppgåve 1, 6, 9 og 14 er det lagt opp til at du skal svare på ark. Andre oppgåver skal du svare direkte på i Inspera. Nedst i oppgåva finn du ein sjusifra kode. Fyll inn denne koden øvst til venstre på dei arka du ynskjer å levere. Det er tilrådd å gjere dette undervegs i eksamen. Dersom du treng tilgang til kodane etter at eksamenstida har gått ut, må du klikke «Sjå levering». Du er sjølv ansvarleg for å fylle inn riktige kodar på eventuelle handteikningsark / ark for handteikningar. Les difor informasjonen om omslagsarket nøye. Eksamenskontoret kan ikkje garantere at feilaktig utfylte ark blir lagt til svara dine. rac{1}{10} IMAX1002 og VB6040, H24 Vekting av oppgåvene: Det er molig å oppnå totalt 100 poeng. Oppgåve 5 gir maksimalt 4 poeng. Oppgåve 10 gir maksimalt 5 poeng. Oppgåve 2, 3, 4 og 12 gir maksimalt 6 poeng. Oppgåve 7 gir maksimalt 7 poeng. Oppgåve 1, 6, 8, 9 og 13 gir maksimalt 8 poeng. Oppgåve 11 og 14 gir maksimalt 10 poeng. Varslingar: Eventuelle beskjedar under eksamen ( f.eks. ved feil i oppgåvesettet ) , sendes ut via varslingar i Inspera. Eit varsel vil dukke opp som en dialogboks på skjermen i Inspera. Du kan finne att varselet ved å klikke på bjølla i øvre høgre hjørne på skjermen. Trekk frå / avbroten eksamen: Dersom du ynskjer å levere blankt / avbryte eksamen, gå til «hamburgarmenyen» i øvre høgre hjørne og vel <<Lever blankt». Dette kan ikkje angrast sjølv om prøven framleis er open. Tilgang til svara dine: Etter eksamen finn du svara dine under tidlegare prøver i Inspera. Merk at det kan ta ein vyrkedag før eventuelle handteikningar vert tilgjengelege under «tidlegare prøvar». 1 Oppgave / Oppgåve 1 Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. Du blir gitt tre elektriske komponentar A, B og C som du ønsker å finne den elektriske motstanden til. Motstanden til komponent A er æ, komponent B har motstand y, og komponent C har motstand z. Dessverre har du ikkje tilgang til å måle motstanden av komponentane kvar for seg, men du har tilgang til tre forskjellige kretsar som du kan måle motstanden i. • Krets 1 har ein motstand på 212 og har 2 av komponent A, 3 av komponent B og 4 av komponent C. Det vil si at vi får likninga 2x + 3y + 4z = 212. • Krets 2 har ein motstand på 101 og har 1 av komponent A, 5 av komponent B og 0 av komponent C. Det vil si at vi får likninga x + 5y = 101. • Krets 3 har ein motstand på 158 og har 8 av komponent A, 0 av komponent B og 4 av komponent C. Det vil si at vi får likninga 8x + 4z = 158. Løys likningssettet for å finne motstanden x, y og z til kvar av dei tre komponentane. Maks poeng: 8 rac{2}{10} IMAX1002 og VB6040, H24 2 Oppgave / Oppgåve 2 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. 1 2 0 La A = 3 8 0 0 0 1 Kva er determinanten til matrisa A? det ( A ) = ☐ Rund av svaret til nærmaste heiltal. Maks poeng: 6 3 Oppgave / Oppgåve 3 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. [2x - 3z La T: R³ → R² være lineærtransformasjonen gitt ved T ( x, y, z ) = [2y + 4z] x Finn ei matrise A slik at T ( x, y, z ) = A. y A = Z Maks poeng: 6 rac{3}{10} 4 Oppgave / Oppgåve 4 IMAX1002 og VB6040, H24 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La [1 v1 = 8 og 2 = с Finn konstanten c slik at vektoren c = Rund av til nærmaste heiltal. L 1 3 ligg i underrommet span ( 1, 2 ) . - 25 Maks poeng: 6 rac{4}{10} 5 Oppgave / Oppgåve 5 IMAX1002 og VB6040, H24 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Kva for ein av dei følgande er ein basis for R³? Vel eitt alternativ ○ { ( - 1,0,0 ) , ( - 1,1,1 ) } ○ { ( 1, 1,0 ) , ( 0,0,2 ) , ( 1, 1, 2 ) , ( 1, 1, 1 ) } ○ { ( 1,1,0 ) , ( 0,0,2 ) , ( 1,1,2 ) } { ( 1,1,0 ) , ( 0,1,0 ) , ( 1,0,0 ) } ○ { ( 1,0,0 ) , ( 1,1,0 ) , ( 1, 1, 1 ) } ○ { ( 1,0,0 ) , ( 0,1,0 ) , ( 0, 0, 1 ) , ( 1,0,1 ) } ○ { ( 1,0,0 ) , ( 1, 1, 2 ) } Merk at i denne oppgåva bruker vi notasjonen ( x, y, z ) = У 6 Oppgave / Oppgåve 6 Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. La 1 2 3 A = 0 1 4 5 6 0 Finn inversmatrisa A - ¹. Maks poeng: 4 Maks poeng: 8 rac{5}{10} IMAX1002 og VB6040, H24 7 Oppgave / Oppgåve 7 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Sjå på det komplekse talet z = 4 - 2i. Rund av til 2 desimalars nøyaktigheit. 1. Kva er realdelen og kva er imaginærdelen til z? Re ( z ) , Im ( z ) 2. Skriv z på polarform. Vinklane skal være i radianar og ligge i intervallet [ - \\pi, \\pi ) . x = ( cos ( ) + i sin ( 3. Skriv z på eksponentialform. Vinklane skal være i radianar og ligge i intervallet [—\\pi, \\pi ) . x = exp ( i Maks poeng: 7 8 Oppgave / Oppgåve 8 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La Z1 = 2 + 1 og 22 = 5 + 52. Finn den kartesiske forma til dei følgande komplekse tala. 1.21%2 = + i 2. Z1 Z2 + i 3. + i Rund av til eitt desimal etter komma. Maks poeng: 8 rac{6}{10} IMAX1002 og VB6040, H24 9 Oppgave / Oppgåve 9 Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. Finn alle løysingane til likninga z³ = 8i. Maks poeng: 8 10 Oppgave / Oppgåve 10 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Finn verdien til integralet L²x²e²³½³ dx = | Rund av til nærmaste heiltal. Maks poeng: 5 rac{7}{10} 11 IMAX1002 og VB6040, H24 Oppgave / Oppgåve 11 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) = t³et. 1. Kva for eit av følgande uttrykk er f' ( t ) ? Vel eitt alternativ ○ f' ( t ) = 3t³et + t² et ○ f' ( t ) = ( 3² + t³ ) et f' ( t ) = 2t²et + t³et ○ f' ( t ) = 2t² et ○ f' ( t ) = 3t² et ○ f' ( t ) = t³ et 2. Kva for ei av følgande differensiallikningar har funksjonen ƒ som ei løysing? Vel eitt alternativ Otf' ( t ) - 2f ( t ) = 0 Otf' ( t ) et f ( t ) = 0 Otf' ( t ) — et f ( t ) = 0 f' ( t ) — 3f ( t ) / t - f ( t ) = 0 f' ( t ) - ( t² — e¹ ) f ( t ) = 0 ○ f' ( t ) - 3f ( t ) / t = 0 Maks poeng: 10 rac{8}{10} IMAX1002 og VB6040, H24 12 Oppgave / Oppgåve 12 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Finn løysinga på initialverdiproblemet y ( x ) y' ( x ) = e³x, Vel eitt alternativ y ( 0 ) = 1. ○ y ( x ) = \\sqrt\\sqrt³½³½ 6x + 1 y ( x ) = \\sqrt \\sqrt ³½³½³x + rac{1}{3} y ( x ) = e³x ○ y ( x ) = e - 3x 3x ○ y ( x ) = \\sqrt\\sqrte³ imes + 1 ○ y ( x ) = ½³½³¹² + 1} - 3x ○ y ( x ) = e - ³x Maks poeng: 6 13 Oppgave / Oppgåve 13 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Differensiallikninga 4y\" ( x ) - 4y' ( x ) + y ( x ) forma y ( x ) = A cos ( 2x ) + B sin ( 2x ) . = cos ( 2x ) har ei partikulær løysing på Finn konstantane A og B. A , B Rund av til to desimal etter komma. Maks poeng: 8 rac{9}{10} IMAX1002 og VB6040, H24 14 Oppgave / Oppgåve 14 Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. Sjå på følgande system av førsteordens differensiallikningar x1 ( t ) = 3x1 ( t ) + x2 ( t ) , x2 ( t ) = x1 ( t ) + x2 ( t ) . 1. Skriv systemet på matriseform, altså på forma ' ( t ) [x1 ( t ) ] 3 ( t ) = [21 ( 6 ) ]. 2. Finn eigenverdiane og eigenvektorane til matrisa A. . A ( t ) kor A er ei matrise og 3. Finn den generelle løysinga til systemet av differensiallikningar. 4. Finn løysinga av systemet som tilfredsstill initialvilkåra x1 ( 0 ) = 2 og x2 ( 0 ) = \\sqrt2. Maks poeng: 10 rac{10}{10}",
  "i Institutt for havromsoperasjoner og byggteknikk / Institutt for konstruksjonsteknikk / Institutt for vareproduksjon og byggteknikk Eksamensoppgave i MEKA1101 / MEKT1101 / MEKG1101 / TKT4118 / VB6046 Eksamensdato: 5. desember 2024 Eksamenstid ( fra - til ) : 15:00 - 19:00 Faglig kontakt: Torodd Skjerve Nord ( Ålesund ) / Victorien Prot ( Trondheim ) / Per Harald Ninive ( Gjøvik ) Tlf.: 97 77 94 rac{31}{98} 49 77 rac{31}{99} 58 76 72 Møter i eksamenslokalet: NEI Hjelpemiddelkode / Tillatte hjelpemidler: D / Ingen trykte eller håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye og gjør dine egne antagelser. Presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. FAGSPESIFIKK INFORMASJON Håndtegninger: I en del oppgaver skal håndberegninger leveres på ark, disse oppgavene er merket tydelig. Manglende håndberegninger på disse oppgavene vil gi redusert uttelling selv om svaret ført inn i Inspera er rett. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke <<Vis besvarelse». Du er selv ansvarlig for å fylle inn riktige koder på eventuelle håndtegningsark. Les derfor informasjonen på omslagsarket nøye. Eksamenskontoret kan ikke garantere at feilaktig utfylte ark blir lagt til besvarelsen din. Vekting av oppgavene: Maksimal uttelling er angitt for hver oppgave, oppgavesettet summerer til 100 poeng. oppgave 1: 16 poeng oppgave 2: 10 poeng oppgave 3: 25 poeng oppgave 4: 23 poeng oppgave 5: 16 poeng oppgave 6: 10 poeng Formelark: Formelarket finner du bakerst i oppgavesettet. Varslinger: Eventuelle beskjeder under eksamen ( f.eks. ved feil i oppgavesettet ) , sendes ut via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Dersom du ønsker å levere blankt / avbryte eksamen, gå til “hamburgermenyen\" i øvre høyre hjørne og velg «<Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din under tidligere prøver i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige under «<tidligere prøver». 1 ( a ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A ய 4m a ) Vis at fagverket er statisk bestemt. Skriv ditt svar her Format ΣΧ B D 4m 30 kN Words: 0 Maks poeng: 3 1 ( b ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A E 4m B 4m 30 kN b ) Bestem opplagerkreftene i A og E. Angi svaret i et heltall antall kN. La positiv x - akse peke mot høyre og positiv z - akse peke oppover på figuren. Angi svaret med negativt fortegn dersom du mener opplagerkreftene i x - retning peker mot venstre, eller hvis du mener opplagerkreftene i z - retning peker nedover. Ax = ( - 80 ) Az = ( 30 ) Ex = ( 80 ) Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 3 1 ( c ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m E 4m c ) Hvilken eller hvilke staver er nullstaver? Velg ett alternativ: ○ Stav AE og BD Stav DE Det er ingen nullstaver ○ Stav AD og BD ○ Stav AE ○ Stav BD B D 4m 30 kN C Merk at håndberegningene eller begrunnelsene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 1 ( d ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A E 4m B D 4m 30 kN C d ) Finn største strekkraft og største trykkraft i fagverket ved å bruke knutepunktsmetoden. Angi svaret i ( positivt ) heltall antall kN. Merk at vi kun er ute etter tallverdier. Maks. strekkraft = ( 50 ) kN Maks. trykkraft = ( 80 ) KN Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 6 2 ( a ) [mm] 200 87.5 25 150 25 50 50 A N - 25 75 Et sammensatt tverrsnitt har geometri som vist i figuren. z - aksen er en symmetriakse for tverrsnitts geometrien. a ) Regn ut beliggenheten til arealsenter C ( yc og zc ) . ( 0 ) mm, YC = zc = ( 130 ) mm. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 2 ( b ) Et sammensatt tverrsnitt har geometri som vist i figuren. z - aksen er en symmetriakse for tverrsnitts geometrien. 200 mm Z 150 mm 50 mm 25 mm→ K 25 mm y 75 mm b ) Beregn tverrsnittets annet areal moment Iy. Bruk Steiners teorem Rund av svaret ditt til nærmeste heltall. Iy = ( 83 - 84 ) 106 mm². Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 6 3 ( a ) A L L. L B C — L / 2 L / 2 - P = qL D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Argumenter for om denne ramma er statisk underbestemt, statisk bestemt eller statisk ubestemt. Skriv ditt svar her Format ΣΧ Words: 0 Maks poeng: 5 3 ( b ) A B L L. C — L / 2 L / 2 - P = qL D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Bestem reaksjonskreftene i A, C og D. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ Ax = 0 Ax = - qL / 8 Ax = qL / 4 Ax = = qL / 2 Velg ett alternativ A₂ = 0 Az = qL / 4 Az = qL / 8 Az = qL / 2 Velg ett alternativ Cz = 3qL / 2 Cz = qL / 4 Cz = qL 22 > Cz = qL / 10 Velg ett alternativ Cx = 0 Cx = qL / 8 Cx = qL / 3 Cx = qL / 5 Velg ett alternativ Dz = 2qL Dz = qL / 2 Dz = qL / 4 Dz = 2qL / 3 Maks poeng: 5 3 ( c ) A L L. L — L / 2 L / 2 - P = qL B C D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Nedenfor finner du seks alternativer for normalkraftdiagrammet til rammen ( A, B,...., F ) . I diagrammene angir virkningssymbolet strekk eller trykk. Bestem hvilket diagram som viser rett fordeling av normalkreftene i rammen. Merk at vi her bare er ute etter fordelingen av trykk og strekkrefter i rammen så størrelsen på boksene er ikke nødvendigvis i skala i forhold til størrelsen på normalkreftene i hver del av rammen. Du skal vise hvordan du kommer frem til riktig diagram ved hjelp av håndberegning. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: ○ A 0 O B O 0 D OE F 00 A + 0 - > 0777777 C < + > - > B 777777 E <<← →> → ⭑ D トロ F →☐ + + □ - > Maks poeng: 5 3 ( d ) A B L L. C — L / 2 L / 2 - P = qL D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Nedenfor finner du seks alternativer for skjærkraftdiagrammet til ramma ( A, B,...., F ) . Skjærkraftdiagrammet er tegnet med virkningssymbol som angir retningen til skjærkreftene. Bestem hvilket diagram som viser rett fordeling av skjærkrefter i rammen. Merk at vi her bare er ute etter formen, samt retning på virkningssymbol på skjærkraftdiagrammet. Du skal vise hvordan du kommer frem til riktig diagram ved hjelp av håndberegning. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: ОА B C D ○ E OF A [↓] B C ↑↓ ↑↓ ↓↑ 0 D E VOA 不 B ↑↓ 十六 0 + ↑ ↑↓ 1404 B F 口 口 Maks poeng: 5 3 ( e ) A L L. L B — L / 2 L / 2 - P = qL C D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Nedenfor finner du seks alternativer for momentdiagrammet ( A, B,...., F ) . Momentdiagrammene er tegnet på strekksiden. Bestem hvilket diagram som viser rett fordeling av moment i rammen. Merk at vi her bare er ute etter formen på momentdiagrammet. Du skal vise hvordan du kommer frem til riktig diagram ved hjelp av håndberegning. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: ○ A 0 O B O 0 D OE O O F A B C E B D பட F Maks poeng: 5 4 Figuren viser en T - formet mast som er satt sammen av trebjelker med massive, kvadratiske tverrsnitt. Tverrsnittdimensjonene fremgår av figuren. Masten er fast innspent i punkt C. To like store punktlaster F angriper som anvist i punkt A og D. Bruddspenningen i trematerialet er fy = 30 MPa. 5a F 2a A B 2a D Tverrsnitt, del BC: C 75 mm ΑΖ ட. X 75 mm Tverrsnitt, del ABD: 50 mm 50 mm 4 ( a ) a ) Bestem den riktige formen på M - diagrammet. 1: 2: TT 3: 4: 5: T 6: Velg ett alternativ: ○ Alternativ 2 Alternativ 6 ○ Alternativ 3 ○ Alternativ 5 ○ Alternativ 4 ооо ○ Alternativ 1 Merk at håndberegningene eller begrunnelsene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 5 4 ( b ) b ) Bestem bøyemomentene i punkt B og C uttrykt ved F og a. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Bøyemoment MB i punkt B er lik: Velg ett alternativ: ○ 7Fa 0 4Fa 2Fa ○ 5Fa Fa Bøyemoment Mc i punkt C er lik: Velg ett alternativ Fa O 9Fa 2Fa 0 5Fa 7Fa Maks poeng: 5 4 ( c ) c ) Anta F = 250 N og a = 1,0 m. Hvor i konstruksjonen oppstår største bøyespenning? Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: ○ Like til venstre for punkt B ( i del AB ) Punkt D ○ Punkt A Rett i underkant av punkt B ( i del BC ) ○ Punkt C Like til høyre for punkt B ( i del BD ) 4 ( d ) d ) Beregn største bøyespenning i konstruksjonen dersom F = 250N og a = 1,0m. Angi svaret med 1 desimals nøyaktighet. M σ max = ( 24.8 25.0 ) MPa. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 5 Maks poeng: 5 4 ( e ) e ) Hva blir største verdi som punktlastene F kan ha uten at bruddspenningen ( fy = 30 MPa ) overskrides? Anta fortsatt at a = 1,0 m. Avrund svaret til nærmeste heltall antall newton ( N ) . Fmax = ( 297 302 ) N. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 3 5 En ramme ABC er påkjent av en kraft PiC som vist på figuren. Rammeelementene ( AB og BC ) har lengde L og bøyestivhet EI. Momentdiagrammet er oppgitt. L M - diagram B A ΕΙ F FL ΕΙ L 0 FL B C 5 ( a ) a ) Velg riktig skisse av deformasjonsmønsteret ( elastiske linjen ) . 1 4 F F Velg ett alternativ: ○ Alternativ 5 O Alternativ 4 00 Alternativ 6 ○ Alternativ 1 O O ○ Alternativ 3 O Alternativ 2 2 5 F 3 6 F F F Maks poeng: 4 5 ( b ) b ) Hva blir vertikalforskyvningen av punkt B? Bruk elementærbjelkemetoden. WB = 0 WB = FL³ 3EI FL³ WB WB = 2EI FL³ 8EI FL³ FL³ FL³ WB WB WB = 384EI 16EI 48EI 1 2 3 4 5 00 6 7 Velg ett alternativ: ○ Alternativ 7 O Alternativ 4 O Alternativ 6 Alternativ 1 Alternativ 3 Alternativ 2 Alternativ 5 Merk at håndberegningene og argumentasjonen du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 5 5 ( c ) c ) Hva er rotasjonsvinkelen i punkt B? Фв 0 Фв 1 Velg ett alternativ: ○ Alternativ 1 ○ Alternativ 6 = FL² ΕΙ 2 ○ Alternativ 2 ○ Alternativ 5 ○ Alternativ 3 Alternativ 4 FL² FL² FL² фв = ФВ = Фв ФВ 2EI 6EI 16EI = FL² ЗЕІ 3 4 LO 5 6 Merk at håndberegningene og argumentasjonen du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 5 ( d ) d ) Beregn horisontalforskyvningen av punkt C. Skriv ditt svar her Format ΣΧ ค Maks poeng: 3 Words: 0 Merk at håndberegningene og argumentasjonen du gjør for å løse denne oppgaven må leveres inn. 6 ( a ) Z h = 0,03 m y b = 3 m L. d = 2,5 m x A ↓ B PL³ Wmidt P_{bak} = 2 kN P_{front} = 1 kN 48EI L = 4 m PL³ Wmidt = 48EI a L P Wmidt ( 4 ( 4 ) * - ³ ( % ) ) . b L a< 2 L a> 2 Oppgaven besvares direkte i Inspera Trondheim kommune har sendt ut et varsel om kommende gravearbeid utenfor boligen din. I innkjørselen din kommer det til å være en lang og dypt grop som er 4 meter bred. For at du og andre skal kunne benytte innkjørselen så legges det ned en stålplate, som er 4 m lang, 3 m bred og 3 cm tykk, over gropa. Du ser på den tynne stålplata og er nysgjerrig på hvor mye nedbøyning som kommer til å oppstå når du skal kjøre over den. Du har ikke lært plateteori som undervises i TKT4134 Mekanikk 4, men du bestemmer deg for å forenkle problemet og benytter bjelketeori istedenfor. Da du fikk varselingen fra kommunen lagde du en skisse av problemet og en detaljert kode som beregner og plotter nedbøyningen på midten av plata som funksjon av posisjonen til forhjulene. Platens E - modul er 210 GPa og bøyes om svak akse. Du viser nå koden til en venn, en stund etter du skrev koden. Samtidig som du viser koden til vennen din oppdager du noen feil i koden. a ) Koden inneholder 3 feil. Bruk svarboksen nedenfor til å føre opp linjenummerne du mener det er feil på, hva som er galt og forslå korrigert kode for disse linjene. Feilene er ikke syntaksfeil. 1 ## Importer nødvendige biblioteker 2 import numpy as np 3 ## Definerer konstanter 5 L = 4 # Lengde av stålplate [m] 6 b = 3000 # Bredde av stålplate [mm] 7 h = 30 # Høyde av stålplate [mm] 8 E = 210000 # E - modul stål [N / mm * * 2] 9 I = h * b * * rac{3}{12} # 2. Areal moment [mm * * 4] 10 11 P_{front} = 10000 # Last frontaksling [N] 12 P_{bak} = 20000 # Last bakaksling [N] 13 d = 2500 # Avstand mellom akslingene [mm] 14 15 wc1 = P_{front} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{front} 16 wc2 = P_{bak} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{bak} 17 18 ## Diskretisering 19 pos for = np.linspace ( 0, L + d, 1000 ) # forakslingens posisjon 20 pos_{bak} = pos_{ford} # bakakslingens posisjon 21 w_{midt} = np. zeros_{like} ( pos_{for} ) # tomt array for nedbøyning 22 23 # ??? 24 for i in range ( len ( pos_{for} ) ) : if pos_{for}[i] < = L / 2: w_{midt}[i] = wc1 * ( 4 * ( pos_{for}[i] / L ) * * 3 - 3 * pos_{for}[i] / L ) w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) 25 26 27 elif pos_{for}[i] > L / 2 and pos_{for}[i] < = d: 28 29 elif pos_{for}[i] < = L: 30 31 32 33 else: 34 35 w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) + wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) elif pos_{for}[i] > L and pos_{bak}[i] < = L / 2: w_{midt} [i] = wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) w_{midt}[i] = wc2 * ( 4 * ( ( L - pos_{bak}[i] ) / L ) * * 3 - 3 * ( L - pos_{bak}[i] ) / L ) 36 # Finner størst nedbøyning og tilhørende posisjon 37 maks_{nedbøyning_pos} = pos_{for}[np.argmin ( w_{midt} ) ] # Forhjulets posisjon ved størst nedbøyning 38 maks_{nedbøyning} = np.min ( w_{midt} ) # Størst nedbøyning 39 40 ## Plotter og printer resultatet 41 plt.figure ( figsize = ( 12, 4 ) , dpi - 200 ) 42 plt.title ( \"Nedbøyning ( midt ) som funksjon av forhjulenes posisjon\", fontsize = 15 ) 43 plt.plot ( pos_{for}, w_{midt} ) 44 plt.plot ( maks_{nedbøyning_pos}, maks_{nedbøyning}, marker = \"o\", color = \"red\" ) 45 plt.xlabel ( \"Forhjulenes posisjon [mm]\", fontsize = 12 ) 46 plt.ylabel ( r\"$w_{midt}$ [mm]\", fontsize = 12 ) 47 plt.grid ( ) 48 plt.show ( ) 49 print ( 50 \"Maks nedbøyning er {:.1f} mm når forhjulene er {:.2f} m på veg over stålplata\" .format ( - maks_{nedbøyning}, maks_{nedbøyning_pos} / 1000 ) 51 52 ) Figuren nedenfor viser plottet som koden lager når den er feilfri. Nedbøyning ( midt ) som funksjon av forhjulenes posisjon 0.0 - 2.5 - 5.0 - 7.5 - 10.0 - 12.5 - 15.0 - 17.5 Wmidt [mm] 0 1000 2000 3000 Forhjulenes posisjon [mm] 4000 5000 6000 Skriv ditt svar her, dvs. feilene i Python - koden, inkl. hvilken linje hver feil befinner seg, og angi korrigert kode. Maks poeng: 5 6 ( b ) Z い P_{bak} = 2 kN Z h = 0,03 m b = 3 m P Wmidt d = 2,5 m x a b A ↓ L B PL³ Wmidt = P_{front} = 1 kN 48EI BET ( * * ( 2 ) * - ³ ( 2 ) ) . L a< 2 L = 4 m PL³ Wmidt = 48EI L a> 2 Oppgaven besvares direkte i Inspera Trondheim kommune har sendt ut et varsel om kommende gravearbeid utenfor boligen din. I innkjørselen din kommer det til å være en lang og dypt grop som er 4 meter bred. For at du og andre skal kunne benytte innkjørselen så legges det ned en stålplate, som er 4 m lang, 3 m bred og 3 cm tykk, over gropa. Du ser på den tynne stålplata og er nysgjerrig på hvor mye nedbøyning som kommer til å oppstå når du skal kjøre over den. Du har ikke lært plateteori som undervises i TKT4134 Mekanikk 4, men du bestemmer deg for å forenkle problemet og benytter bjelketeori istendenfor. Da du fikk varselingen fra kommunen lagde du en skisse av problemet og en detaljert kode som beregner og plotter nedbøyningen på midten av plata som funksjon av posisjonen til forhjulene. Platens E - modul er 210 GPa og bøyes om svak akse. Du viser nå koden til en venn, en stund etter du skrev koden. Vennen din ser over den detaljerte koden og stopper på linje 23 hvor det står #???. Der er det ingen forklaring på hva som skjer med for - løkken og vennen din spør deg \"hva gjør koden her\"? b ) Forklar logikken og koden i for - løkken. Benytt svarboksene nedenfor. 1 ## Importer nødvendige biblioteker 2 import numpy as np 3 4 ## Definerer konstanter 5 L = 4 # Lengde av stålplate [m] 6 b = 3000 # Bredde av stålplate [mm] 7 h = 30 # Høyde av stålplate [mm] 8 E = 210000 # E - modul stål [N / mm * * 2] 9 I = h * b * * rac{3}{12} # 2. Areal moment [mm * * 4] 10 11 P_{front} = 10000 # Last frontaksling [N] 12 P_{bak} 20000 # Last bakaksling [N] 13 d = 2500 # Avstand mellom akslingene [mm] 14 15 wc1 = P_{front} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{front} 16 wc2 = P_{bak} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{bak} 17 18 ## Diskretisering 19 pos_{for} = np.linspace ( 0, L + d, 1000 ) # forakslingens posisjon 20 pos_{bak} = pos_{ford} # bakakslingens posisjon 21 w_{midt} = np. zeros_{like} ( pos_{for} ) # tomt array for nedbøyning 22 23 # ??? 24 for i in range ( len ( pos_{for} ) ) : if pos_{for}[i] < = L / 2: 25 26 w_{midt}[i] = wc1 * ( 4 * ( pos_{for}[i] / L ) * * 3 - 3 * pos_{for}[i] / L ) 27 elif pos_{for}[i] > L / 2 and pos_{for}[i] < = d: 28 29 elif pos_{for}[i] < = L: 30 31 32 w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) + wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) elif pos_{for}[i] > L and pos_{bak}[i] < = L / 2: w_{midt}[i] = wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) 33 else: 34 w_{midt}[i] = wc2 * ( 4 * ( ( L - pos_{bak}[i] ) / L ) * * 33 * ( L - pos_{bak}[i] ) / L ) 35 36 # Finner størst nedbøyning og tilhørende posisjon 37 maks_{nedbøyning_pos} = pos_{for}[np.argmin ( w_{midt} ) ] # Forhjulets posisjon ved størst nedbøyning 38 maks_{nedbøyning} = np.min ( w_{midt} ) # Størst nedbøyning 39 40 ## Plotter og printer resultatet 41 plt.figure ( figsize = ( 12, 4 ) , dpi = 200 ) 42 plt.title ( \"Nedbøyning ( midt ) som funksjon av forhjulenes posisjon\", fontsize = 15 ) 43 plt.plot ( pos_{for}, w_{midt} ) 44 plt.plot ( maks_{nedbøyning_pos}, maks_{nedbøyning}, marker = \"o\", color = \"red\" ) 45 plt.xlabel ( \"Forhjulenes posisjon [mm]\", fontsize = 12 ) 46 plt.ylabel ( r\"$w_{midt}$ [mm]\", fontsize = 12 ) 47 plt.grid ( ) 48 plt.show ( ) 49 print ( 50 \"Maks nedbøyning er {:.1f} mm når forhjulene er {:.2f} m på veg over stålplata\" .format ( - maks_{nedbøyning}, maks_{nedbøyning_pos} / 1000 ) 51 52 ) Figuren nedenfor viser plottet som koden lager når den er feilfri. i Wmidt [mm] 0.0 - 2.5 - 5.0 - 7.5 - 10.0 - 12.5 - 15.0 - 17.5 Nedbøyning ( midt ) som funksjon av forhjulenes posisjon 0 1000 2000 3000 4000 5000 6000 Forhjulenes posisjon [mm] Forklar linje 25 og 26 Forklar linje 27 og 28 Forklar linje 29 og 30 Forklar linje 31 og 32 Forklar linje 33 og 34 Maks poeng: 5",
  "i Forside Eksamensoppgave i: INGA1002 / INGG1002 / INGT1002 Programmering og numerikk Dato: 16.12.2024 Tid: kl 09:00 - 12:00 Faglig kontakt under eksamen: Trondheim INGT1002 Programmering: Majid Rouhani Numerikk: Markus Arthur Köbis Gjøvik INGG1002 Programmering: Jon Yngve Hardeberg Numerikk: Charles Curry Ålesund INGA1002 Programmering: Kai Erik Hoff Numerikk: Truls Helge Øi Møter i eksamenslokalet: NEI Hjelpemiddelkode / Tillatte hjelpemidler: D - Ingen trykte eller håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. ANNEN INFORMASJON: Les oppgavene nøye og gjør dine egne antagelser. Presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Dette gjelder ikke - flervalgsoppgaver. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. FAGSPESIFIKK INFORMASJON Ingen håndtegninger: Denne eksamenen tillater ikke bruk av håndtegninger. Har du likevel fått utdelt skanne - ark, er dette en feil. Arkene vil ikke bli akseptert for innlevering, og de vil derfor heller ikke sendes til sensur. Vekting av oppgavene: Oppgavesettet er delt inn i 3 seksjoner ( programmering, numerikk, og felles oppgaver ) . Programmering ( 1 - 6 ) og numerikk ( 7 - 12 ) oppgavene teller 33% hver, mens siste delen ( 13 - 17 ) teller 34%. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg <<Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 Matematiske operasjoner Gitt variabeldefinisjonen c = 7 Hva blir verdien til c etter at vi utfører følgende operasjoner? c = c * * 2 c % = 5 Velg ett alternativ: 2 O 4 3 4.0 Gitt variabeldefinisjonen z = 8 Hva blir verdien til z etter at vi utfører følgende operasjoner? Z + = 10 z = 3 Velg ett alternativ 9 O 3 ○ 6.0 6 Maks poeng: 4 2 Funksjoner Denne koden definerer en funksjon is_{prime} ( n ) som sjekker om et gitt tall n er et primtall. Test av funksjonen gir disse resultatene: is_{prime} ( 10 ) # returnerer False is_{prime} ( 11 ) # returnerer True is_{prime} ( 1 ) # returnerer False is_{prime} ( 13 ) # returnerer True Lag funksjonen is_{prime} ved å plassere kodefragment i rett rekkefølge. Noen av fragmentene skal IKKE brukes. Pass på å plassere draområdene slik at de \"snapper\" til ønsket rute. Se bort fra innrykk def is_{prime} ( n ) : if n < = 1: return False for j in range ( 2, n ) : if n % j = = 0: return False return True from math import sqrt if n / / j = = 0: Maks poeng: 7 3 Sammenligningsoperatorer Gitt følgende kode: a = 5 b = 5.0 C = \"5\" d = True e = False Nedenfor står en rekke uttrykk. For hvert uttrykk, kryss av for True hvis uttrykket er sant, eller False hvis det er usant, eller kryss av for Error hvis uttrykket vil gi syntaksfeil. Finn de som passer sammen: b> a a > = b d = = 1 a ! = c e < = 0 a = = b d<e False О True О Error О О Maks poeng: 7 4 Lister og indekser Gitt følgende programkode: temperatures = def f1 ( temps ) : [15.5, 17.2, 16.8, 14.9, 18.3, 19.0, 16.5] return sum ( temps ) / len ( temps ) def f2 ( temps ) : return sum ( temps[:3] ) / len ( temps [:3] ) def f3 ( temps ) : return sum ( temps [ - 4:] ) / len ( temps [ - 4:] ) def f4 ( temps ) : return max ( temps ) def f5 ( temps ) : return temps[:: - : - 1] def f6 ( temps ) : result = [ ] for temp in temps: if temp > 17: result.append ( temp ) return result Hver rad nedenfor har et kall til funksjonene ovenfor. Skriv i tekstfeltet hva svaret blir. Flyttall avrundes til en desimal. print ( \"{f1 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f2 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f3 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f4 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f5 ( temperatures ) }\" ) skriver ut print ( \"{f6 ( temperatures ) }\" ) skriver ut 5 Numpy og matriser Maks poeng: 6 Skriv ferdig funksjonen get_{diagonal} ( velg kode fra nedtrekksmeny ) som tar inn en matrise A, og returnerer en ny matrise A_{diag} der det kun er diagonalelementene fra A som er med ( resten av matriseelementene er lik 0 ) . For eksempel, dersom input til funksjonen er matrisen A nedenfor, så skal output være matrisen D. Et matriseelement ligger langs diagonalen dersom i = j. Eksempel: [10 3 - 5 A = 1 17 2570 15 1839 4567 [10 0 0 0 0 - 5 0 0 →D = 0 0 6 0 17 10 0 0 0 10 import numpy as np def get_{diagonal} ( A ) : rows, cols = np.shape ( A ) A_{diag} = np.zeros ( [rows, cols] ) for i in range ( rows ) : for j in range ( cols ) : if i = = j: Velg alternativ ( A_{diag}[i, j] = A[i, j], A_{diag}[i, j] = A[rows, cols], A_{diag}[i, j] = A_{diag}[i, i], A[i, j] = A_{dialg}[i, j] ) return A_{diag} Maks poeng: 4 6 Analyse av listedata Lag en funksjon bmi_{statistikk} som kan ta inn en liste med persondata ( høyde og vekt ) , og returnerer andelen av personene som har en kroppsmasseindeks ( BMI ) som er over en viss terskel i prosent. Formel for utregning av BMI ( høyde er gitt i meter ) : BMI vekt = høyde² Eksempel på data: bmi_{data} = [[180, 90], terskel = 25 [195, 92], [165, 66]] I tabellen representerer hver rad en person, der første kolonne er høyde målt i centimeter ( cm ) og andre kolonne er vekt målt i Kg. Eksempel på funksjonskall ( gitt at variabelen bmi_{data} og terskel er definert som ovenfor ) : andel bmi_{statistikk} ( bmi_{data}, terskel ) print ( f\"Andel av personene med BMI over {terskel}: {andel:.2f}%\" ) Skriver ut: Andel av personene med BMI over 25: 33.33% Skriv ditt svar her 1 Maks poeng: 5 7 Numerisk derivasjon Vi måler følgende verdier for høyden til en drone: h = [153, 155, 158, 163, 170, 178, 185, 189, 188, 183] Målingene er gjort ved følgende tidspunkt: t = [0.2, 0.4, 0.6, 0.8, 1.0, 1.2, 1.4, 1.6, 1.8, 2.0] Vi ser bort fra enhetene til h og t. Vi antar at dronen kun beveger seg i høyderetningen. Hva gir forroverdifferanse som en tilnærming til den tidsderiverte av høyden? Uforover ( 1.0 ) = ' Hva gir bakoverdifferanse? Ubakover ( 1.0 ) Hva gir sentraldifferanse? Usentral ( 1.0 ) Maks poeng: 6 8 Hvilken metode? Finn hvilken numerisk metode som kan brukes til å løse hvilken oppgave. Hvert svaralternativ passer til nøyaktig en oppgave. A: Vi har målt hastigheten v ( t ) og startposisjonen s ( start ) til en drone, og er interesserte i å vite posisjonen. Det vil si: Vi kjenner v ( t ) = ds for tiden ti [tstart, tslutt], og vil finne s ( t ) for ti samme tidsrommet [tstart, tslutt]. B: Vi har målt posisjonen til en drone, og er interesserte i å finne hastigheten. Det vil si: Vi kjenner s ( t ) for tiden i [tstart, tslutt], og vil finne v ( t ) = ds for tidsrommet ( tstart, tslutt ) . C: En drone mister motorkraften, og faller fritt. Vi vet at dy v ( t ) . ( g, k og mer konstante tall vi vet. ) = g - kv2 Vi er interesserte i å finne m D: Vi er gitt at en drone har følgende høyde målt fra hustaket ved tiden t: h ( t ) = et 0.001ť². Vi er interesserte i ved hvilket tidspunkt høyden blir null, altså for hvilket tidpunkt t man får h ( t ) = 0. Finn de som passer sammen: Newtons metode Foroverdifferanse Simpsons metode eller Eulers metode Vi har ikke nok informasjon C A D B О Maks poeng: 4 9 Newtons metode Bruk to iterasjoner av Newtons metode til å løse ligningen sin ( x ) + x = 2.0 Det kan være nyttig at rac{1}{2} ( sin ( x ) ) = cos ( x ) . Bruk startgjetning x0 = 0.5 Ett steg av Newtons metode gir: To steg av Newtons metode gir: Maks poeng: 6 10 Differensialligning En sten faller med hastigheten v ( t ) , der v ( t ) følger differensialligningen: = 9 - kv² = Vi ser bort fra enheter og går ut fra g = 9.81 og k 0.15. Ved t = 0.0 er hastigheten 3.0 det vil si v ( 0.0 ) = 3.0. I numerikkurset har dere lært en metode for å løse differensialligninger numerisk. Denne metoden står på formelarket. Bruk ett eller flere steg i denne metoden til å beregne en tilnærming for hastigheten ett tidels sekund senere. Det vi si, finn en tilnærming til v ( 0.1 ) . v ( 0.1 ) ≈ Maks poeng: 5 11 Konvergensrate Feil som funksjon av steglengde 10¹ E 10° 10 - 1 10 - 1 10° h Over ser dere et logaritmisk plot av feilen € som en funksjon av steglengden h for en numerisk metode. Vi ser at € = k ha, der k og a er konstanter. Det er oppgitt at a er et heltall. Dere skal bestemme a ut fra grafen. a = Dersom vi bruker steglengde h = 0.09 får vi feilen € = 0.09. Hvilken steglengde h må vi velge for at feilen skal bli € = 0.01? h = Maks poeng: 5 12 Integrasjon Vi ser på funksjonen: g ( x ) = sin ( x ) Bruk Trapesmetoden med to delintervaller ( tre punkter ) til å finne en tilnærming til I = = g ( x ) dx. Bruk så Simpsons metode med to delintervaller ( tre punkter ) til å tilnærme I. Hva er avviket fra eksakt verdi? ( Eksakt verdi er 2. ) Hvilken metode er den mest nøyaktige? Vi ser så på h ( x ) = 123.45x² - 4.34526x + 325 Dersom du skal beregne fr h ( x ) dx med tre punkter, vil trapesmetoden eller Simpsons metode gi minst feil? Trenger du å regne ut integralet for å svare på spørsmålet? Begrunn svaret. Skriv ditt svar her Format | E |☑ Words: 0 Maks poeng: 7 13 Numerisk derivasjon Gitt en matematisk funksjon f ( x ) = ( x + 3.5 ) 3 + 2. x² - 10 Fullfør programmet nedenfor slik at det regner ut en tilnærming til funksjonens deriverte for intervallet x = 0 t.o.m x = 4 med bruk av senterdifferanse med skrittlengde h = som funksjon av x i intervallet 0 < x < 4. import numpy as np import matplotlib.pyplot as plt def f ( x ) : 0.02, og plotter f' ( x ) Velg alternativ ( ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10, y = ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10, f ( x ) = ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10, y_{der} = ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10 ) return y h = 0.02 X = Velg alternativ ( np.linspace ( 0, 4 + h, h ) , np.arange ( 0, 4, h ) , np.linspace ( 0, 4, h ) , np.arange ( 0, 4 + h, h ) ) f_{der} = Velg alternativ ( ( f ( x + h ) - f ( x ) ) / h * 2, f ( x + h ) - f ( x - h ) / ( h + h ) , ( f ( x + h ) - f ( x - |h ) ) / 2 * h, ( f ( x + h ) - f ( x - h ) ) / ( 2 * h ) ) Velg alternativ ( plt.plot ( f_{der} ) , plt.plot ( f_{der}, x ) , plt.plot ( f, f_{der} ) , plt.plot ( x, f_{der} ) ) Maks poeng: 6 14 Numerisk Integrasjon med Trapesmetoden Fullfør koden nedenfor slik at den bruker trapesmetoden til å beregne integralet av: f ( x ) = x² fra 0 til 1 med n = 10 delintervall. import numpy as np def f ( x ) : Velg alternativ ( y = 2 * x, y = x * * 2, y = 2 * x * * 2, y = f ( x ) ) return y a = 0 b = 1 n = 10 h = ( b - a ) / n X = Velg alternativ ( linspace ( n + h / 2, n - h / 2 ) , linspace ( a, b, n ) , np.linspace ( a + h / 2, b - h / 2 ) , np.linspace ( a, b, n + 1 ) ) y = f ( x ) integral = Velg alternativ ( ( h / 2 ) * ( y[0] + sum ( y[1: - 1] ) + y[ - 1] ) , sum ( y[1: - 1] ) , ( h / 2 ) * ( y[0] + 2 * sum ( y[1: - 1] ) , ( h / 2 ) * ( y[0] + 2 * sum ( y[1 - 1] ) + y[ - 1] ) ) Maks poeng: 6 15 Eulers metode Fullfør koden nedenfor slik at den bruker Eulers metode til å løse differensialligningen y = y = x² + 1 med initialverdien y ( 0 ) = 0.5 og skrittlengde h = 0.5 for x fra 0 til 1. import numpy as np. def f ( x, y ) : Velg alternativ ( return y' + x * * 2 - 1, return y - x * 2 + 1, return y - * * * 2 + 1, y - x * * 2 + 1 ) h = 0.5 X = Velg alternativ ( np.arange ( 0, 1 + h, h ) , np.arange ( h, 1 + h, h ) , arange ( 0, 1 + h, h ) , np.arange ( 0, 1, h ) ) y = np.zeros ( len ( x ) ) y[0] = 0.5 for i in range ( 1, len ( x ) ) : y[i] = Velg alternativ ( h * f ( x[i - 1], y[i - 1] ) - y[i - 1], y[i + 1] + h * f ( x[i - 1], y[i + 1] ) , y[i - 1] + f ( x[i - 1], y[i - 1] ) / h, y[i - 1] + h * f ( x[i - 1], y[i - 1] ) ) Maks poeng: 7.5 16 Fikspunktiterasjon Gitt ligningen ( 4 - x ) ² = 4 Fullfør programkoden nedenfor slik at den bruker fikspunktiterasjon med initialverdi x0 = Otil å finne en løsning til ligningen med maksimalt avvik på 10 - 6. def g ( x ) : return Velg alternativ ( ( x * * 2 + 12 ) / 8, ( x * * 2 + 12 ) , ( x * * 2 + 8 ) / 12, ( x * * 2 + 16 ) ) x = 0 while Velg alternativ ( abs ( g ( x ) ) > 1e - 6, abs ( g ( x ) - x ) > 1e - 6, abs ( x ) < 1e - 6, abs ( g ( x ) - x ) <1e - 6 ) : Velg alternativ ( x = g ( x ) , x = x - g ( x ) / g_{deriv} ( x ) , x + = g ( x ) , x + = 1e - 6 ) print ( f\"Tilnærmet løsning funnet: x = {x}\" ) Maks poeng: 7.5 17 Absolutt og relativ feil I numerikk bruker vi ofte absolutt feil og relativ feil til å evaluere nøyaktigheten til en numerisk beregning. Gitt en eksakt tallverdi y og en tilnærmet tallverdi x, vil den matematiske definisjonen på absolutt og relativ feil være: absolutt feil relativ feil = |x - y| x - y y - Funksjonen nedenfor har som oppgave å sjekke om to tall x og y er tilnærmet like gitt en absolutt toleranse atol og relativ toleranse rtol. Funksjonen skal returnere True dersom absolutt feil atol eller dersom relativ feil ≤ rtol, og returnere False for alle andre tilfeller. Fullfør koden til funksjonen is_{approx_equal} slik at den fungerer som beskrevet over, samtidig som den unngår \"ulovlige\" matematiske regneoperasjoner ( dvs. regneoperasjoner som gir feilmelding i Python ) . def is approx_{equal} ( x, y, rtol, atol ) : if Velg alternativ ( abs ( x - y ) < = max ( atol, abs ( y ) * rtol ) , abs ( ( x - y ) / y ) < = rtol and abs ( x - y ) < = atol, [ ( xy ) / y] > = rtol and [x - y] > = atol, abs ( x - y ) < = min ( atol, abs ( y ) * rtol ) ) : return True else: return False Maks poeng: 7",
  "i Forside Eksamensoppgave i: INGA1002 / INGG1002 / INGT1002 Programmering og numerikk Dato: 16.12.2024 Tid: kl 09:00 - 12:00 Faglig kontakt under eksamen: Trondheim INGT1002 Programmering: Majid Rouhani Numerikk: Markus Arthur Köbis Gjøvik INGG1002 Programmering: Jon Yngve Hardeberg Numerikk: Charles Curry Ålesund INGA1002 Programmering: Kai Erik Hoff Numerikk: Truls Helge Øi Møter i eksamenslokalet: NEI Hjelpemiddelkode / Tillatte hjelpemidler: D - Ingen trykte eller håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. ANNEN INFORMASJON: Les oppgavene nøye og gjør dine egne antagelser. Presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Dette gjelder ikke - flervalgsoppgaver. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. FAGSPESIFIKK INFORMASJON Ingen håndtegninger: Denne eksamenen tillater ikke bruk av håndtegninger. Har du likevel fått utdelt skanne - ark, er dette en feil. Arkene vil ikke bli akseptert for innlevering, og de vil derfor heller ikke sendes til sensur. Vekting av oppgavene: Oppgavesettet er delt inn i 3 seksjoner ( programmering, numerikk, og felles oppgaver ) . Programmering ( 1 - 6 ) og numerikk ( 7 - 12 ) oppgavene teller 33% hver, mens siste delen ( 13 - 17 ) teller 34%. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg <<Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 Matematiske operasjoner Gitt variabeldefinisjonen c = 7 Hva blir verdien til c etter at vi utfører følgende operasjoner? c = c * * 2 c % = 5 Velg ett alternativ: 2 O 4 3 4.0 Gitt variabeldefinisjonen z = 8 Hva blir verdien til z etter at vi utfører følgende operasjoner? Z + = 10 z = 3 Velg ett alternativ 9 O 3 ○ 6.0 6 Maks poeng: 4 2 Funksjoner Denne koden definerer en funksjon is_{prime} ( n ) som sjekker om et gitt tall n er et primtall. Test av funksjonen gir disse resultatene: is_{prime} ( 10 ) # returnerer False is_{prime} ( 11 ) # returnerer True is_{prime} ( 1 ) # returnerer False is_{prime} ( 13 ) # returnerer True Lag funksjonen is_{prime} ved å plassere kodefragment i rett rekkefølge. Noen av fragmentene skal IKKE brukes. Pass på å plassere draområdene slik at de \"snapper\" til ønsket rute. Se bort fra innrykk def is_{prime} ( n ) : if n < = 1: return False for j in range ( 2, n ) : if n % j = = 0: return False return True from math import sqrt if n / / j = = 0: Maks poeng: 7 3 Sammenligningsoperatorer Gitt følgende kode: a = 5 b = 5.0 C = \"5\" d = True e = False Nedenfor står en rekke uttrykk. For hvert uttrykk, kryss av for True hvis uttrykket er sant, eller False hvis det er usant, eller kryss av for Error hvis uttrykket vil gi syntaksfeil. Finn de som passer sammen: b> a a > = b d = = 1 a ! = c e < = 0 a = = b d<e False О True О Error О О Maks poeng: 7 4 Lister og indekser Gitt følgende programkode: temperatures = def f1 ( temps ) : [15.5, 17.2, 16.8, 14.9, 18.3, 19.0, 16.5] return sum ( temps ) / len ( temps ) def f2 ( temps ) : return sum ( temps[:3] ) / len ( temps [:3] ) def f3 ( temps ) : return sum ( temps [ - 4:] ) / len ( temps [ - 4:] ) def f4 ( temps ) : return max ( temps ) def f5 ( temps ) : return temps[:: - : - 1] def f6 ( temps ) : result = [ ] for temp in temps: if temp > 17: result.append ( temp ) return result Hver rad nedenfor har et kall til funksjonene ovenfor. Skriv i tekstfeltet hva svaret blir. Flyttall avrundes til en desimal. print ( \"{f1 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f2 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f3 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f4 ( temperatures ) :.1f}\" ) skriver ut print ( \"{f5 ( temperatures ) }\" ) skriver ut print ( \"{f6 ( temperatures ) }\" ) skriver ut 5 Numpy og matriser Maks poeng: 6 Skriv ferdig funksjonen get_{diagonal} ( velg kode fra nedtrekksmeny ) som tar inn en matrise A, og returnerer en ny matrise A_{diag} der det kun er diagonalelementene fra A som er med ( resten av matriseelementene er lik 0 ) . For eksempel, dersom input til funksjonen er matrisen A nedenfor, så skal output være matrisen D. Et matriseelement ligger langs diagonalen dersom i = j. Eksempel: [10 3 - 5 A = 1 17 2570 15 1839 4567 [10 0 0 0 0 - 5 0 0 →D = 0 0 6 0 17 10 0 0 0 10 import numpy as np def get_{diagonal} ( A ) : rows, cols = np.shape ( A ) A_{diag} = np.zeros ( [rows, cols] ) for i in range ( rows ) : for j in range ( cols ) : if i = = j: Velg alternativ ( A_{diag}[i, j] = A[i, j], A_{diag}[i, j] = A[rows, cols], A_{diag}[i, j] = A_{diag}[i, i], A[i, j] = A_{dialg}[i, j] ) return A_{diag} Maks poeng: 4 6 Analyse av listedata Lag en funksjon bmi_{statistikk} som kan ta inn en liste med persondata ( høyde og vekt ) , og returnerer andelen av personene som har en kroppsmasseindeks ( BMI ) som er over en viss terskel i prosent. Formel for utregning av BMI ( høyde er gitt i meter ) : BMI vekt = høyde² Eksempel på data: bmi_{data} = [[180, 90], terskel = 25 [195, 92], [165, 66]] I tabellen representerer hver rad en person, der første kolonne er høyde målt i centimeter ( cm ) og andre kolonne er vekt målt i Kg. Eksempel på funksjonskall ( gitt at variabelen bmi_{data} og terskel er definert som ovenfor ) : andel bmi_{statistikk} ( bmi_{data}, terskel ) print ( f\"Andel av personene med BMI over {terskel}: {andel:.2f}%\" ) Skriver ut: Andel av personene med BMI over 25: 33.33% Skriv ditt svar her 1 Maks poeng: 5 7 Numerisk derivasjon Vi måler følgende verdier for høyden til en drone: h = [153, 155, 158, 163, 170, 178, 185, 189, 188, 183] Målingene er gjort ved følgende tidspunkt: t = [0.2, 0.4, 0.6, 0.8, 1.0, 1.2, 1.4, 1.6, 1.8, 2.0] Vi ser bort fra enhetene til h og t. Vi antar at dronen kun beveger seg i høyderetningen. Hva gir forroverdifferanse som en tilnærming til den tidsderiverte av høyden? Uforover ( 1.0 ) = ' Hva gir bakoverdifferanse? Ubakover ( 1.0 ) Hva gir sentraldifferanse? Usentral ( 1.0 ) Maks poeng: 6 8 Hvilken metode? Finn hvilken numerisk metode som kan brukes til å løse hvilken oppgave. Hvert svaralternativ passer til nøyaktig en oppgave. A: Vi har målt hastigheten v ( t ) og startposisjonen s ( start ) til en drone, og er interesserte i å vite posisjonen. Det vil si: Vi kjenner v ( t ) = ds for tiden ti [tstart, tslutt], og vil finne s ( t ) for ti samme tidsrommet [tstart, tslutt]. B: Vi har målt posisjonen til en drone, og er interesserte i å finne hastigheten. Det vil si: Vi kjenner s ( t ) for tiden i [tstart, tslutt], og vil finne v ( t ) = ds for tidsrommet ( tstart, tslutt ) . C: En drone mister motorkraften, og faller fritt. Vi vet at dy v ( t ) . ( g, k og mer konstante tall vi vet. ) = g - kv2 Vi er interesserte i å finne m D: Vi er gitt at en drone har følgende høyde målt fra hustaket ved tiden t: h ( t ) = et 0.001ť². Vi er interesserte i ved hvilket tidspunkt høyden blir null, altså for hvilket tidpunkt t man får h ( t ) = 0. Finn de som passer sammen: Newtons metode Foroverdifferanse Simpsons metode eller Eulers metode Vi har ikke nok informasjon C A D B О Maks poeng: 4 9 Newtons metode Bruk to iterasjoner av Newtons metode til å løse ligningen sin ( x ) + x = 2.0 Det kan være nyttig at rac{1}{2} ( sin ( x ) ) = cos ( x ) . Bruk startgjetning x0 = 0.5 Ett steg av Newtons metode gir: To steg av Newtons metode gir: Maks poeng: 6 10 Differensialligning En sten faller med hastigheten v ( t ) , der v ( t ) følger differensialligningen: = 9 - kv² = Vi ser bort fra enheter og går ut fra g = 9.81 og k 0.15. Ved t = 0.0 er hastigheten 3.0 det vil si v ( 0.0 ) = 3.0. I numerikkurset har dere lært en metode for å løse differensialligninger numerisk. Denne metoden står på formelarket. Bruk ett eller flere steg i denne metoden til å beregne en tilnærming for hastigheten ett tidels sekund senere. Det vi si, finn en tilnærming til v ( 0.1 ) . v ( 0.1 ) ≈ Maks poeng: 5 11 Konvergensrate Feil som funksjon av steglengde 10¹ E 10° 10 - 1 10 - 1 10° h Over ser dere et logaritmisk plot av feilen € som en funksjon av steglengden h for en numerisk metode. Vi ser at € = k ha, der k og a er konstanter. Det er oppgitt at a er et heltall. Dere skal bestemme a ut fra grafen. a = Dersom vi bruker steglengde h = 0.09 får vi feilen € = 0.09. Hvilken steglengde h må vi velge for at feilen skal bli € = 0.01? h = Maks poeng: 5 12 Integrasjon Vi ser på funksjonen: g ( x ) = sin ( x ) Bruk Trapesmetoden med to delintervaller ( tre punkter ) til å finne en tilnærming til I = = g ( x ) dx. Bruk så Simpsons metode med to delintervaller ( tre punkter ) til å tilnærme I. Hva er avviket fra eksakt verdi? ( Eksakt verdi er 2. ) Hvilken metode er den mest nøyaktige? Vi ser så på h ( x ) = 123.45x² - 4.34526x + 325 Dersom du skal beregne fr h ( x ) dx med tre punkter, vil trapesmetoden eller Simpsons metode gi minst feil? Trenger du å regne ut integralet for å svare på spørsmålet? Begrunn svaret. Skriv ditt svar her Format | E |☑ Words: 0 Maks poeng: 7 13 Numerisk derivasjon Gitt en matematisk funksjon f ( x ) = ( x + 3.5 ) 3 + 2. x² - 10 Fullfør programmet nedenfor slik at det regner ut en tilnærming til funksjonens deriverte for intervallet x = 0 t.o.m x = 4 med bruk av senterdifferanse med skrittlengde h = som funksjon av x i intervallet 0 < x < 4. import numpy as np import matplotlib.pyplot as plt def f ( x ) : 0.02, og plotter f' ( x ) Velg alternativ ( ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10, y = ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10, f ( x ) = ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10, y_{der} = ( x + 3.5 ) * * 3 + 2 * x * * 2 - 10 ) return y h = 0.02 X = Velg alternativ ( np.linspace ( 0, 4 + h, h ) , np.arange ( 0, 4, h ) , np.linspace ( 0, 4, h ) , np.arange ( 0, 4 + h, h ) ) f_{der} = Velg alternativ ( ( f ( x + h ) - f ( x ) ) / h * 2, f ( x + h ) - f ( x - h ) / ( h + h ) , ( f ( x + h ) - f ( x - |h ) ) / 2 * h, ( f ( x + h ) - f ( x - h ) ) / ( 2 * h ) ) Velg alternativ ( plt.plot ( f_{der} ) , plt.plot ( f_{der}, x ) , plt.plot ( f, f_{der} ) , plt.plot ( x, f_{der} ) ) Maks poeng: 6 14 Numerisk Integrasjon med Trapesmetoden Fullfør koden nedenfor slik at den bruker trapesmetoden til å beregne integralet av: f ( x ) = x² fra 0 til 1 med n = 10 delintervall. import numpy as np def f ( x ) : Velg alternativ ( y = 2 * x, y = x * * 2, y = 2 * x * * 2, y = f ( x ) ) return y a = 0 b = 1 n = 10 h = ( b - a ) / n X = Velg alternativ ( linspace ( n + h / 2, n - h / 2 ) , linspace ( a, b, n ) , np.linspace ( a + h / 2, b - h / 2 ) , np.linspace ( a, b, n + 1 ) ) y = f ( x ) integral = Velg alternativ ( ( h / 2 ) * ( y[0] + sum ( y[1: - 1] ) + y[ - 1] ) , sum ( y[1: - 1] ) , ( h / 2 ) * ( y[0] + 2 * sum ( y[1: - 1] ) , ( h / 2 ) * ( y[0] + 2 * sum ( y[1 - 1] ) + y[ - 1] ) ) Maks poeng: 6 15 Eulers metode Fullfør koden nedenfor slik at den bruker Eulers metode til å løse differensialligningen y = y = x² + 1 med initialverdien y ( 0 ) = 0.5 og skrittlengde h = 0.5 for x fra 0 til 1. import numpy as np. def f ( x, y ) : Velg alternativ ( return y' + x * * 2 - 1, return y - x * 2 + 1, return y - * * * 2 + 1, y - x * * 2 + 1 ) h = 0.5 X = Velg alternativ ( np.arange ( 0, 1 + h, h ) , np.arange ( h, 1 + h, h ) , arange ( 0, 1 + h, h ) , np.arange ( 0, 1, h ) ) y = np.zeros ( len ( x ) ) y[0] = 0.5 for i in range ( 1, len ( x ) ) : y[i] = Velg alternativ ( h * f ( x[i - 1], y[i - 1] ) - y[i - 1], y[i + 1] + h * f ( x[i - 1], y[i + 1] ) , y[i - 1] + f ( x[i - 1], y[i - 1] ) / h, y[i - 1] + h * f ( x[i - 1], y[i - 1] ) ) Maks poeng: 7.5 16 Fikspunktiterasjon Gitt ligningen ( 4 - x ) ² = 4 Fullfør programkoden nedenfor slik at den bruker fikspunktiterasjon med initialverdi x0 = Otil å finne en løsning til ligningen med maksimalt avvik på 10 - 6. def g ( x ) : return Velg alternativ ( ( x * * 2 + 12 ) / 8, ( x * * 2 + 12 ) , ( x * * 2 + 8 ) / 12, ( x * * 2 + 16 ) ) x = 0 while Velg alternativ ( abs ( g ( x ) ) > 1e - 6, abs ( g ( x ) - x ) > 1e - 6, abs ( x ) < 1e - 6, abs ( g ( x ) - x ) <1e - 6 ) : Velg alternativ ( x = g ( x ) , x = x - g ( x ) / g_{deriv} ( x ) , x + = g ( x ) , x + = 1e - 6 ) print ( f\"Tilnærmet løsning funnet: x = {x}\" ) Maks poeng: 7.5 17 Absolutt og relativ feil I numerikk bruker vi ofte absolutt feil og relativ feil til å evaluere nøyaktigheten til en numerisk beregning. Gitt en eksakt tallverdi y og en tilnærmet tallverdi x, vil den matematiske definisjonen på absolutt og relativ feil være: absolutt feil relativ feil = |x - y| x - y y - Funksjonen nedenfor har som oppgave å sjekke om to tall x og y er tilnærmet like gitt en absolutt toleranse atol og relativ toleranse rtol. Funksjonen skal returnere True dersom absolutt feil atol eller dersom relativ feil ≤ rtol, og returnere False for alle andre tilfeller. Fullfør koden til funksjonen is_{approx_equal} slik at den fungerer som beskrevet over, samtidig som den unngår \"ulovlige\" matematiske regneoperasjoner ( dvs. regneoperasjoner som gir feilmelding i Python ) . def is approx_{equal} ( x, y, rtol, atol ) : if Velg alternativ ( abs ( x - y ) < = max ( atol, abs ( y ) * rtol ) , abs ( ( x - y ) / y ) < = rtol and abs ( x - y ) < = atol, [ ( xy ) / y] > = rtol and [x - y] > = atol, abs ( x - y ) < = min ( atol, abs ( y ) * rtol ) ) : return True else: return False Maks poeng: 7",
  "TMM4100 Materialteknikk, Eksamen 2022 Aug, Løsning 1 Norsk: Bindingsenergien mellom to atom er gitt av 8 E = - 4 + der A = 1.75 eV nm og B = 2.10 - 6 eV nm³ Regn ut likevektsavstanden ro mellom de to atomene English: The bonding energy between two atoms is given by E = + where A = 1.75 eV nm and B = 2.106 eV nm8 Compute the equilibrium distance ro between the two atoms. Velg ett alternativ / Select one alternative O 0.39 nm ○ 0.34 nm 0.44 nm O 0.29 nm ○ 0.19 nm 0.24 nm ○ 0.14 nm ○ 0.49 nm E = - Ar + Br8 F = dEdr = Ar - 2 - 8Br - 9 Likevekt når netto kraft er null: EAr - 2 - Br - 9 - 0⇒r - 2 ( A - 8Br - 7 ) = 0⇒r = ( A8B ) - 17 = 0.19 [nm] r0 = ( ( 1.75 ) / ( 8 * 2E - 6 ) ) * * ( - rac{1}{7} ) print ( ro ) 0.19061389771558812 Maks poeng: 3 Sjekk svar In [1]: 2 Norsk: Bindingsenergien mellom to atom er, som gitt i forrige oppgave, lik E = - 4 + der A = 1.75 eV nm og B = 2.10 - 6 eV nm³ Regn ut bindingsenergien Eo mellom de to atomene English: The bonding energy between two atoms is as given in the previous problem: E = - 4 + where A = 1.75 eV nm and B = 2.106 eV nm8 Compute the bonding energy Eo between the two atoms. Velg ett alternativ / Select one alternative 0 - 6 eV O - 8 eV O - 14 eV O - 4 eV O - 10 eV O - 12 eV O - 2 eV 0 - 16 eV Setter inn for likevektsavstanden fra forrige oppgave: - 1.75 * 0.19 * * ( - 1 ) + 2E - 6 * 0.19 * * ( - 8 ) - 8.032917120845044 E = - A0.19 + B0.198 = - 8.03 [eV] Maks poeng: 3 Sjekk svar In [2]: Out[2]: 3 Norsk: Energipotensialet for binding som er gitt i de to forrige oppgavene indikerer at bindingen er i en bestemt kategori. Forklar. English: The energy potential for the bonding given in the two previous problems indicates that the bonding belongs to a specific category. Explain. Skriv ditt svar her / Write your answer here Format I ว Σ ☑ Hjelp Words: 0 Maks poeng: 2 Sjekk svar SVAR: Den attraktive delen indikerer kraft mellom to lade partikler ( Coulumbs lov ) , altså ionebinding. Fra forelesninger / presentasjoner: FA 9₁ = e - + Attractive, ionic: EA r Sensurveiledning: - kommer frem til ionebinding ( + 1p ) - korrekt / fornuftig argumentasjon ( + 1p ) Maks 2p totalt = 1 FA Α\\piερ e - e 92 = - e F r 4 Norsk: Regn ut vektprosenten av aluminium i Al2O3 og velg alternativet som er mest nøyaktig. English: Compute the weight percent of aluminum in Al2O3 and select the most accurate alternative. Velg ett alternativ / Select one alternative ○ 57 wt% 49 wt% ○ 51 wt% 43 wt% ○ 55 wt% ○ 45 wt% 53 wt% ○ 47 wt% ( 2 * 27 ) / ( 2 * 27 + 3 * 16 ) 0.5294117647058824 Maks poeng: 3 Sjekk svar 2 - 272 - 27 + 3 - 16 = 0.53 - 53 wt% In [3]: Out[3]: 5 Norsk: Wolfram ( Tungsten ) har tetthet lik 19.25 g / cm³. Regn ut dimensjonene a til enhetscellen til Wolfram og velg det mest nøyaktige alternativet. English: The density of Tungsten is 19.25 g / cm³. Compute the dimensions a for the unit cell of Tungsten and select the most accurate alternative. 10.811 13 VIII Al IIIB IVB VB VIB VIIB IB IIB 26.982 21 22 23 24 25 26 27 28 29 30 31 Sc Ti Mn Fe Co Ni Cu Zn Ga 1.956 47.87 50.942 51.996 54.938 55.845 58.933 58.691 63.55 65.41 69.72 39 40 41 42 43 44 45 46 47 48 49 Y Zr Nb Mo Tc Ru Rh Pd Ag Cd In 8.91 91.22 92.91 95.94 ( 98 ) 101.07 102.91 106.4 107.87 112.41 114.82 Rare 72 73 74 75 76 77 78 79 80 81 arth Hf Ta W Re Os Ir Pt Au Hg TI eries 178.49 180.95 183.84 186.2 190.23 192.2 195.08 196.97 200.59 204.38 Velg ett alternativ / Select one alternative ○ 315 pm 290 pm ○ 365 pm ○ 415 pm O 465 pm ○ 390 pm O 440 pm ○ 340 pm Krystallstrukturen er BCC, og dermed n = 2. Fra relasjon for tetthet: Maks poeng: 3 Sjekk svar a = V13c = ( nAPAN ) 13 = ( 2·0.18419250·6·1023 ) 13 - 317·10 - 12 [m] = 315 pm In [4]: VC = ( 2 * 0.184 ) / ( 19250 * 6E23 ) a = VC * * ( rac{1}{3} ) print ( a,'m = ',a * 1E12,'pm' ) 3.1702142332325707e - 10 m = 317.02142332325707 pm 6 Norsk: a ) For flere metaller, deriblant magnesium, aluminium, titan og jern ( stål ) og til en viss grad også wolfram, eksisterer det en tydelig trend i sammenhengen mellom E - modul og tetthet. Vis dette med kvantitative eksempler. b ) Gi eksempler på metaller som faller tydelig utenfor trenden som er indikert i a ) English: a ) For many metals such as magnesium, aluminum, titanium and iron ( steel ) and to some extent tungsten, there is a clear trend in the relationship between Young's modulus and density. Show this trend using quantitative examples. b ) Provide examples of metals that fall clearly outside the trend indicated in a ) Skriv ditt svar her / Write your answer here Format BIU imes imes² x D ว a ) Noen eksempel på nokså likt forhold mellom E - modul og tetthet, altså verdien av Ep print ( 'Aluminium: ', rac{70000}{2700} ) print ( 'Stål: ', rac{45000}{1800} ) print ( 'Wolfram: ', rac{411000}{19250} ) Hjelp Σ ☑ Words: 0 Maks poeng: 5 Sjekk svar In [5]: ', rac{200000}{7800} ) print ( 'Titan: ', rac{115000}{4500} ) print ( 'Magnesium: Aluminium: 25.925925925925927 Stål: 25.641025641025642 Titan: 25.555555555555557 Magnesium: 25.0 Wolfram: 21.350649350649352 b ) Kobber og tinn er greie eksempler som ikke passer med trenden i a ) . Sensurveiledning: At disse 'flere' metaller har omtrent konstant forholde mellom E - modul og tetthet vises ( + 2p ) Minst 3 kvalifiserte eksempler med tall ( + 2p ) Minst 1 kvalifiserte eksempler som faller utenom ( + 2p ) Maks 5p totalt 7 Norsk: Regn ut den utløste skjærspenningen for retningen [110] langs planet ( 111 ) når det virker en spenning lik 100 MPa i retningen [870]. Velg alternativet som er mest nøyaktig. English: Compute the resolved shear stress for the direction [110] along the plane ( 111 ) when a stress of 100 MPa acts in the direction [870]. Select the most accurate alternative. Velg ett alternativ / Select one alternative ○ 35 MPa O 10 MPa 0 MPa O 15 MPa ○ 30 MPa ○ 5 MPa ○ 20 MPa ○ 25 MPa cosphi = ( 8 * 1 + 7 * 1 ) / ( ( ( 8 * * 2 + 7 * * 2 + 0 * * 2 ) * * 0.5 ) * ( ( 1 * * 2 + 1 * * 2 + 1 * * 2 ) * * 0.5 ) ) coslam = ( 8 * 1 - 7 * 1 ) / ( ( ( 8 * * 2 + 7 * * 2 + 0 * * 2 ) * * 0.5 ) * ( ( 1 * * 2 + 1 * * 2 + 0 * * 2 ) * * 0.5 ) ) print ( 100 * cosphi * coslam ) 5.419225094653048 Maks poeng: 4 Sjekk svar In [6]: 8 Norsk: Forklar betydningen av følgende påstand: FCC har 12 glidesystem. English: Explain the meaning of the following claim: FCC has 12 slip systems. Skriv ditt svar her / Write your answer here Format BIUX₂ x² Ix 直 ← Glidesystem ( slip systems ) for FCC ว Hjelp Σ ☑ Words: 0 Maks poeng: 4 Sjekk svar ( 111 ) = ( īīī ) ( 1 1ī ) = ( Ī Ī 1 ) ( 1ī 1 ) = ( ī 1ī ) ( I 1 1 ) = ( 1īī ) Glidesystem = glideplan + retning Tettpakket plan, familie: {111} Retninger, familie: <1 1 0> ما Retning i planet med høy LD Plan med høy PD 4 plan x 3 retninger hver = 12 system Sensurveiledning: Har forstått hva glidesystem er ( + 2p ) - Viser / forklarer de 12 glidesystem for FCC ( + 2p ) Maks 4p totalt 9 Norsk: Ved stasjonær diffusjon av en gass gjennom en plate øker diffusjonsfluksen 10 ganger når temperaturen økes fra 300 K til 400 K. Anta at andre betingelser / tilstander ikke endres ( konsentrasjoner etc ) når temperaturen endres, og regn ut aktiveringsenergien for diffusjon for dette tilfelle. Velg det mest nøyaktige alternativet. English: At steady - state diffusion of a gas through a plate, the flux increases 10 times when the temperature is increased from 300 K to 400 K. Assume that other conditions / states ( concentrations etc. ) do not change when the temperature changes, and compute the activation energy for diffusion for this case. Select the most accurate alternative. Velg ett alternativ / select one alternative ○ 23 kJ / mol 5 kJ / mol 14 kJ / mol O 11 kJ / mol 2 kJ / mol 8 kJ / mol 20 kJ / mol 17 kJ / mol Stasjonær diffusjon betyr: J = - DdCdx Maks poeng: 5 Sjekk svar Gradienten er identisk ved begge temperature ( ..anta at andre betingelser ikke endres ) , så dersom fluksen er 10 ganger større ved 400 K i forhold til 300 K, betyr det at diffusjonskoeffisienten øker 10 ganger fra 300 til 400 K. Altså: Dermed, D1D2 = 110 110 = D1D2 = Doexp ( - QaRT1 ) Doexp ( - QdRT2 ) = exp ( QdRT2 + QdRT1 ) = In ( 0.1 ) = ( QdRT2 + QdRT1 ) = Qd = ln ( 0.1 ) R rac{1}{400} - rac{1}{300} - 22962 [J / mol] = 23 [kJ / mol] R = 8.31 import math Qd = math.log ( 0.1 ) * R / ( rac{1}{400} - rac{1}{300} ) print ( 0.001 * Qd, 'kJ / mol' ) In [7]: 22.96137854733662 kJ / mol 10 Norsk: Konverter 1 MJ / mol til eV / atom. Velg det mest nøyaktige alternativet. English: Convert 1 MJ / mol to eV / atom. Select the most accurate alternative. Velg ett alternativ / Select one alternative O 100 eV / atom 50 eV / atom O 1000 eV / atom O 2000 eV / atom O 10 eV / atom 500 eV / atom ○ 1 eV / atom O 250 eV / atom res = ( 1E6 / ( 1.602E - 19 * 6.022E23 ) ) print ( res ) 10.365654688530734 Maks poeng: 2 Sjekk svar In [8]: 11 Norsk: Avstanden a mellom to karbonatom i et grafenlag er 142 pm. Anta at tettheten til grafitt er 2200 kg / m³. Regn ut avstanden mellom to grafenlag i krystallinsk grafitt ved hjelp av arealet for et heksagon som er gitt under. Velg de mest nøyaktige alternativet. English: The distance a between two carbon atoms in graphene is 142 pm. Assume that the density of graphite is 2200 kg / m³. Compute the distance between two layers of graphene in crystalline graphite when the area of a hexagon is given below. Select the most accurate alternative. A a 3\\sqrt3 A = Velg ett alternativ / Select one alternative ○ 364 pm ○ 301 pm ○ 310 pm O 337 pm ○ 346 pm 355 pm ○ 319 pm ○ 328 pm Maks poeng: 5 Sjekk svar Antall hele atom innenfor et heksagon på ene siden av planet er ( rac{1}{3} ) x 6 x ( rac{1}{2} ) = 1. Dersom enhetscellen omfatter 2 lag av grafen, har vi altså n = 2 hele karbonatom innenfor denne cellen. Fra tettheten til enhetscellen: p = nAVCNA = >Vc = nApNA = c3\\sqrt3s22 = nApNA⇒c = 2nA3\\sqrt3s2pNA = 4.12.0113\\sqrt3·1422 - 2200000·10 - 36.6.02 2 - 1023 = 346 pm c = ( 4 * 12.011 ) / ( 3 * 3 * * 0.5 * 142 * * 2 * 2200000E - 36 * 6.022E23 ) print ( c ) 346.112397309714 In [9]: 12 Norsk: Gjør rede for likheter og forskjeller mellom grått støpejern og seigjern ( kulegrafittjern ) med hensyn til innhold / sammenestning, mikrostruktur, og de mekaniske egenskapene. English: Explain the similarities and differences between gray cast iron and ductile cast iron with respect to content / composition, microstructure and the mechanical properties. Skriv ditt svar her / write your answer here Format - BI U imes imes² | Ix 1 = Hjelp 三 Ω Σ ☑ !!! Words: 0 Maks poeng: 6 Sjekk svar Cast Irons Gray Ductile White Malleable Grått støpejern: • 2.5 4.0 wt% C • 1.0 - 3.0 wt% Si • • • • Grafitt i form av flak Sprott / lav duktilitet Lav styrke Høy mekanisk demping Smelten flyter lett Lav kostnad ( a ) 20 μm Cast Irons Gray Ductile White Malleable Seigjern / kulegrafittjern • • • • • 2.5 - 4.0 wt% C 1.0 - 3.0 wt% Si + Mg eller Ce Grafitt i form av kuler Relativt til grått: • duktilt og . høyere styrke Sensurveiledning: Maks 6p totalt, skjønnsmessig vurdert ( b ) 50 μη 13 Norsk: Grått støpejern har vesentlig lavere tetthet enn karbonstål. Forklar hvorfor, der du inkluderer en realistisk utregning av tettheten til grått støpejern med typisk sammensetning. English: Gray cast iron has significantly lower density than carbon steel. Explain why and include a realistic computational example of the density of gray cast iron having a typical composition. Skriv ditt svar her / write your answer here Hjelp Format | BI U imes imes² 1x D อ 1 = 2 = Ω Σ ☑ Words: 0 Maks poeng: 6 Sjekk svar Karbonstål består essensielt av jern med tetthet rundt 7.85 og noe sementitt ( som har marginalt lavere tetthet enn jern ) og dermed ender vi på en tetthet på ca. 7.80 - 7.85. Grått støpjern med f.eks. 3 wt% grafitt med tetthet 2.2 ( fra forrige oppgave ) som eksempel: Anta at vi har 3 g grafitt og 97 g jern. Volumet av grafitt er dermed rac{3}{2}.2 1.3636363636363635 og volumet av jern er rac{97}{7}.85 In [10]: Out[10]: In [11]: Out[11]: 12.356687898089172 Totalt volum er dermed rac{3}{2}.2 + rac{97}{7}.85 In [12]: Out[12]: 13.720324261725535 og tettheten til støpejernet blir dermed total masse dividert på totalt volum: In [13]: 100 / ( rac{3}{2}.2 + rac{97}{7}.85 ) Out[13]: 7.288457480481115 Grått støpejern har også en betydelig andel silisium, noe som også vil bidra til lavere tetthet ( men ikke nødvendig å ta med for å vise det essensielle her ) Sensurveiledning: - viser at det er snakk om å blande jern og grafitt ( 2p ) bruker en fornuftig sammensetning av karbon ( mellom 2 - 5 wt% ok ) ( 1p ) - bruker tetthet for grafitt ( 1p ) bruker tetthet for jern ( 1p ) - kommer frem til et fornuftig svar ( 1p ) Maks 6p totalt, 14 Norsk: Forklar forskjellen mellom LDPE og HDPE med hensyn på struktur og egenskaper English: Explain the difference between LDPE and HDPE with respect to structure and properties. Skriv ditt svar her / write your answer here Format BIU X₂ x² IxD F ← λ = = Ω Σ ☑ Hjelp Words: 0 Maks poeng: 5 Sjekk svar Kortsvar som gir full uttelling: LDPE har flere sideforgreninger enn HDPE, som fører til at LDPE har lavere tetthet på grunn av lavere grad av krystallinitet, som også gir lavere stivhet ( og styrke ) . Tilsynelatende smeltetemperatur er også lavere for LDPE. LDPE har fordelen at det kan lages tynne filmer ( sideforgreninger bidrar til dette ) . Sensurveiledning: Maks 5p totalt, skjønnsmessig vurdert. 15 Norsk: Et kopolymer - molekyl av PP og PE består av 85 wt% PP og 15 wt% PE. Totalt antall repeterende enheter 100 000. Hvor mange repeterende enheter av PE har dette molekylet? Velg det mest nøyaktige alternativet. English: A copolymer molecule of PP and PE contains 85 wt% PP and 15 wt% PE. The total number of repeat units is 100 000. How many repeat units of PE does the molecule contain? Select the most accurate alternative. Velg ett alternativ / Select one alternative ○ 17000 15000 19000 ○ 9000 O 13000 ○ 23000 ○ 21000 ○ 11000 Løser ligningen n.28n.28 + ( 100000 - n ) .42 = 0.15 med hensyn på n der masse til repeterende enheter av PE og PP er henholdsvis 28 og 42 g / mol. n = ( 0.15 * 42 * 1E5 ) / ( 28 - 0.15 * 28 + 0.15 * 42 ) print ( 1000 * round ( n / 1000 ) ) 21000 Maks poeng: 4 Sjekk svar In [14]: 16 Norsk: Polymeren i forrige oppgave er en såkalt tilfeldig kopolymer. Beskriv ( illustrasjoner forventes ) tre andre konfigurasjoner av kopolymerer. English: The polymer in the previous problem is a random copolymer. Describe ( include illustrations ) three other configurations of copolymers. Skriv ditt svar her Format BIU imes imes² Ix la ว ค Tegn og forklar: alternerende, blokk og podet. Sensurveiledning: Maks 6 totalt, skjønnsmessig vurdert men essensielt 2p pr. stk Hjelp 1 = • = Σ ☑ 2 = Words: 0 Maks poeng: 6 Sjekk svar 17 Norsk: Et utmattingsforsøk er utført med R = 0.1 og midlere spenning lik 110 MPa. Hva er amplituden? Velg svaret som er mest nøyaktig. English: A fatigue test is conducted using R = 0.1 and mean stress equal to 110 MPa. What is the amplitude? Select the most accurate answer. Velg ett alternativ: ○ 110 ○ 55 ○ 200 ○ 135 ○ 40 ○ 90 ○ 180 O 100 Fra formelsamling: R = σminomax og dermed Omin = Romax Midlere spenning: Løser for maks spenning: Om = 12 ( Omax + 0min ) = 12 ( Omax + Romax ) = 120max ( 1 + R ) Omax 20m1 + R = 2201.1 = 200 Amplituden er derfor Oa - Omax - Om - 200 - 110 = 90 Maks poeng: 3 Sjekk svar smean = 110 R = 0.1 smax = ( 2 * smean ) / ( 1 + R ) smin = smax * R sa = smax - smean print ( round ( sa ) ) 90 In [15]: 18 Norsk: Beskriv og forklar konseptet S - N kurve English: Describe and explain the concept S - N curve Skriv ditt svar her / Write your answer here Format BIU X₂ x² Ix LE ← จ C 用 Σ ☑ Hjelp Words: 0 Maks poeng: 4 Sjekk svar S - N kurver Stress amplitude, S Fatigue strength at N₁ cycles 103 104 107 N₁ 108 109 1010 Fatigue life at stress S1 Cycles to failure, N ( logarithmic scale ) Sensurveiledning: Maks 4 totalt, skjønnsmessig vurdert basert på at svaret viser / forklarer antall sykler ( levetid ) på ene aksen og last ( f.eks. spenning ) = 'styrke' på den andre aksen. 19 Norsk: Du skal gjennomføre en utmattingstest av en polymer som du vet oppfører seg tydelig viskoelastisk ved romtemperatur. Forklar hvorfor det kan være nødvendig å begrense utmattingsfrekvensen ( altså bruke relativt lav frekvens ) i dette tilfellet. English: You are supposed to conduct a fatigue test of a polymer material known to show a pronounced viscoelastic behavior at room temperature. Explain why you may limit the frequency ( that is; use relatively low frequency ) in this case. Skriv ditt svar her / Write your answer here Format ▾ B im + = = = 用 Σ ☑ Hjelp Words: 0 Maks poeng: 4 Sjekk svar Svar: Viskoelastisk betyr at spenning og tøyning ikke er i fase ( som er grunnen til f.eks. høy mekanisk demping ) som igjen betyr mekanisk energi absorberes i materialet og vi må altså tilføre energi for å holde den sykliske belastningen gående. Denne energien som absorberes, blir selvsagt til ( trommevirvel ) .... varme, og som kjent, egenskaper til polymerer endres ofte dramatisk med relativt liten endring i temperatur. Altså, dersom poenget er å utføre utmatting ved en gitt temperatur, må vi sørge for at varmen kan evakueres ( som jo tar tid ) , og dermed må vi begrense utmattingsfrekvensen. Sensurveiledning: Maks 4 totalt, skjønnsmessig vurdert basert på at svaret viser / forklarer at viskoelastisk oppførsel medfører absorbert energi og utvikling av varme. Andre forklaringer kan være relevante, men må i så fall være konsistent argumentert. 20 Norsk: Velg korrekt påstand English: Select the correct claim Velg ett alternativ / Select one alternative Norsk: Enheten til Gic er J / m³ English: The unit of Gic is J / m³ Norsk: Høy hardhet er vanligvis forbundet med høy flytestyrke English: High hardness is usually associated with high yield strength Norsk: Enheten til bruddseighet er MPa m² English: The unit of fracture toughness is MPa m² Norsk: Duktilitet måles som energi English: Ductility is measured as energy Norsk: Seighet er er et mål på materialers evne til å absorbere energi per masse ved plastisk deformasjon English: Toughness is a measure of materials ability to absorb energy per mass during plastic deformation Norsk: Logaritmisk ( sann ) tøyning er større eller lik ingeniørtøyning English: Logarithmic ( true ) strain is greater or equal to engineering strain Riktig. 3 av 3 poeng. Prøv igjen Korrekt påstand: \"Høy hardhet er vanligvis fobundet med høy flytestyrk\", fordi flytestyrke og hardhet er grunnleggende mål på samme egenskap / mekanisme, nemlig motstand mot plastisk deformasjon. Hvorfor feil svar er feil: Enheten til GIC er energi per areal, ikke energi per volum Enheten til bruddseighet er MPa - roten av meter Duktilitet måles som en eller annen form for relativ forlengelse før brudd, men i hvert fall ikke som energi Seighet er et mål på materialers evne til å absorbere energi per volum ( arealet under en spennin - tøyningskurve ) , og altså ikke per masse Sann tøyning er mindre enn ingeniørtøyning, formel er gitt og kan verifiseres med numerisk test. Uttelling rac{11}{21} = 52% 21 24 Norsk: Velg korrekt påstand relatert til Jern - karbon systemet når du antar likevektsbetingelser English: Select the correct claim related to the Iron - carbon system when you assume equilibrium conditions Velg ett alternativ / select one alternative O Norsk: Den eutektiske temperaturen er 1147°C som betyr at smeltetemperaturen til jern er 1147°C. English: The eutectic temperature is 1147°C, implying that the melt temperature of iron is 1147°C. Norsk: Ved romtemperatur og ved likevekt eksisterer karbonstål med rundt 1 wt% karbon som feritt ( a - jern ) + Fe3C English: At room temperature and equilibrium, carbon having 1 wt% carbon will exist as ferrite ( a - irony Fe3C Norsk: Omvandling fra austenitt til feritt kan ikke skje ved en temperatur som er over den eutektoide temperaturen English: Transformation from austenite to ferrite cannot occur at a temperature greater than the eutectoid temperature. Norsk: For enkelt stål er det mer Fe3C enn feritt ved romtemperatur English: For some steels there are more Fe3C than ferrite at room temperature Norsk: Ved den eutektoide sammensetningen blir det dannet bainitt ved likevektsreaksjon. English: At the eutectoid composition, bainite is formed during equilibrium reaction. Norsk: Løsligheten til karbon i austenitt er mye lavere enn løsligheten til karbon i feritt English: The solubility of carbon in austenite is much lower than the solubility of carbon in ferrite Riktig. 3 av 3 poeng. Prøv igjen Korrekt påstand: \"Ved romtemperatur og ved likevekt eksisterer karbonstål med rundt 1 wt% karbon som feritt + Fe3C\", som er absolutt tilfelle når vi også har informasjon om at påstanden er relatert til Jern - karbon systemet, antatt likevektsbetingelser ( som langsom avkjøling ) . Hvorfor feil svar er feil: Den eutektiske temperaturen og smeltetemperaturen er ikke relatert, og dessuten er smeltetemperaturen for jern gitt for jern med ubetydelig mengde karbon, mens den eutektiske sammensetningen har jo en stor mengde karbon Omvandling fra austenitt til feritt kan skje ved temperturer over eutektoid temperatur for alle relevante sammensetninger som avviker fra den utektoide sammensetningen, så påstanden er feil. Det vil alltid være mer ( både masse og volum ) feritt enn Fe3C ved romtemperatur ( så lenge det er snakk om stål og ikke hvitt støpejern ) Bainitt er ikke en likevektsreaksjon men et produkt av hurtig nedkjøling Løsligheten til karbon er mye større i austenitt ( litt over 2 wt% ) enn i feritt ( rundt 0.02 wt% ) 22 Norsk: Velg korrekt påstand English: Select the correct claim Velg ett alternativ: Norsk: Klor i PVC er grunnen til den ekstremt høye smeltetemperaturen ( 620°C ) for materialet. English: Chloride in PVC is responsible for the extremely high melt temperature ( 620°C ) for the material. Norsk: PTFE brenner dårlig fordi den inneholder nitrogen. English: PTFE burns poorly since it contains nitrogen. Norsk: Duktilitet er ikke et konsept som brukes i omtale av polymerer English: Ductility is not a concept used to describe polymers Norsk: Polyestere finnes både som herdeplast og termoplast English: Polyesters can be found as both thermoset and thermoplastic Norsk: På grunn av den store sidegruppen i polystyren, vil glasstransisjonstemperaturen være mye lavere for denne polymeren sammenlignent med polyetylen. English: Due to the large side - group in polystyrene, the polymer will have a much lower glass transition temperature compared to polyethylene. Norsk: En polymer som er kryssbundet er en termoplast English: A cross - linked polymer is a thermoplastic Riktig. 3 av 3 poeng. Prøv igjen Korrekt påstand: Polyester kan være f.eks. PET, som jo er en termoplast. Dessuten har vi jo brukt umettet polyester som eksemple på en herdeplast ( typisk brukt i kompositter og som eksempel på kryssbinding ved å bruke fri radikal og dobbeltbindinger i den umetted polyesteren ) Hvorfor feil svar er feil: Smeltetemperatur på 620 C er jo latterlig og urealistisk høyt for en termoplast, så påstanden er uansett uten konsistens PFTE inneholder kun karbon og fluor, să nitrogen har ikke noe relevans Duktilitet er ofte brukt for å beskrive polymerer, og noen ( f.eks. PE, PP, .. ) er svært duktile Den store sidegruppen i polystyren gir relativ høy Tg, ikke lav Tg. En kryssbundet polymer er ved definisjon en herdeplast, ikke en termoplast. 23 Norsk: Velg korrekt påstand English: Select the correct claim Velg ett alternativ: O Norsk: Antall dislokasjoner øker ved plastisk deformasjon English: The number of dislocations increases during plastic deformation Norsk: Dislokasjonsbevegelse er tilfeldige hopp av atomplan English: Dislocation movement is random jumps of atom planes. Norsk: Dersom metaller får mange korngrenser, vil materialets flytestryke bli svekket English: The yield strength of metals will be weakened if many grain boundaries are formed. Norsk: Faststoffløsning fungerer som styrkemekanisme for metaller ved at det dannes nye kjemiske forbindelser med kovalente bindinger English: Solid solution works as a strengthening mechanism of metals by forming new chemical compounds having covalent bonds. Norsk: De tre typer av disklokasjoner i metall er: kant - dislokasjon, skyve - dislokasjon og rom - dislokasjon English: The three types of dislocations are: edge dislocation, skewed dislocation and space dislocation Norsk: Faststoffløsning av to metaller er kun mulig dersom det er tilstrekkelig stor forskjell i elektronegativitet. English: Solid solution of two metals is possible only if the difference in electronegativity is sufficiently large. Riktig. 3 av 3 poeng. Prøv igjen Korrekt påstand: \"Antall dislokasjoner øker ved plastisk deformasjon\" er en generell beskrivelse av hva som skjer ved plastisk deformasjon, så absolutt korrekt. Hvorfor feil svar er feil: Atomplan som hopper tilfeldig er ikke et konsept som kan beskrives på enn fornuftig måte, så de må være feil. Materialers flytestyrke blir generelt høyere ved mange korngrenser ( kornforfining er jo en styrkemekanisme ) Faststoffløsning er jo en løsning ( eksempel at karbon er løst i jern som interstitielle atom ) mens en kjemisk forbindelse ( som f.eks. Fe3C ) blir noe annet. De to typer dislokasjoner er kant og skru - dislokasjon Faststoffløsning er generelt mulig dersom det ikke er stor forskjell i elektronegativitet. 24 Norsk: Velg korrekt påstand English: Select the correct claim Velg ett alternativ: O Norsk: Kvarts er en krystallinsk form av silisiumdioksid ( SiO2 ) English: Quarts is a crystalline form of silica dioxide ( SiO2 ) Norsk: Boronkarbid har høyere hardhet enn diamant English: Boron carbide has greater hardness than diamond. Norsk: Keramer har ofte lav styrke på grunn av relativt svake bindinger mellom atomer English: Ceramics have often low strength due to the relative week bonds between atoms Norsk: Keramer har vanligvis høyere termisk utvidelseskoeffisient enn metaller. English: Ceramics have usually greater coefficient of thermal expansion than Norsk: En utfordring med keramer er oksidasjon ved høye temperaturer English: One challenge with ceramic materials is oxidation at elevated temperatures. Norsk: Keramer har typisk langt lavere bruddseighet enn polymerer English: The fracture toughness of ceramics is typically much less than the fracture toughness of polymers Riktig. 3 av 3 poeng. Prøv igjen Korrekt påstand: Selv om det kan være ulike strukturer for kvarts, er det uansett en krystallinsk form av silika ( SiO2 ) Hvorfor feil svar er feil: Diamant har høyst hardhet, uten tvil Keramer har ofte ( vanligvis ) sterke bindinger mellom atomer, mens eventuell lav styrke skyldes sprekker og lav bruddseighet ( sprøhet ) Metaller har vanligvisk høyerer termisk utvidelse enn keramer Keramer er jo gjerne allerede et oksid, så videre oksidasjon er ikke noe som skjer Bruddseigheten til keramer og polymerer er nokså like, så det er ikke rimelig å påstå 'langt lavere bruddseighet' 25 Norsk: Dersom 62 g tinn og 38 g bly blandes, vil denne blandingen smelte ved en temperatur ( ca. 180°C ) som er vesentlig lavere enn både bly ( ca. 330°C ) og tinn ( ca. 230°C ) . En god del tinn ( ca. 18 wt% ) kan være løst i bly, mens kun 2 wt% bly vil kunne være løst i tinn. a ) Lag en skisse av fasediagrammet for bly - tinn, der du navngir og beskriver de ulike delene ( områder, linjer og andre relevante element ) av fasediagrammet. b ) Forklar hva som skjer med en smelte bestående av 30 g tinn og 70 g bly som kjøles langsomt til romtemperatur. English: If 62 g tin and 38 g lead is mixed, this mixture will melt at a temperature ( about 180°C ) that is significantly lower than the melt temperature of both lead ( about 330°C ) and tin ( about 230°C ) . Quite a lot of tin ( about 18 wt% ) can be solved in lead while only 2 wt% lead can be solved in tin. a ) Sketch the phase diagram of the lead - tin system. Label and describe the different parts ( regions, lines and other relevant items ) of the phase diagram. b ) Explain what happens to a melt having 30 g tin and 70 g lead that is being cooled slowly down to room temperature. Skriv ditt svar her / write you answer here Format BIUX x² Ix จ ว 1 = 用 Hjelp Σ ☑ Eksempel på svar med 100% uttelling ( kun litt smårusk, som \"Ti\" for Tinn,.. ) : Words: 0 Maks poeng: 8 Sjekk svar a ) Vektproent tin ved eutektisk punkt ble funnet ved å ta massen av tinn delt på summen av massen tin og bly. Det tilsvarte rac{62}{100} = 0.62 som tilsvarer 62 vektprosent tinn. Linjene som er navngitt er satt på linjene i venstre side av diagrammet men er tilsvarende for høyre side. Det ble brukt alpha / betha istedenfor den tilsvarende greske bokstaven. L står for liquid / væske. Alpha er da Bly som faststoff og Betha er Tinn som faststoff. °C 330 Solidus Liquidus ✓ L Alpha + L Alpha 18 Solvus 0 10 20 30 00 Pb ос 230 Betha + L 180 grader C 62 98 40 Alpha + Betha 50 wt% Ti 60 60 70 80 100 80 90 Ti Betha °C 1 330 Alpha + L 2 Alpha ос L - 230 Betha + L Alpha 18 180 grader C 62 98 a Alpha + Betha Betha Proeuctolid alpha 0 10 20 100 30 40 50 60 70 80 90 Ti Pb wt% Ti Smelte bestående av 30 vektprosent tinn vil starte i væskefasen og mikrostrukturen vil kun bestå av væske ( Se punkt 1 ) . Etter temperaturen har blitt lavere og den krysser liquiduslinjen vil det starte å dannes krystaller av alpha, altså det blir deler av bly som faststoff ( punkt 2 ) . Ved punkt 3 er den fortsatt i den samme fasen men krystallene har blitt enda større siden det er en større andel faststoff enn ved punkt 2. Når den krysser den euktektiske temperaturen vil det bli dannet lamell, altså lag med alpha og betha. Krystallene som ble til før den euktektise temperaturen blir værende og kalles proeuctolid alpha."
]