[
  "i Institutt for havromsoperasjoner og byggteknikk / Institutt for konstruksjonsteknikk / Institutt for vareproduksjon og byggteknikk Eksamensoppgave i MEKA1101 / MEKT1101 / MEKG1101 / TKT4118 / VB6046 Eksamensdato: 5. desember 2024 Eksamenstid ( fra - til ) : 15:00 - 19:00 Faglig kontakt: Torodd Skjerve Nord ( Ålesund ) / Victorien Prot ( Trondheim ) / Per Harald Ninive ( Gjøvik ) Tlf.: 97 77 94 rac{31}{98} 49 77 rac{31}{99} 58 76 72 Møter i eksamenslokalet: NEI Hjelpemiddelkode / Tillatte hjelpemidler: D / Ingen trykte eller håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye og gjør dine egne antagelser. Presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. FAGSPESIFIKK INFORMASJON Håndtegninger: I en del oppgaver skal håndberegninger leveres på ark, disse oppgavene er merket tydelig. Manglende håndberegninger på disse oppgavene vil gi redusert uttelling selv om svaret ført inn i Inspera er rett. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke <<Vis besvarelse>>. Du er selv ansvarlig for å fylle inn riktige koder på eventuelle håndtegningsark. Les derfor informasjonen på omslagsarket nøye. Eksamenskontoret kan ikke garantere at feilaktig utfylte ark blir lagt til besvarelsen din. Vekting av oppgavene: Maksimal uttelling er angitt for hver oppgave, oppgavesettet summerer til 100 poeng. oppgave 1: 16 poeng oppgave 2: 10 poeng oppgave 3: 25 poeng oppgave 4: 23 poeng oppgave 5: 16 poeng oppgave 6: 10 poeng Formelark: Formelarket finner du bakerst i oppgavesettet. Varslinger: Eventuelle beskjeder under eksamen ( f.eks. ved feil i oppgavesettet ) , sendes ut via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Dersom du ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din under tidligere prøver i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige under «tidligere prøver». 1 ( a ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. A B 3m ヨ 4m a ) Vis at fagverket er statisk bestemt. Skriv ditt svar her Format ΣΧ D 4m ୬ 30 kN C Words: 0 Maks poeng: 3 1 ( b ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A E 4m B D 4m 30 KN C b ) Bestem opplagerkreftene i A og E. Angi svaret i et heltall antall kN. La positiv x - akse peke mot høyre og positiv z - akse peke oppover på figuren. Angi svaret med negativt fortegn dersom du mener opplagerkreftene i x - retning peker mot venstre, eller hvis du mener opplagerkreftene i z - retning peker nedover. Ax || ( - 80 ) Az = ( 30 ) Ex = ( 80 ) Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 3 1 ( c ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. A B 3m E 4m c ) Hvilken eller hvilke staver er nullstaver? Velg ett alternativ: Stav AE og BD Stav DE Det er ingen nullstaver Stav AD og BD Stav AE Stav BD D 4m 30 kN C Merk at håndberegningene eller begrunnelsene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 1 ( d ) Figuren viser et fagverk ABCDE. Fagverket er festet til en vegg via et fastlager i punkt A og et glidelager i punkt E. En punktlast på 30 kN virker i punkt C som angitt på figuren. 3m A E 4m B D 4m 30 kN C d ) Finn største strekkraft og største trykkraft i fagverket ved å bruke knutepunktsmetoden. Angi svaret i ( positivt ) heltall antall kN. Merk at vi kun er ute etter tallverdier. Maks. strekkraft = ( 50 ) kN Maks. trykkraft = ( 80 ) kN Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 6 2 ( a ) [mm] 200 87.5 150 25 50 50 N C - 25 25 y 75 Et sammensatt tverrsnitt har geometri som vist i figuren. z - aksen er en symmetriakse for tverrsnitts geometrien. a ) Regn ut beliggenheten til arealsenter C ( yc og zc ) . ( 0 ) mm, Yc = ZC = ( 130 ) mm. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 2 ( b ) Et sammensatt tverrsnitt har geometri som vist i figuren. z - aksen er en symmetriakse for tverrsnitts geometrien. 200 mm Z ▲ 25 mm 25 mm C y 150 mm 50 mm 75 mm b ) Beregn tverrsnittets annet areal moment Iy. Bruk Steiners teorem Rund av svaret ditt til nærmeste heltall. Iy = = ( 83 - 84 ) 106 mm². Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 6 3 ( a ) L A B N L X C TL / 2 L / 2 / P = qL D L L - Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Argumenter for om denne ramma er statisk underbestemt, statisk bestemt eller statisk ubestemt. Skriv ditt svar her Format ΣΧ ว Words: 0 Maks poeng: 5 3 ( b ) A L L. B C x L — L / 2 L / 2 - P = qL L - D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Bestem reaksjonskreftene i A, C og D. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ Ax = 0 Ax = - qL / 8 Ax = qL / 4 = Ax = qL / 2 Velg ett alternativ Az = 0 Az = qL / 4 A₂ = qL / 8 Az = qL / 2 Velg ett alternativ Cz = 3qL / 2 Cz = qL / 4 Cz = qL Cz = qL / 10 Velg ett alternativ Cx = 0 Cx = qL / 8 Cx = qL / 3 Cx = qL / 5 Velg ett alternativ Dz = 2qL Dz = qL / 2 Dz = qL / 4 Dz = 2qL / 3 Maks poeng: 3 ( c ) A B L L. C X TL / 2 L / 2 / P = qL D L L - Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Nedenfor finner du seks alternativer for normalkraftdiagrammet til rammen ( A, B,...., F ) . I diagrammene angir virkningssymbolet strekk eller trykk. Bestem hvilket diagram som viser rett fordeling av normalkreftene i rammen. Merk at vi her bare er ute etter fordelingen av trykk og strekkrefter i rammen så størrelsen på boksene er ikke nødvendigvis i skala i forhold til størrelsen på normalkreftene i hver del av rammen. Du skal vise hvordan du kommer frem til riktig diagram ved hjelp av håndberegning. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: A B C D E F A ←口→ B + C D ☐ + E F Maks poeng: 5 3 ( d ) A L L. B C x L — L / 2 L / 2 - P = qL L - D Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Nedenfor finner du seks alternativer for skjærkraftdiagrammet til ramma ( A, B,...., F ) . Skjærkraftdiagrammet er tegnet med virkningssymbol som angir retningen til skjærkreftene. Bestem hvilket diagram som viser rett fordeling av skjærkrefter i rammen. Merk at vi her bare er ute etter formen, samt retning på virkningssymbol på skjærkraftdiagrammet. Du skal vise hvordan du kommer frem til riktig diagram ved hjelp av håndberegning. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: A B C D ОЕ F A C E ↑↓ 口 ↑↓ 年 B ↑↓ ↓↑ 0 D NN 中 B F LL 十六福 ↑↓ 40分 B 十 口 Maks poeng: 5 3 ( e ) L A B N L C X TL / 2 L / 2 / P = qL D L L - Figuren over viser en ramme ABC med stivt hjørne i B, hvor en Bjelke BD er festet til ramma gjennom et ledd i B. Det er benyttet forskyvelig leddlager ( glidelager ) i A og D, og et uforskyvelig lager i C. Ytre laster og geometri fremgår av figuren. Nedenfor finner du seks alternativer for momentdiagrammet ( A, B,...., F ) . Momentdiagrammene er tegnet på strekksiden. Bestem hvilket diagram som viser rett fordeling av moment i rammen. Merk at vi her bare er ute etter formen på momentdiagrammet. Du skal vise hvordan du kommer frem til riktig diagram ved hjelp av håndberegning. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: A B C D E F A B C B D E F T Maks poeng: 5 4 Figuren viser en T - formet mast som er satt sammen av trebjelker med massive, kvadratiske tverrsnitt. Tverrsnittdimensjonene fremgår av figuren. Masten er fast innspent i punkt C. To like store punktlaster F angriper som anvist i punkt A og D. Bruddspenningen i trematerialet er fy = 30 MPa. 5a 2a A B F Tverrsnitt, del BC: 2a D F C Z L X 75 mm 75 mm Tverrsnitt, del ABD: 50 mm 50 mm 4 ( a ) a ) Bestem den riktige formen på M - diagrammet. 1: 3: 5: ம் 2: IT T 4: 6: T Velg ett alternativ: Alternativ 2 Alternativ 6 Alternativ 3 Alternativ 5 Alternativ 4 Alternativ 1 Merk at håndberegningene eller begrunnelsene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 5 4 ( b ) b ) Bestem bøyemomentene i punkt B og C uttrykt ved F og a. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Bøyemoment MB i punkt B er lik: Velg ett alternativ: ○ 7Fa 0 4Fa 2Fa 5Fa Fa Bøyemoment Mc i punkt C er lik: Velg ett alternativ Fa 9Fa 2Fa 0 5Fa 7Fa Maks poeng: 5 4 ( c ) c ) Anta F = 250 N og a = 1,0 m. Hvor i konstruksjonen oppstår største bøyespenning? Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Velg ett alternativ: Like til venstre for punkt B ( i del AB ) Punkt D Punkt A O Rett i underkant av punkt B ( i del BC ) Punkt C Like til høyre for punkt B ( i del BD ) 4 ( d ) d ) Beregn største bøyespenning i konstruksjonen dersom F = 250N og a = 1,0m. Angi svaret med 1 desimals nøyaktighet. ом max = ( 24.8 25.0 ) MPa. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 5 Maks poeng: 5 4 ( e ) e ) Hva blir største verdi som punktlastene F kan ha uten at bruddspenningen ( fy = 30 MPa ) overskrides? Anta fortsatt at a = 1,0 m. Avrund svaret til nærmeste heltall antall newton ( N ) . Fmax = ( 297 302 ) N. Merk at håndberegningene du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 3 LO 5 En ramme ABC er påkjent av en kraft PiC som vist på figuren. Rammeelementene ( AB og BC ) har lengde L og bøyestivhet EI. Momentdiagrammet er oppgitt. L A ΕΙ M - diagram B A FL ΕΙ L F C FL B C 5 ( a ) a ) Velg riktig skisse av deformasjonsmønsteret ( elastiske linjen ) . 1 4 F F Velg ett alternativ: Alternativ 5 Alternativ 4 Alternativ 6 Alternativ 1 Alternativ 3 Alternativ 2 2 F LO FTTTTT 3 F 00 6 F F Maks poeng: 4 5 ( b ) b ) Hva blir vertikalforskyvningen av punkt B? Bruk elementærbjelkemetoden. FL³ FL³ FL³ FL³ FL³ FL³ WB = 0 WB = WB = WB = WB = WB WB = ЗЕІ 2EI 8EI 384EI 16EI 48EI 1 2 3 4 5 6 7 Velg ett alternativ: Alternativ 7 Alternativ 4 Alternativ 6 Alternativ 1 Alternativ 3 Alternativ 2 Alternativ 5 Merk at håndberegningene og argumentasjonen du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 5 5 ( c ) c ) Hva er rotasjonsvinkelen i punkt B? FL² FL² = 0 B B Фв = = Фв = ФВ B ΕΙ 2EI 1 2 3 Velg ett alternativ: Alternativ 1 Alternativ 6 Alternativ 2 Alternativ 5 Alternativ 3 Alternativ 4 FL² = 6EI Фв B 4 = FL² 16EI 5 Фв B = 6 FL² ЗЕІ Merk at håndberegningene og argumentasjonen du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 4 5 ( d ) d ) Beregn horisontalforskyvningen av punkt C. Skriv ditt svar her Format ΣΧ Words: 0 Merk at håndberegningene og argumentasjonen du gjør for å løse denne oppgaven må leveres inn. Maks poeng: 3 6 ( a ) N xd = 2,5 m x A P bak = 2 kN Ж P_{front} = 1 kN Z Ly b = 3 m L = 4 m h = 0,03 m a L P Wmidt b B PL³ 3 a Wmidt 48EI ( ₁ ( 4 ) ² - ³ ( \\div ) ) . 3 a VI 22 L PL³ b 3 Wmidt 48EI ( * ( ) * - ³ ( + ) ) . L a> 2 Oppgaven besvares direkte i Inspera Trondheim kommune har sendt ut et varsel om kommende gravearbeid utenfor boligen din. I innkjørselen din kommer det til å være en lang og dypt grop som er 4 meter bred. For at du og andre skal kunne benytte innkjørselen så legges det ned en stålplate, som er 4 m lang, 3 m bred og 3 cm tykk, over gropa. Du ser på den tynne stålplata og er nysgjerrig på hvor mye nedbøyning som kommer til å oppstå når du skal kjøre over den. Du har ikke lært plateteori som undervises i TKT4134 Mekanikk 4, men du bestemmer deg for å forenkle problemet og benytter bjelketeori istedenfor. Da du fikk varselingen fra kommunen lagde du en skisse av problemet og en detaljert kode som beregner og plotter nedbøyningen på midten av plata som funksjon av posisjonen til forhjulene. Platens E - modul er 210 GPa og bøyes om svak akse. Du viser nå koden til en venn, en stund etter du skrev koden. Samtidig som du viser koden til vennen din oppdager du noen feil i koden. a ) Koden inneholder 3 feil. Bruk svarboksen nedenfor til å føre opp linjenummerne du mener det er feil på, hva som er galt og forslå korrigert kode for disse linjene. Feilene er ikke syntaksfeil. 1 ## Importer nødvendige biblioteker 2 import numpy as np M 4 ## Definerer konstanter L = 4 # Lengde av stålplate [m] 5 6 b 7 h = = = 8 E 9 I = 10 3000 # Bredde av stålplate [mm] 30 # Høyde av stålplate [mm] 210000 # E - modul stål [N / mm * * 2] h * b * * rac{3}{12} # 2. Areal moment [mm * * 4] 11 P_{front} 10000 # Last frontaksling [N] 12 P_{bak} 13 d 14 = = 20000 # Last bakaksling [N] 2500 # Avstand mellom akslingene [mm] 15 wc1 = P_{front} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{front} P_{bak} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{bak} 16 wc2 = 17 18 ## Diskretisering 19 pos for = np.linspace ( 0, L + d, 1000 ) # forakslingens posisjon 20 pos_{bak} 21 w midt 22 23 # ??? = = pos_{for} d # bakakslingens posisjon np. zeros_{like} ( pos_{for} ) # tomt array for nedbøyning 24 for i in range ( len ( pos_{for} ) ) : 25 26 27 28 29 30 31 m m 32 33 34 35 if pos_{for}[i] < = L / 2: w_{midt}[i] = wc1 * ( 4 * ( pos_{for}[i] / L ) * * 33 * pos_{for}[i] / L ) elif pos_{for}[i] > L / 2 and pos_{for}[i] < = d: w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) elif pos_{for}[i] < = L: w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) + wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) elif pos_{for}[i] > L and pos_{bak}[i] < = L / 2: w_{midt}[i] = wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) else: w_{midt} [i] = wc2 * ( 4 * ( ( L - pos_{bak}[i] ) / L ) * * 33 * ( L - pos_{bak}[i] ) / L ) 36 # Finner størst nedbøyning og tilhørende posisjon 37 maks_{nedbøyning_pos} = pos_{for}[np.argmin ( w_{midt} ) ] # Forhjulets posisjon ved størst nedbøyning = = 38 maks_{nedbøyning} = np.min ( w_{midt} ) # Størst nedbøyning 39 40 ## Plotter og printer resultatet 41 plt.figure ( figsize = ( 12, 4 ) , dpi - 200 ) 42 plt.title ( \"Nedbøyning ( midt ) som funksjon av forhjulenes posisjon\", fontsize = 15 ) 43 plt.plot ( pos_{for}, w_{midt} ) 44 plt.plot ( maks_{nedbøyning_pos}, maks_{nedbøyning}, marker = \"o\", color = \"red\" ) 45 plt.xlabel ( \"Forhjulenes posisjon [mm]\", fontsize = 12 ) 46 plt.ylabel ( r\"$w_{midt}$ [mm]\", fontsize = 12 ) 47 plt.grid ( ) 48 plt.show ( ) 49 print ( \"Maks nedbøyning er {:.1f} mm når forhjulene er {:.2f} m på veg over stålplata\" .format ( - maks_{nedbøyning}, maks_{nedbøyning_pos} / 1000 ) 50 51 52 ) Figuren nedenfor viser plottet som koden lager når den er feilfri. Nedbøyning ( midt ) som funksjon av forhjulenes posisjon 0.0 - 2.5 - 5.0 - 7.5 - 10.0 - 12.5 - 15.0 - 17.5 Wmidt [mm] 1000 2000 3000 Forhjulenes posisjon [mm] 4000 5000 6000 Skriv ditt svar her, dvs. feilene i Python - koden, inkl. hvilken linje hver feil befinner seg, og angi korrigert kode. Maks poeng: 5 6 ( b ) N d = 2,5 m x Z h = 0,03 m b = 3 m P Wmidt b a L A B Wmidt P bak = 2 kN P_{front} = 1 kN PL³ 48EI 3 a ( * ( 2 ) ² - ³ ( \\div ) ) . 3 L = 4 m Ж PL³ b 3 Wmidt 48EI ( 4 ( + ) ³ - ³ ( + ) ) . ་ a VI L 22 a >> L 22 Oppgaven besvares direkte i Inspera Trondheim kommune har sendt ut et varsel om kommende gravearbeid utenfor boligen din. I innkjørselen din kommer det til å være en lang og dypt grop som er 4 meter bred. For at du og andre skal kunne benytte innkjørselen så legges det ned en stålplate, som er 4 m lang, 3 m bred og 3 cm tykk, over gropa. Du ser på den tynne stålplata og er nysgjerrig på hvor mye nedbøyning som kommer til å oppstå når du skal kjøre over den. Du har ikke lært plateteori som undervises i TKT4134 Mekanikk 4, men du bestemmer deg for å forenkle problemet og benytter bjelketeori istendenfor. Da du fikk varselingen fra kommunen lagde du en skisse av problemet og en detaljert kode som beregner og plotter nedbøyningen på midten av plata som funksjon av posisjonen til forhjulene. Platens E - modul er 210 GPa og bøyes om svak akse. Du viser nå koden til en venn, en stund etter du skrev koden. Vennen din ser over den detaljerte koden og stopper på linje 23 hvor det står #???. Der er det ingen forklaring på hva som skjer med for - løkken og vennen din spør deg \"hva gjør koden her\"? b ) Forklar logikken og koden i for - løkken. Benytt svarboksene nedenfor. 1 ## Importer nødvendige biblioteker 2 import numpy as np 3 4 ## Definerer konstanter 5 L = 6 b = 7 h = 8 E 9 I 10 = = 4 # Lengde av stålplate [m] 3000 # Bredde av stålplate [mm] 30 # Høyde av stålplate [mm] 210000 # E - modul stål [N / mm * * 2] h * b * * rac{3}{12} # 2. Areal moment [mm * * 4] 11 P front = 10000 # Last frontaksling [N] 12 P bak 20000 # Last bakaksling [N] 13 d = 14 = 2500 # Avstand mellom akslingene [mm] 15 wc1 = P_{front} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{front} 16 wc2 = P_{bak} * L * * 3 / ( 48 * E * I ) # Nedbøyningskoeffisient for P_{bak} 17 18 ## Diskretisering 19 pos_{for} = np.linspace ( 0, L + d, 1000 ) # forakslingens posisjon 20 pos_{bak} = pos_{for} d # bakakslingens posisjon 21 w_{midt} = np. zeros_{like} ( pos_{for} ) # tomt array for nedbøyning 22 23 # ??? 24 for i in range ( len ( pos_{for} ) ) : if pos_{for}[i] < = L / 2: w_{midt}[i] = wc1 * ( 4 * ( pos_{for}[i] / L ) * * 3 - 3 * pos_{for}[i] / L ) elif pos_{for}[i] > L / 2 and pos_{for}[i] < = d: w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 33 * ( L - pos_{for}[i] ) / L ) elif pos_{for}[i] < = L: 25 26 27 28 29 30 31 32 w_{midt} [i] = wc2 * ( 4 * ( pos_{bak}[i] / L ) * * 3 - 3 * pos_{bak}[i] / L ) 33 else: 34 w_{midt} [i] = wc2 * ( 4 * ( ( L - pos_{bak}[i] ) / L ) * * 33 * ( L - pos_{bak}[i] ) / L ) w_{midt}[i] = wc1 * ( 4 * ( ( L - pos_{for}[i] ) / L ) * * 3 - 3 * ( L - pos_{for}[i] ) / L ) + wc2 * ( 4 * ( pos_{bak}[i] / L ) * 33 * pos_{bak}[i] / L ) elif pos_{for}[i] > L and pos_{bak}[i] < = L / 2: 35 36 # Finner størst nedbøyning og tilhørende posisjon 37 maks_{nedbøyning_pos} = pos_{for}[np.argmin ( w_{midt} ) ] # Forhjulets posisjon ved størst nedbøyning 38 maks_{nedbøyning} = np.min ( w_{midt} ) # Størst nedbøyning 39 40 ## Plotter og printer resultatet 41 plt.figure ( figsize = ( 12, 4 ) , dpi - 200 ) 42 plt.title ( \"Nedbøyning ( midt ) som funksjon av forhjulenes posisjon\", fontsize = 15 ) 43 plt.plot ( pos_{for}, w_{midt} ) 44 plt.plot ( maks_{nedbøyning_pos}, maks_{nedbøyning}, marker = \"o\", color = \"red\" ) 45 plt.xlabel ( \"Forhjulenes posisjon [mm]\", fontsize = 12 ) 46 plt.ylabel ( r\"$w_{midt}$ [mm]\", fontsize = 12 ) 47 plt.grid ( ) 48 plt.show ( ) 49 print ( 50 \"Maks nedbøyning er {:.1f} mm når forhjulene er {:.2f} m på veg over stålplata\" .format ( - maks_{nedbøyning}, maks_{nedbøyning_pos} / 1000 ) 51 52 ) Figuren nedenfor viser plottet som koden lager når den er feilfri. i Wmidt [mm] 0.0 - 2.5 - 5.0 - 7.5 - 10.0 - 12.5 - 15.0 - 17.5 Nedbøyning ( midt ) som funksjon av forhjulenes posisjon 0 1000 2000 3000 4000 5000 6000 Forhjulenes posisjon [mm] Forklar linje 25 og 26 Forklar linje 27 og 28 Forklar linje 29 og 30 Forklar linje 31 og 32 Forklar linje 33 og 34 Maks poeng: 5",
  "1 ( c ) Fagverk c ) N - fagverk T S Q ON M MEKT1101 Høst 2023 L K J a A B C D F G H E P P P P P P P a a a a a a a a V - fagverk 人口 a a + a a + a + a a / 2 / a / 2 Q N M L K J Ist S A B C D E P P P P P P P a + a + עם a a a a עם a + a Figuren over syner to fagverk, eitt N - fagverk på toppen, og eitt V - fagverk i botn. I tillegg er fagverks - geometri, lastplassering - og retning er angitt i figuren. Stavane består av stålrør med dimensjonar gitt i figuren under. Tverrsnitt ㅏ D = 139.7mm s = 4mm N - fagverket skal rivast, då diagonal / skråstavene måtte skiftast ut, men ein ønskjer å gjenbruke dei resterande over - og undergurtar til eit nytt V - fagverk, gjengitt i figuren over. Ein er usikker på kva for høgde av fagverket ein treng for at stavkrafta NDE,V - Fagverk undergurt i det nye V - fagverket ikkje skal verte større enn for N - fagverket. i rac{7}{48} MEKT1101 Høst 2023 Finn derfor stavkrafta NDE,V - Fagverk og deretter høgda h som gjer at NDE,N - Fagverk NDE,V - Fagverk. = Rund av svaret ditt til 2 desimalar. Dvs, får du at NDE = \\sqrt3 1P, skriv du - 0.58 i boksen P. under. Angi krafta som positiv dersom du finn at den aktuelle staven står i strekk, og som negativ dersom du finn at den aktuelle staven står i trykk. ( Hint: nytt snittmetoden og finn NDE,V - Fagverk uttrykt ved P, a, h og sett denne krafta lik NDE, N - Fagverk ) . NDE,V - Fagverk h = а = = Ph Kontroller kva for spenning σDE tverrsnittet må tåle dersom 6m: P = 10kN. Dersom du ikkje fant hi førre oppgåve, kan du sette h = a for vidare utrekning. a = σDE = MPa Merk at handberekningene du gjer for å løyse denne oppgåva skal leverast. Maks poeng: 6 rac{8}{48}",
  "IMAX1002 utsatt eksamen S2024 i Forside Institutt for matematiske fag Utsatt eksamen i IMAA1002, IMAG1002 og IMAT1002 Matematikk for ingeniørfag 1 Eksamensdato: 07.08.2024 Eksamenstid ( fra - til ) : 09:00 - 13:00 Hjelpemiddelkode / Tillatte hjelpemidler: C: Spesifiserte trykte og håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. Vi spesifiserer at ingen trykte eller håndskrevne hjelpemidler er tillatt, med unntak av det vedlagte formelarket. Tillatte kalkulatorer: • Casio FX - 82CW, Casio FC100 V2, Casio fx - 82ES PLUS og Casio fx - 82EX • Citizen SR - 270X og Citizen SR - 270X College • Hewlett Packard HP30S Faglig kontakt under eksamen: Anders Oulie Mobil: 414 33 354, kontor: 611 35201 Faglig kontakt møter i eksamenslokalet: Nei ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter gjerne spørsmålet ditt på forhånd. Håndtegninger: I oppgave 1, 2, 8 og 14 er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse». Vekting av oppgavene: Det er mulig å oppnå totalt 100 poeng. Oppgave 3 og 4 gir maksimalt 5 poeng. Oppgave 5 gir maksimalt 2 poeng. Oppgave 6, 7 og 13 gir maksimalt 4 poeng. Oppgave 9 gir maksimalt 6 poeng. rac{1}{15} IMAX1002 utsatt eksamen S2024 Resten av oppgavene gir maksimalt 10 poeng hver. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til “hamburgermenyen\" i øvre høyre hjørne og velg «<Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 Oppgave 1 Denne oppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. Løs det lineære likningssystemet ved Gausseliminasjon. x1 x2 x3 + x12x2x3 2x13x24x3 = = = 1 2 2 Maks poeng: 10 2 Oppgave 2 Denne deloppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. cos - sin 0 En lineær transformasjon er gitt ved T ( x ) = A ( 0 ) ã, hvor A ( 0 ) = sin 0 cos Transformasjonen medfører at vektoren & roteres en vinkel 0 mot klokka ( dersom 0 > 0 ) . Finn inversmatrisen, A - 1 ( 0 ) . Maks poeng: 10 rac{2}{15} 3 Oppgave 3 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 3 La A = og B = 2 4 - 2 [] Regn ut matriseproduktet AT B. ATB = 4 Oppgave 4 Maks poeng: 5 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Mengdene S = {8.8 ) og B = 1 2 {3}·}]} er begge basiser for R². 5 Førstnevnte ( S ) kalles gjerne standardbasis. 4 La v = B skrevet i standardbasisen S . Hva blir koordinatene til vektoren i basisen B? Maks poeng: 5 rac{3}{15} IMAX1002 utsatt eksamen S2024 5 Oppgave 5 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vektorlikningen 2 x11x21 + x32x43 1 0 4 = - 8 3 2 kan skrives om som en matriselikning Ax = 0. Finn matrise A. A = = Maks poeng: 2 rac{4}{15} 6 Oppgave 6 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Finn en basis for nullrommet til det homogene likningssystemet som tilsvarer vektorlikningen 4 2 1 + x3 2x4 3 x11x21x32 1 0 3 2 0 = 0 0 Merk! Dette er samme likningssettet som i oppgave 5. Velg alle vektorene som til sammen danner en basis for nullrommet. rac{5}{15} Velg ett eller flere alternativer 2 1 1 2 3 1 1 0 0 0 0 0 1 1 1 2 1 1 1 3 1 1 0 IMAX1002 utsatt eksamen S2024 I denne deloppgaven får du trekk i poeng dersom du velger vektorer som ikke hører til basisen, men det er ikke mulig å få mindre enn 0 poeng totalt på oppgaven. Maks poeng: 4 rac{6}{15} 7 Oppgave 7 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. I oppgave 5 har du skrevet vektorlikningen 1 2 1 4 x11x21 + x32x4 3 0 3 2 0 = 0 0 om til en matriselikning Ax = 0. Finn en basis for kolonnerommet til A. Obs! Det kan være flere riktige svar. rac{7}{15} Velg ett eller flere alternativer 2 3 , 4 3 2 1 2 1 {A∙A} 1 1 2 1 2 {8 - 8 - 9 ) } 2 {B}} 3 {B}} 3 1 2 1 4 1 2 3 3 2 1 2 {8 - 6 - 8 ) 1 3 2 ( 8 - 6 ) 3 3 2 IMAX1002 utsatt eksamen S2024 I denne deloppgaven får du trekk i poeng dersom du velger et sett som ikke utgjør en basis for kolonnerommet, men det er ikke mulig å få mindre enn 0 poeng totalt på oppgaven. Maks poeng: 4 rac{8}{15} 8 Oppgave 8 IMAX1002 utsatt eksamen S2024 Denne deloppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. La z = 2e i 1 ) Tegn et punkt som representerer z i det komplekse planet. 2 ) Identifiser modulusen og argumentet til z. 3 ) Skriv z på polarform. 4 ) Skriv z på normalform, dvs, på formen a + bi. 5 ) Regn ut 24. Maks poeng: 10 rac{9}{15} 9 Oppgave 9 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. La z = 3 - 2i og w = 2 + i være to komplekse tall. 1 ) Regn ut z⚫ w og oppgi svaret på normalform, dvs a + bi. Oppgi svar korrekt avrundet til 1 desimal. 2.W = + i. พ 2 ) Regn ut og oppgi svaret på normalform, dvs a + bi. Oppgi svar korrekt avrundet til 1 desimal. EN = + نے. 3 ) Regn ut ( z + w ) . Z og oppgi svaret på normalform, dvs a + bi. Oppgi svar korrekt avrundet til 1 desimal. ( z + w ) · z = • + i. Notasjon: Zer det komplekse konjugatet til z. Maks poeng: 6 rac{10}{15} IMAX1002 utsatt eksamen S2024 10 Oppgave 10 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 ) Finn den generelle løsningen til den følgende differensiallikningen: y' - y² sin ( x ) = 0. Velg ett alternativ ○ y ( x ) = cos ( x ) + C ○ g ( r ) = x cos ( x ) + C 1 y ( x ) = — sin ( x ) + C ○ y ( x ) = x sin x + C ○ y ( x ) = - sin ( x ) + C - y ( x ) = = cos ( x ) + C 1 ○ y ( x ) = = sin ( x ) + C Y ( r ) 1 y ( x ) = cos ( x ) + C 2 ) Differensiallikningen xy' - 2y = x² har den generelle løsningen y ( x ) = x² ( ln ( x ) + C ) . Løs initialverdiproblemet xy' – 2y = x², y ( 1 ) = 0. rac{11}{15} Velg ett alternativ ○ y ( x ) = x² ( ln ( x ) + 3 ) y ( x ) = x² ( ln ( x ) + 2 ) ○ y ( x ) = x² ( ln ( x ) – 3 ) y ( x ) = x² ( In ( x ) + 1 ) ○ y ( x ) = x² ( ln ( x ) ) ○ y ( x ) = x² ( ln ( x ) — 1 ) - ○ y ( x ) = x² ( ln ( x ) — 2 ) IMAX1002 utsatt eksamen S2024 Maks poeng: 10 rac{12}{15} IMAX1002 utsatt eksamen S2024 11 Oppgave 11 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 ) Finn den generelle løsningen til den følgende differensiallikningen: Velg ett alternativ: C₁e - \\sqrt3x + C2e2 ○ C₁e + C2xe \\sqrt\\sqrt3e ( C₁ cos ( x ) + C2 sin ( x ) ) ○ C₁е¯x + C 2е² ○ C₁e¯ + C2e C₁e\\sqrt3x + C2xе\\sqrt3x ○ e²x ( C₁ cos ( x ) + C2 sin ( x ) ) e / 3x ( C₁ cos ( x ) + C2 sin ( x ) ) ex ( C₁ cos ( x ) + C2 sin ( 2x ) ) y\" — 2y' + 4y = 0. - ex * ( C₁ cos ( \\sqrt3x ) + C2 sin ( \\sqrt3x ) ) - 2 ) Differensiallikningen y\" - 2y' – 3 = 0 har den generelle løsningen y løsningen til det følgende initialverdiproblemet: = C₁e C2e. Finn y\" — 2y' – 3 = 0, y ( 0 ) = 1, y' ( 0 ) = 1. rac{13}{15} Velg ett alternativ ○ y ( x ) = - e³x + e - e3x ex 3x ○ y ( x ) = 1½ ½³ imes³ imes + e¯ * ○ y ( x ) = - e³x + ○ y ( x ) = e³x + 2e¯x ○ y ( x ) = 2e³x + e¯x ○ y ( x ) = e³x + ex 3x ○ y ( x ) = ½½ e³ imes + ½е X IMAX1002 utsatt eksamen S2024 Maks poeng: 10 12 Oppgave 12 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 1 ) Er v = 1 }] - 3 - 12 2 2 en egenvektor til A = 0 - 2 0? Hvis ja, med hvilken egenverdi? - 4 9 3 Skriv inn - 555 dersom v ikke er en egenvektor til A, og skriv inn tilhørende egenverdi ellers. 入 = 2 3 - 12 2 2 ) Er w = 1 en egenvektor til A = 0 - 2 0 ? Hvis ja, med hvilken egenverdi? 1 4 9 3 Skriv inn - 555 dersom w ikke er en egenvektor til A, og skriv inn tilhørende egenverdi ellers. λ = Maks poeng: 10 rac{14}{15} 13 Oppgave 13 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vi vet at v er en egenvektor til matrisen A med tilhørende egenverdi - 1, og at w er en egenvektor til matrisen A med tilhørende egenverdi 2. • 1 ) Uttrykket 3 Av + 2Aw kan forenkles til k₁ · + k₂ · w, hvor k₁ og k₂ er heltall. Finn verdien til k₁ og k2. k1 = k2 = 2 ) Uttrykket 744 - A² kan også forenkles til m₁ + m² · w, hvor m₁og m2 er heltall. Finn verdien til m₁ og m2. • • m1 = ' m2 = 14 Oppgave 14 Denne deloppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. Diagonaliser den følgende matrisen: 2 1 01 A = 0 1 3 0 0 2 dvs finn en inverterbar matrise C og en diagonal matrise D slik at A = Maks poeng: 4 CDC - 1. Maks poeng: 10 rac{15}{15}",
  "1 ( c ) Fagverk c ) N - fagverk T S Q ON M MEKT1101 Høst 2023 L K J a A B C D F G H E P P P P P P P a a a a a a a a V - fagverk 人口 a a + a a + a + a a / 2 / a / 2 Q N M L K J Ist S A B C D E P P P P P P P a + a + עם a a a a עם a + a Figuren over syner to fagverk, eitt N - fagverk på toppen, og eitt V - fagverk i botn. I tillegg er fagverks - geometri, lastplassering - og retning er angitt i figuren. Stavane består av stålrør med dimensjonar gitt i figuren under. Tverrsnitt ㅏ D = 139.7mm s = 4mm N - fagverket skal rivast, då diagonal / skråstavene måtte skiftast ut, men ein ønskjer å gjenbruke dei resterande over - og undergurtar til eit nytt V - fagverk, gjengitt i figuren over. Ein er usikker på kva for høgde av fagverket ein treng for at stavkrafta NDE,V - Fagverk undergurt i det nye V - fagverket ikkje skal verte større enn for N - fagverket. i rac{7}{48} MEKT1101 Høst 2023 Finn derfor stavkrafta NDE,V - Fagverk og deretter høgda h som gjer at NDE,N - Fagverk NDE,V - Fagverk. = Rund av svaret ditt til 2 desimalar. Dvs, får du at NDE = \\sqrt3 1P, skriv du - 0.58 i boksen P. under. Angi krafta som positiv dersom du finn at den aktuelle staven står i strekk, og som negativ dersom du finn at den aktuelle staven står i trykk. ( Hint: nytt snittmetoden og finn NDE,V - Fagverk uttrykt ved P, a, h og sett denne krafta lik NDE, N - Fagverk ) . NDE,V - Fagverk h = а = = Ph Kontroller kva for spenning σDE tverrsnittet må tåle dersom 6m: P = 10kN. Dersom du ikkje fant hi førre oppgåve, kan du sette h = a for vidare utrekning. a = σDE = MPa Merk at handberekningene du gjer for å løyse denne oppgåva skal leverast. Maks poeng: 6 rac{8}{48}",
  "1 ( c ) Fagverk c ) N - fagverk T S Q ON M MEKT1101 Høst 2023 L K J a A B C D F G H E P P P P P P P a a a a a a a a V - fagverk 人口 a a + a a + a + a a / 2 / a / 2 Q N M L K J Ist S A B C D E P P P P P P P a + a + עם a a a a עם a + a Figuren over syner to fagverk, eitt N - fagverk på toppen, og eitt V - fagverk i botn. I tillegg er fagverks - geometri, lastplassering - og retning er angitt i figuren. Stavane består av stålrør med dimensjonar gitt i figuren under. Tverrsnitt ㅏ D = 139.7mm s = 4mm N - fagverket skal rivast, då diagonal / skråstavene måtte skiftast ut, men ein ønskjer å gjenbruke dei resterande over - og undergurtar til eit nytt V - fagverk, gjengitt i figuren over. Ein er usikker på kva for høgde av fagverket ein treng for at stavkrafta NDE,V - Fagverk undergurt i det nye V - fagverket ikkje skal verte større enn for N - fagverket. i rac{7}{48} MEKT1101 Høst 2023 Finn derfor stavkrafta NDE,V - Fagverk og deretter høgda h som gjer at NDE,N - Fagverk NDE,V - Fagverk. = Rund av svaret ditt til 2 desimalar. Dvs, får du at NDE = \\sqrt3 1P, skriv du - 0.58 i boksen P. under. Angi krafta som positiv dersom du finn at den aktuelle staven står i strekk, og som negativ dersom du finn at den aktuelle staven står i trykk. ( Hint: nytt snittmetoden og finn NDE,V - Fagverk uttrykt ved P, a, h og sett denne krafta lik NDE, N - Fagverk ) . NDE,V - Fagverk h = а = = Ph Kontroller kva for spenning σDE tverrsnittet må tåle dersom 6m: P = 10kN. Dersom du ikkje fant hi førre oppgåve, kan du sette h = a for vidare utrekning. a = σDE = MPa Merk at handberekningene du gjer for å løyse denne oppgåva skal leverast. Maks poeng: 6 rac{8}{48}"
]