[
  "i Institutt for fysikk Eksamensoppgave i IFYKJA1000 Fysikk / kjemi IFYKJG1000 Fysikk / kjemi IFYKJT1000 Fysikk / kjemi VB6104 Fysikk / kjemi Eksamensdato: 15.08.2023 Eksamenstid ( fra - til ) : 09:00 - 14:00 Hjelpemiddelkode / Tillatte hjelpemidler: C / Ingen skriftlige hjelpemidler utover formelarket vedlagt Inspera. Bestemt, enkel kalkulator eller en av følgende kalkulatorer: Casio FX9750, Casio FX9850, Casio FX9860GII ( også SD ) , Casio FXCG20, Casio FXCG50, Texas Instrument 84 Plus. Faglig kontakt under eksamen: Trondheim: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Christian Lauritsen ( kjemi ) : 41 25 06 67 Ålesund: Ben David Normann ( fysikk ) : 73 55 94 rac{59}{93} 84 87 23, Jonas Julius Harang ( kjemi ) : 99 114 520 Gjøvik: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Rolf Alexander Skar ( kjemi ) : 61 13 52 60 Krigsskolen: Per Harald Ninive: 99 587 672 Faglig kontakt møter i eksamenslokalet: NEI ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du ønsker å kontakte faglærer. Noter gjerne spørsmålet ditt på forhånd. InsperaScan: I oppgave [3,5,10,12, 19] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse>>. Vekting av oppgavene: Maksimal poengsum angis i hver oppgave. En oversikt over maksimal poengsum for alle oppgavene finnes i innholdsfortegnelsen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 a ) Finn natrium ( Na ) i periodesystemet, og velg riktig påstand. Periodesystemet er gitt i vedlagt \"Formelark kjemi\". Velg ett alternativ: ○ natrium er et ikke - metall og alle ikke - metaller har 1 elektron i ytterste skall natrium tilhører periode 2 og alle grunnstoff i periode 2 har 2 elektroner i ytterste skall O natrium tilhører gruppe 1 og har 1 elektron i ytterste skall ○ natrium tilhører gruppe 1 og alle grunnstoff i gruppe 1 har 1 elektronskall b ) Hva er elektronkonfigurasjonen til natrium ( Na ) ? Velg ett alternativ 1s²2s22p63s¹ ○ 1s22s22p5 1s22s22p6 1s22s22p63s² 82 c ) Hvor mange nøytroner er det i isotopen 206 Pb? Velg ett alternativ 124 4 82 206 2 d ) Hva er riktig om ionebindinger? Det er ... Velg ett alternativ O bindinger hvor elektroner deles mellom atomer ○ svake tiltrekningskrefter mellom polare molekyl Obindinger mellom ioner med ulik ladning svake tiltrekningskrefter mellom upolare molekyl 2 Balanser reaksjonsligningen ved å skrive inn tallene som mangler. As₂S3 + ( 14 ) NaNO3 + ( 6 ) Na2CO3 → NaNO2 + 6CO2. Maks poeng: 4 ( 2 ) NaзAsO4 + ( 3 ) Na2SO4 + ( 14 ) Maks poeng: 2 3 a ) Beregn følgende i 200 g PbSO4 ( 3 poeng ) : i ) Antall mol PbSО4. ii ) Antall O - atomer. iii ) Antall gram bly ( Pb ) . b ) Propan ( C3H8 ) reagerer med oksygen ( O2 ) og det dannes karbondioksid ( CO2 ) og vann ( H2O ) i henhold til følgende reaksjonsligning: C3H8 ( g ) + 502 ( g ) → 3CO2 ( g ) + 4H2O ( g ) 50,0 g C3H8 ( g ) reagerer med 105,0 g O2 ( g ) . Beregn antall liter CO2 ( g ) som kan bli dannet ved 50°C og 2,0 atm. ( 4 poeng ) Molare masser: = M ( Pb ) 207,2 g / mol = M ( S ) 32,06 g / mol = M ( O ) 16,00 g / mol = M ( C ) 12,01 g / mol M ( H ) = 1,008 g / mol Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 7 4 a ) Gitt følgende likevektsreaksjon ( 1 ) : ( 1 ) 2NO2 ( g ) → N2O4 ( g ) Hva er riktig likevektskonstant, Kc, for reaksjonen? Velg ett alternativ ○ Kc ○ Kc [N204] = [NO2] [NO2]2 = [N2O4] [N2O4] ○ Kc = [NO2] 2 [NO2] ○ Kc = Кс [N2O4] b ) Likevektskonstanten, Kc, for reaksjon ( 1 ) i oppgave a ) er 1, 6. 10² ved 25°C. Likevektskonsentrasjonen av NO2 er 0,0162 mol / L. Hva er likevektskonsentrasjonen av N2O4 i mol / L? Velg ett alternativ 6,10.105 780 1,64.10 - 6 0,00128 ○ 0,0420 2,59 c ) Gitt følgende likevektsreaksjon ( 2 ) : ( 2 ) 2NOCI ( g ) 2NO ( g ) + Cl2 ( g ) En beholder på 1,0 L inneholder 0,500 mol NOCI ( g ) , 0,0500 mol NO ( g ) og 0,0155 mol Cl2 ( g ) . Hva er reaksjonskvotienten, Q? Velg ett alternativ: ○ 1,29 - 104 6451 7,75.10 - 5 ○ 0,00155 1,55.10 - 4 645 d ) Likevektskonstanten, Kc, for reaksjon ( 2 ) i oppgave c ) er 2, 17. 105. I hvilken retning vil reaksjonen gå for å innstille likevekt? Velg ett alternativ mot høyre Okan ikke avgjøres med informasjonen som er gitt ○ den vil ikke forskyves fordi den er ved likevekt mot venstre Maks poeng: 4 5 a ) Beregn løselighetsproduktet, Ksp, til PbCl 2 i rent vann ved 25°C hvis løseligheten er 0,0162 mol / L. ( 3 poeng ) b ) Beregn pH i en 0,010 mol / L HCI - løsning. ( 2 poeng ) c ) Beregn pH i en 0,100 mol / L NaCH3COO - løsning ved 25°C. Syrekonstanten, Ka, til CH3COOH ved 25°C: 1,74.105 ( 3 poeng ) - 5 Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 6 En bestemt elbil oppgis å ha et energiforbruk ved blandet kjøring på 1 kWh / mil. Hva tilsvarer dette i joule per meter: J / m? Oppgitt: 1 kWh = 3,6 106 J, 1 mil = 10 km. Velg ett alternativ: ○ 0,23 kJ / m ○ 1,0 J / m ○ 0,36 kJ / m ○ 1,0 kJ / m ○ 3,6 J / m . Maks poeng: 2 1,2 m / s². Hvor lang tid bruker bilen a ) En bil starter fra ro og akselererer rettlinjet med en akselerasjon a = på å tilbakelegge en strekning på 60 m? Velg ett alternativ: t = 10 s ○ t = 1,2 s Ot = 2,4 s ང O t = 12 s O t = 1,0 s b ) En ball skytes ut fra bakkenivå med startfart vo 10 m / s og utgangsvinkel a = horisontalt, og vi neglisjerer luftmotstand. Se figuren under. = € 30°. Underlaget er Vo α x Beregn avstanden x mellom utgangspunktet og der ballen lander. Velg ett alternativ x = 5,1 m x = 8,8 m x = 18 m x = 4,4 m ○ x = 2,2 m Maks poeng: 4 8 a ) To steiner med samme masse m er festet sammen med en masseløs snor. Steinene slippes fra en høy bygning, og faller loddrett mot jorda uten luftmotstand og uten å rotere slik figuren under viser. m m Avstanden mellom steinene endres ikke under fallet. Hva er snordraget S mens steinene faller? Velg ett alternativ: S = mg S = 0 S = mg S = 3mg S = 2mg b ) Vogna i en berg - og - dal - bane følger en sirkelformet bane ( \"loop\" ) . Vogna er ikke festet til underlaget, men beholder kontakten med underlaget gjennom hele banen. Det virker ikke noen form for friksjon / luftmotstand på vogna. På figuren under er det markert fire punkter i banen: C D ◎ ☐ B A A: Nederste punkt i loopen B: Midtveis til toppen, på vei opp C: Toppunktet D: Midtveis til toppen, på vei ned La N angi normalkrafta fra underlaget på vogna. Hvilken påstand er riktig? Velg ett alternativ ○ N størst i punkt A ON størst i punkt B ON størst i punkt C ON størst i punkt D N har samme verdi i alle fire punktene Maks poeng: 4 9 Figuren under viser fartsgrafen v ( t ) til en stein som slippes fra en høy bygning ved t = ned mot bakken. Etter en viss tid har steinen nådd terminalfarten Umax. Se figuren under. ν 0 og faller vannrett Vmax Hvordan blir den tilsvarende akselerasjonsgrafen for steinen? a a a A C E Velg ett alternativ: A B C D E a a D B Maks poeng: 2 10 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En bil bråbremser fra en startfart v₁ til stillestående på et horisontalt underlag i løpet av en strekning s. Bilen bremser så hardt det er mulig uten å blokkere hjulene, og den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. Vo Ms S V = 0 a ) Tegn kreftene som virker på bilen under oppbremsingen, dersom vi behandler bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) b ) Vis at bilens bremselengde er gitt ved s = ( 4 poeng ) v² 2gμs Den samme bilen kjører så i en nedoverbakke med helningsvinkel O. Bilen bråbremser så hardt det er mulig uten å blokkere hjulene, fra startfart vo til stillestående i løpet av en strekning s. Den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. S μs A v = 0 c ) Tegn kreftene som virker på bilen under oppbremsingen i nedoverbakken, dersom vi ser på bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) d ) Vis at bilens bremselengde i nedoverbakken er gitt ved s = v 2g ( μs cos 0 - sinė ) \" ( 4 poeng ) e ) Dersom bakken blir for bratt, vil det være umulig å stoppe, uansett hvor liten vo er. Hva er den største verdien kan ha for at bilen skal klare å stoppe, dersom friksjonskoeffisienten er us 0,80? ( 4 poeng ) = Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her eller bruk Scantron - ark. Maks poeng: 20 11 En syklist sykler oppover en bakke med helningsvinkel 0 = 10° med konstant fart v = 10 km / h. Farten er såpass lav at luftmotstand kan neglisjeres. Sykkelen med syklisten oppå har en total masse m = 80 kg. Se figuren under. m V Ꮎ Bestem effekten P som syklisten må produsere for å holde en konstant fart oppover bakken. Velg ett alternativ: OP = 0,78 kW OP = 0,078 kW ○ P = 1,4 kW ○ P = 0, 14 kW Р OP = 0,38 kW Maks poeng: 2 12 Denne oppgaven har flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En massiv, homogen sylinder med masse M = 0,50 kg og radius R = 0, 10 m ruller oppover et skråplan med helningsvinkel ẞ = 20°. Sylinderen er ved t = 0 nederst på skråplanet, og da har massesenteret farten vo = 3,0 m / s oppover skråplanet. Den fortsetter å rulle uten å gli oppover skråplanet. Figuren under viser sylinderens posisjon ved tiden t = 0, samt det høyeste punktet der den snur. S snur t = 0 Vo B Vi ser bort fra luftmotstand i hele denne oppgaven. a ) Tegn kreftene som virker på sylinderen når den ruller oppover skråplanet. For full uttelling må alle krefter ha navn og det må være et rimelig størrelsesforhold mellom kreftene. ( 3 poeng ) b ) Vis at absoluttverdien av akselerasjonen til sylinderens massesenter mens den ruller oppover er 2,2 m / s² med retning nedover langs skråplanet. ( 3 poeng ) a = c ) Bestem strekningen s som sylinderen ruller oppover skråplanet før den snur ( se figuren over ) . ( 3 poeng ) d ) Skisser og forklar fartsgrafen, dvs. v ( t ) , for sylinderen når den ruller på skråplanet. Grafen må vise v ( t ) for tidsrommet fra t = 0 til den er tilbake til utgangspunktet. Det kreves ingen eksakt graf med eksplisitte tallverdier, men grafens form må framgå tydelig. ( 3 poeng ) e ) Hvor lang tid tar det fra t = 0 til sylinderen er tilbake til startpunktet ved bunnen av skråplanet? ( 3 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantronark. Maks poeng: 15 13 To massive sylindre med ulike masser og ulike radier ligger i ro på toppen av et skråplan. Den største sylinderen har masse M og radius R, mens den minste sylinderen har masse m < M og radius r < R. De to sylinderne slippes samtidig fra samme høyde, og de ruller begge nedover skråplanet uten å skli. Se figuren under. Hvilken påstand er riktig? Velg ett alternativ: Sylinderen med masse M kommer til bunnen av skråplanet først fordi det virker størst tyngdekraft på denne Sylindrene kommer til bunnen av skråplanet samtidig ettersom massesentrene ( CM ) hele tiden samme fart Sylinderen med masse m kommer til bunnen først fordi denne har lavest treghetsmoment om rotasjonsaksen Sylindrene kommer til bunnen av skråplanet samtidig ettersom sylindrene hele tiden har samme vinkelfart Sylinderen med masse m kommer til bunnen av skråplanet først fordi det virker lavest friksjon på denne Maks poeng: 2 14 Et tannhjul med radius r er forbundet via et stramt kjede med et mindre tannhjul med radius r / 2. Begge tannhjulene roterer om sitt faste sentrum. Når det største tannhjulet roterer med vinkelfart w₁, roterer det minste med vinkelfart w2. Se figuren under. @1 r @2 r / 2 Hva er forholdet mellom vinkelfartene w₂ og w₁ til hhv. det minste og det største tannhjulet? [Hint: alle punkter på kjedet må ha samme lineære fart.] Velg ett alternativ: ○ W2 / W1 ○ W₂ / W1 rac{02}{01} ○ W2 / W1 W2 / W1 = = = = = 12 1 2 1 \\sqrt2 Maks poeng: 2 15 En kloss er festet i en fjær og kan svinge friksjonsfritt på et horisontalt underlag. Klossen slippes med null startfart fra en startamplitude x₁ = A. På figuren under er det indikert fire punkter: x1 = som tilsvarer slapp fjær ) og x4 = - A ( startpunktet ) , x2 = A / 2, x30 ( likevektspunktet - A / 4. m x4 = - A / 4 X3 x3 = 0 likevekts - X₂ = A / 2 X1 = startpunkt X A stilling I hvilket av punktene er absoluttverdien til klossens akselerasjon størst? Velg ett alternativ: X1 X2 x3 X4 Akselerasjonen har samme verdi i alle de fire punktene Maks poeng: 2 16 | Realfagsbygget i Trondheim henger en pendel som kan modelleres som en punktmasse som svinger med små utslag i en masseløs snor. Vi måler perioden til T = 10,0 s. Hva er lengden L til pendelsnora? Velg ett alternativ: L = 98,1 m L = 36,9 m OL = 24,8 m OL = 3,87 m ○ L = 9,81 m Maks poeng: 2 l 17 Hangarskipet USS \"Gerald R. Ford\" har en masse m = 1,0.108 kg. Skipet kan modelleres som en rektangulær kasse med jevn massefordeling og med lengde 7 = 320 m og bredde b = 40 m. Vannet har massetetthet p = 1,0∙ 10³ kg / m³. Se figuren under. h b - - vannlinje Bestem dybden h som skroget stikker ned i vannet ( dvs. den vertikale avstanden mellom vannlinja og bunnen av skroget ) . Velg ett alternativ ○ h = 32 m ○ h = 13 m h = 7,8 m ○ h = 41 m ○ h = 21 m Maks poeng: 2 18 En kraftforsterker består av et bevegelig stempel med sirkulært tverrsnitt og diameter D₁ som er forbundet via en inkompressibel væske med et annet, større stempel med sirkulært tverrsnitt og diameter D2. Når en kraft F1 ( \"input\" ) virker på det minste stempelet, er kraften F2 på det største stempelet ( \"output\" ) . Se figuren under. F2 D2 F₁ 1 D₁ Hva må forholdet mellom diametrene D2 og D1 av stemplene være dersom kraftforsterkeren skal ha en forsterkning på 100 ganger ( dvs. F2 = 100F₁ ) ? Velg ett alternativ: ○ D2 / D₁ = 1,4 ○ D2 / D₁ = \\sqrt\\sqrt2 ○ D2 / D₁ = 10³ D2 / D₁ = 10 ○ D2 / D₁ = 102 Maks poeng: 2 19 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. Et svømmebasseng har rektangulær grunnflate A1 = 10 m x 5,0 m og det er fylt vann i høyde h = 3,0 m over bassengbunnen. Bassenget skal tømmes gjennom et horisontalt rør med sirkulært tverrsnitt og diameter D = 75 mm som ligger i samme dybde som bassengbunnen. Over vannspeilet og ved rørutløpet er det lufttrykk po = 101 kPa. Se figuren under. A₁ Po D h Ро a ) Røret er i utgangspunktet stengt med en ventil. Hvor stort er trykket mot ventilen fra den siden som ligger an mot vannet? ( 2 poeng ) b ) Ventilen åpnes så helt, slik at vann strømmer gjennom røret. Vis at volumstrømmen i røret er 0, 034 m³ / s dersom vi ser bort fra alle former for tap. ( 2 poeng ) c ) Hva blir volumstrømmen dersom det monteres inn en vannmåler som utgjør en enkeltmotstand med tapskoeffisient = 7,0 like ved utløpet, og vi neglisjerer all rørfriksjon? ( 2 poeng ) I de to siste oppgavene skal vi se bort fra alle former for tap. d ) Vanndybden h avtar gradvis etter hvert som bassenget tømmes. La A2 være tverrsnittarealet av røret. Vis eller forklar at h ( t ) er løsningen av differensiallikningen dh A2 d = \\sqrt\\sqrt2gh. [Hint: Endring i bassengvolum per tidsenhet må tilsvare volumstrøm i røret] ( 2 poeng ) dt — e ) Hvis tappingen starter ved t = 0, er løsningen gitt ved ( du behøver IKKE å vise dette for full uttelling ) 2 h ( t ) = h ( 0 ) A2 A1 t Hvor lang tid tar det å tømme bassenget dersom vanndybden ved t = 0 er h ( 0 ) = 3,0 m ? ( 2 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantron - ark. Maks poeng: 10 20 a ) Følgende to sinusformede tversbølger møtes og produserer en stående bølge: = Y₁ ( x,t ) = ( 1,0 m ) sin ( 1,0 m - 1 1 ( 0, Y2 ( x, t ) • x + 1,0 s¹t ) og ( 1,0 m ) sin ( 1, 0 m - 1 • x - 1,0 s¹. t ) . Hva blir den maksimale amplituden A, frekvensen f og bølgelengden for den resulterende stående bølgen? Velg ett alternativ A = 2,0 m, f = 0, 16 Hz, λ = 1,0 m OA = 1,0 m, f = 1,0 Hz, λ = 1,0 m A = 2,0 m, f = 0, 16 Hz, λ = 6,3 m OA = 2,0 m, f = 1,0 Hz, λ = 6,3 m A = 1,0 m, f = 0, 16 Hz, λ = 6,3 m = b ) En pianostreng med lengde L € 2,00 m og lineær massetetthet μ grunnfrekvensen for strengen, som er spent fast i begge ender, blir f1 = = 5,00 g / m skal strammes slik at 65,0 Hz. Hva må snorstrammingen ( \"tension\" ) i strengen være? Velg ett alternativ: FT = 676 N FT = 338 N FT = 3, 38 · 105 N OFT = 1, 30 N OFT 1,30 103 N = Maks poeng: 4",
  "i Institutt for fysikk Eksamensoppgave i IFYKJA1000 Fysikk / kjemi IFYKJG1000 Fysikk / kjemi IFYKJT1000 Fysikk / kjemi VB6104 Fysikk / kjemi Eksamensdato: 15.08.2023 Eksamenstid ( fra - til ) : 09:00 - 14:00 Hjelpemiddelkode / Tillatte hjelpemidler: C / Ingen skriftlige hjelpemidler utover formelarket vedlagt Inspera. Bestemt, enkel kalkulator eller en av følgende kalkulatorer: Casio FX9750, Casio FX9850, Casio FX9860GII ( også SD ) , Casio FXCG20, Casio FXCG50, Texas Instrument 84 Plus. Faglig kontakt under eksamen: Trondheim: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Christian Lauritsen ( kjemi ) : 41 25 06 67 Ålesund: Ben David Normann ( fysikk ) : 73 55 94 rac{59}{93} 84 87 23, Jonas Julius Harang ( kjemi ) : 99 114 520 Gjøvik: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Rolf Alexander Skar ( kjemi ) : 61 13 52 60 Krigsskolen: Per Harald Ninive: 99 587 672 Faglig kontakt møter i eksamenslokalet: NEI ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du ønsker å kontakte faglærer. Noter gjerne spørsmålet ditt på forhånd. InsperaScan: I oppgave [3,5,10,12, 19] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse>>. Vekting av oppgavene: Maksimal poengsum angis i hver oppgave. En oversikt over maksimal poengsum for alle oppgavene finnes i innholdsfortegnelsen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 a ) Finn natrium ( Na ) i periodesystemet, og velg riktig påstand. Periodesystemet er gitt i vedlagt \"Formelark kjemi\". Velg ett alternativ: ○ natrium er et ikke - metall og alle ikke - metaller har 1 elektron i ytterste skall natrium tilhører periode 2 og alle grunnstoff i periode 2 har 2 elektroner i ytterste skall O natrium tilhører gruppe 1 og har 1 elektron i ytterste skall ○ natrium tilhører gruppe 1 og alle grunnstoff i gruppe 1 har 1 elektronskall b ) Hva er elektronkonfigurasjonen til natrium ( Na ) ? Velg ett alternativ 1s²2s22p63s¹ ○ 1s22s22p5 1s22s22p6 1s22s22p63s² 82 c ) Hvor mange nøytroner er det i isotopen 206 Pb? Velg ett alternativ 124 4 82 206 2 d ) Hva er riktig om ionebindinger? Det er ... Velg ett alternativ O bindinger hvor elektroner deles mellom atomer ○ svake tiltrekningskrefter mellom polare molekyl Obindinger mellom ioner med ulik ladning svake tiltrekningskrefter mellom upolare molekyl 2 Balanser reaksjonsligningen ved å skrive inn tallene som mangler. As₂S3 + ( 14 ) NaNO3 + ( 6 ) Na2CO3 → NaNO2 + 6CO2. Maks poeng: 4 ( 2 ) NaзAsO4 + ( 3 ) Na2SO4 + ( 14 ) Maks poeng: 2 3 a ) Beregn følgende i 200 g PbSO4 ( 3 poeng ) : i ) Antall mol PbSО4. ii ) Antall O - atomer. iii ) Antall gram bly ( Pb ) . b ) Propan ( C3H8 ) reagerer med oksygen ( O2 ) og det dannes karbondioksid ( CO2 ) og vann ( H2O ) i henhold til følgende reaksjonsligning: C3H8 ( g ) + 502 ( g ) → 3CO2 ( g ) + 4H2O ( g ) 50,0 g C3H8 ( g ) reagerer med 105,0 g O2 ( g ) . Beregn antall liter CO2 ( g ) som kan bli dannet ved 50°C og 2,0 atm. ( 4 poeng ) Molare masser: = M ( Pb ) 207,2 g / mol = M ( S ) 32,06 g / mol = M ( O ) 16,00 g / mol = M ( C ) 12,01 g / mol M ( H ) = 1,008 g / mol Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 7 4 a ) Gitt følgende likevektsreaksjon ( 1 ) : ( 1 ) 2NO2 ( g ) → N2O4 ( g ) Hva er riktig likevektskonstant, Kc, for reaksjonen? Velg ett alternativ ○ Kc ○ Kc [N204] = [NO2] [NO2]2 = [N2O4] [N2O4] ○ Kc = [NO2] 2 [NO2] ○ Kc = Кс [N2O4] b ) Likevektskonstanten, Kc, for reaksjon ( 1 ) i oppgave a ) er 1, 6. 10² ved 25°C. Likevektskonsentrasjonen av NO2 er 0,0162 mol / L. Hva er likevektskonsentrasjonen av N2O4 i mol / L? Velg ett alternativ 6,10.105 780 1,64.10 - 6 0,00128 ○ 0,0420 2,59 c ) Gitt følgende likevektsreaksjon ( 2 ) : ( 2 ) 2NOCI ( g ) 2NO ( g ) + Cl2 ( g ) En beholder på 1,0 L inneholder 0,500 mol NOCI ( g ) , 0,0500 mol NO ( g ) og 0,0155 mol Cl2 ( g ) . Hva er reaksjonskvotienten, Q? Velg ett alternativ: ○ 1,29 - 104 6451 7,75.10 - 5 ○ 0,00155 1,55.10 - 4 645 d ) Likevektskonstanten, Kc, for reaksjon ( 2 ) i oppgave c ) er 2, 17. 105. I hvilken retning vil reaksjonen gå for å innstille likevekt? Velg ett alternativ mot høyre Okan ikke avgjøres med informasjonen som er gitt ○ den vil ikke forskyves fordi den er ved likevekt mot venstre Maks poeng: 4 5 a ) Beregn løselighetsproduktet, Ksp, til PbCl 2 i rent vann ved 25°C hvis løseligheten er 0,0162 mol / L. ( 3 poeng ) b ) Beregn pH i en 0,010 mol / L HCI - løsning. ( 2 poeng ) c ) Beregn pH i en 0,100 mol / L NaCH3COO - løsning ved 25°C. Syrekonstanten, Ka, til CH3COOH ved 25°C: 1,74.105 ( 3 poeng ) - 5 Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 6 En bestemt elbil oppgis å ha et energiforbruk ved blandet kjøring på 1 kWh / mil. Hva tilsvarer dette i joule per meter: J / m? Oppgitt: 1 kWh = 3,6 106 J, 1 mil = 10 km. Velg ett alternativ: ○ 0,23 kJ / m ○ 1,0 J / m ○ 0,36 kJ / m ○ 1,0 kJ / m ○ 3,6 J / m . Maks poeng: 2 1,2 m / s². Hvor lang tid bruker bilen a ) En bil starter fra ro og akselererer rettlinjet med en akselerasjon a = på å tilbakelegge en strekning på 60 m? Velg ett alternativ: t = 10 s ○ t = 1,2 s Ot = 2,4 s ང O t = 12 s O t = 1,0 s b ) En ball skytes ut fra bakkenivå med startfart vo 10 m / s og utgangsvinkel a = horisontalt, og vi neglisjerer luftmotstand. Se figuren under. = € 30°. Underlaget er Vo α x Beregn avstanden x mellom utgangspunktet og der ballen lander. Velg ett alternativ x = 5,1 m x = 8,8 m x = 18 m x = 4,4 m ○ x = 2,2 m Maks poeng: 4 8 a ) To steiner med samme masse m er festet sammen med en masseløs snor. Steinene slippes fra en høy bygning, og faller loddrett mot jorda uten luftmotstand og uten å rotere slik figuren under viser. m m Avstanden mellom steinene endres ikke under fallet. Hva er snordraget S mens steinene faller? Velg ett alternativ: S = mg S = 0 S = mg S = 3mg S = 2mg b ) Vogna i en berg - og - dal - bane følger en sirkelformet bane ( \"loop\" ) . Vogna er ikke festet til underlaget, men beholder kontakten med underlaget gjennom hele banen. Det virker ikke noen form for friksjon / luftmotstand på vogna. På figuren under er det markert fire punkter i banen: C D ◎ ☐ B A A: Nederste punkt i loopen B: Midtveis til toppen, på vei opp C: Toppunktet D: Midtveis til toppen, på vei ned La N angi normalkrafta fra underlaget på vogna. Hvilken påstand er riktig? Velg ett alternativ ○ N størst i punkt A ON størst i punkt B ON størst i punkt C ON størst i punkt D N har samme verdi i alle fire punktene Maks poeng: 4 9 Figuren under viser fartsgrafen v ( t ) til en stein som slippes fra en høy bygning ved t = ned mot bakken. Etter en viss tid har steinen nådd terminalfarten Umax. Se figuren under. ν 0 og faller vannrett Vmax Hvordan blir den tilsvarende akselerasjonsgrafen for steinen? a a a A C E Velg ett alternativ: A B C D E a a D B Maks poeng: 2 10 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En bil bråbremser fra en startfart v₁ til stillestående på et horisontalt underlag i løpet av en strekning s. Bilen bremser så hardt det er mulig uten å blokkere hjulene, og den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. Vo Ms S V = 0 a ) Tegn kreftene som virker på bilen under oppbremsingen, dersom vi behandler bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) b ) Vis at bilens bremselengde er gitt ved s = ( 4 poeng ) v² 2gμs Den samme bilen kjører så i en nedoverbakke med helningsvinkel O. Bilen bråbremser så hardt det er mulig uten å blokkere hjulene, fra startfart vo til stillestående i løpet av en strekning s. Den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. S μs A v = 0 c ) Tegn kreftene som virker på bilen under oppbremsingen i nedoverbakken, dersom vi ser på bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) d ) Vis at bilens bremselengde i nedoverbakken er gitt ved s = v 2g ( μs cos 0 - sinė ) \" ( 4 poeng ) e ) Dersom bakken blir for bratt, vil det være umulig å stoppe, uansett hvor liten vo er. Hva er den største verdien kan ha for at bilen skal klare å stoppe, dersom friksjonskoeffisienten er us 0,80? ( 4 poeng ) = Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her eller bruk Scantron - ark. Maks poeng: 20 11 En syklist sykler oppover en bakke med helningsvinkel 0 = 10° med konstant fart v = 10 km / h. Farten er såpass lav at luftmotstand kan neglisjeres. Sykkelen med syklisten oppå har en total masse m = 80 kg. Se figuren under. m V Ꮎ Bestem effekten P som syklisten må produsere for å holde en konstant fart oppover bakken. Velg ett alternativ: OP = 0,78 kW OP = 0,078 kW ○ P = 1,4 kW ○ P = 0, 14 kW Р OP = 0,38 kW Maks poeng: 2 12 Denne oppgaven har flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En massiv, homogen sylinder med masse M = 0,50 kg og radius R = 0, 10 m ruller oppover et skråplan med helningsvinkel ẞ = 20°. Sylinderen er ved t = 0 nederst på skråplanet, og da har massesenteret farten vo = 3,0 m / s oppover skråplanet. Den fortsetter å rulle uten å gli oppover skråplanet. Figuren under viser sylinderens posisjon ved tiden t = 0, samt det høyeste punktet der den snur. S snur t = 0 Vo B Vi ser bort fra luftmotstand i hele denne oppgaven. a ) Tegn kreftene som virker på sylinderen når den ruller oppover skråplanet. For full uttelling må alle krefter ha navn og det må være et rimelig størrelsesforhold mellom kreftene. ( 3 poeng ) b ) Vis at absoluttverdien av akselerasjonen til sylinderens massesenter mens den ruller oppover er 2,2 m / s² med retning nedover langs skråplanet. ( 3 poeng ) a = c ) Bestem strekningen s som sylinderen ruller oppover skråplanet før den snur ( se figuren over ) . ( 3 poeng ) d ) Skisser og forklar fartsgrafen, dvs. v ( t ) , for sylinderen når den ruller på skråplanet. Grafen må vise v ( t ) for tidsrommet fra t = 0 til den er tilbake til utgangspunktet. Det kreves ingen eksakt graf med eksplisitte tallverdier, men grafens form må framgå tydelig. ( 3 poeng ) e ) Hvor lang tid tar det fra t = 0 til sylinderen er tilbake til startpunktet ved bunnen av skråplanet? ( 3 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantronark. Maks poeng: 15 13 To massive sylindre med ulike masser og ulike radier ligger i ro på toppen av et skråplan. Den største sylinderen har masse M og radius R, mens den minste sylinderen har masse m < M og radius r < R. De to sylinderne slippes samtidig fra samme høyde, og de ruller begge nedover skråplanet uten å skli. Se figuren under. Hvilken påstand er riktig? Velg ett alternativ: Sylinderen med masse M kommer til bunnen av skråplanet først fordi det virker størst tyngdekraft på denne Sylindrene kommer til bunnen av skråplanet samtidig ettersom massesentrene ( CM ) hele tiden samme fart Sylinderen med masse m kommer til bunnen først fordi denne har lavest treghetsmoment om rotasjonsaksen Sylindrene kommer til bunnen av skråplanet samtidig ettersom sylindrene hele tiden har samme vinkelfart Sylinderen med masse m kommer til bunnen av skråplanet først fordi det virker lavest friksjon på denne Maks poeng: 2 14 Et tannhjul med radius r er forbundet via et stramt kjede med et mindre tannhjul med radius r / 2. Begge tannhjulene roterer om sitt faste sentrum. Når det største tannhjulet roterer med vinkelfart w₁, roterer det minste med vinkelfart w2. Se figuren under. @1 r @2 r / 2 Hva er forholdet mellom vinkelfartene w₂ og w₁ til hhv. det minste og det største tannhjulet? [Hint: alle punkter på kjedet må ha samme lineære fart.] Velg ett alternativ: ○ W2 / W1 ○ W₂ / W1 rac{02}{01} ○ W2 / W1 W2 / W1 = = = = = 12 1 2 1 \\sqrt2 Maks poeng: 2 15 En kloss er festet i en fjær og kan svinge friksjonsfritt på et horisontalt underlag. Klossen slippes med null startfart fra en startamplitude x₁ = A. På figuren under er det indikert fire punkter: x1 = som tilsvarer slapp fjær ) og x4 = - A ( startpunktet ) , x2 = A / 2, x30 ( likevektspunktet - A / 4. m x4 = - A / 4 X3 x3 = 0 likevekts - X₂ = A / 2 X1 = startpunkt X A stilling I hvilket av punktene er absoluttverdien til klossens akselerasjon størst? Velg ett alternativ: X1 X2 x3 X4 Akselerasjonen har samme verdi i alle de fire punktene Maks poeng: 2 16 | Realfagsbygget i Trondheim henger en pendel som kan modelleres som en punktmasse som svinger med små utslag i en masseløs snor. Vi måler perioden til T = 10,0 s. Hva er lengden L til pendelsnora? Velg ett alternativ: L = 98,1 m L = 36,9 m OL = 24,8 m OL = 3,87 m ○ L = 9,81 m Maks poeng: 2 l 17 Hangarskipet USS \"Gerald R. Ford\" har en masse m = 1,0.108 kg. Skipet kan modelleres som en rektangulær kasse med jevn massefordeling og med lengde 7 = 320 m og bredde b = 40 m. Vannet har massetetthet p = 1,0∙ 10³ kg / m³. Se figuren under. h b - - vannlinje Bestem dybden h som skroget stikker ned i vannet ( dvs. den vertikale avstanden mellom vannlinja og bunnen av skroget ) . Velg ett alternativ ○ h = 32 m ○ h = 13 m h = 7,8 m ○ h = 41 m ○ h = 21 m Maks poeng: 2 18 En kraftforsterker består av et bevegelig stempel med sirkulært tverrsnitt og diameter D₁ som er forbundet via en inkompressibel væske med et annet, større stempel med sirkulært tverrsnitt og diameter D2. Når en kraft F1 ( \"input\" ) virker på det minste stempelet, er kraften F2 på det største stempelet ( \"output\" ) . Se figuren under. F2 D2 F₁ 1 D₁ Hva må forholdet mellom diametrene D2 og D1 av stemplene være dersom kraftforsterkeren skal ha en forsterkning på 100 ganger ( dvs. F2 = 100F₁ ) ? Velg ett alternativ: ○ D2 / D₁ = 1,4 ○ D2 / D₁ = \\sqrt\\sqrt2 ○ D2 / D₁ = 10³ D2 / D₁ = 10 ○ D2 / D₁ = 102 Maks poeng: 2 19 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. Et svømmebasseng har rektangulær grunnflate A1 = 10 m x 5,0 m og det er fylt vann i høyde h = 3,0 m over bassengbunnen. Bassenget skal tømmes gjennom et horisontalt rør med sirkulært tverrsnitt og diameter D = 75 mm som ligger i samme dybde som bassengbunnen. Over vannspeilet og ved rørutløpet er det lufttrykk po = 101 kPa. Se figuren under. A₁ Po D h Ро a ) Røret er i utgangspunktet stengt med en ventil. Hvor stort er trykket mot ventilen fra den siden som ligger an mot vannet? ( 2 poeng ) b ) Ventilen åpnes så helt, slik at vann strømmer gjennom røret. Vis at volumstrømmen i røret er 0, 034 m³ / s dersom vi ser bort fra alle former for tap. ( 2 poeng ) c ) Hva blir volumstrømmen dersom det monteres inn en vannmåler som utgjør en enkeltmotstand med tapskoeffisient = 7,0 like ved utløpet, og vi neglisjerer all rørfriksjon? ( 2 poeng ) I de to siste oppgavene skal vi se bort fra alle former for tap. d ) Vanndybden h avtar gradvis etter hvert som bassenget tømmes. La A2 være tverrsnittarealet av røret. Vis eller forklar at h ( t ) er løsningen av differensiallikningen dh A2 d = \\sqrt\\sqrt2gh. [Hint: Endring i bassengvolum per tidsenhet må tilsvare volumstrøm i røret] ( 2 poeng ) dt — e ) Hvis tappingen starter ved t = 0, er løsningen gitt ved ( du behøver IKKE å vise dette for full uttelling ) 2 h ( t ) = h ( 0 ) A2 A1 t Hvor lang tid tar det å tømme bassenget dersom vanndybden ved t = 0 er h ( 0 ) = 3,0 m ? ( 2 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantron - ark. Maks poeng: 10 20 a ) Følgende to sinusformede tversbølger møtes og produserer en stående bølge: = Y₁ ( x,t ) = ( 1,0 m ) sin ( 1,0 m - 1 1 ( 0, Y2 ( x, t ) • x + 1,0 s¹t ) og ( 1,0 m ) sin ( 1, 0 m - 1 • x - 1,0 s¹. t ) . Hva blir den maksimale amplituden A, frekvensen f og bølgelengden for den resulterende stående bølgen? Velg ett alternativ A = 2,0 m, f = 0, 16 Hz, λ = 1,0 m OA = 1,0 m, f = 1,0 Hz, λ = 1,0 m A = 2,0 m, f = 0, 16 Hz, λ = 6,3 m OA = 2,0 m, f = 1,0 Hz, λ = 6,3 m A = 1,0 m, f = 0, 16 Hz, λ = 6,3 m = b ) En pianostreng med lengde L € 2,00 m og lineær massetetthet μ grunnfrekvensen for strengen, som er spent fast i begge ender, blir f1 = = 5,00 g / m skal strammes slik at 65,0 Hz. Hva må snorstrammingen ( \"tension\" ) i strengen være? Velg ett alternativ: FT = 676 N FT = 338 N FT = 3, 38 · 105 N OFT = 1, 30 N OFT 1,30 103 N = Maks poeng: 4",
  "i Institutt for fysikk Eksamensoppgave i IFYKJA1000 Fysikk / kjemi IFYKJG1000 Fysikk / kjemi IFYKJT1000 Fysikk / kjemi VB6104 Fysikk / kjemi Eksamensdato: 15.08.2023 Eksamenstid ( fra - til ) : 09:00 - 14:00 Hjelpemiddelkode / Tillatte hjelpemidler: C / Ingen skriftlige hjelpemidler utover formelarket vedlagt Inspera. Bestemt, enkel kalkulator eller en av følgende kalkulatorer: Casio FX9750, Casio FX9850, Casio FX9860GII ( også SD ) , Casio FXCG20, Casio FXCG50, Texas Instrument 84 Plus. Faglig kontakt under eksamen: Trondheim: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Christian Lauritsen ( kjemi ) : 41 25 06 67 Ålesund: Ben David Normann ( fysikk ) : 73 55 94 rac{59}{93} 84 87 23, Jonas Julius Harang ( kjemi ) : 99 114 520 Gjøvik: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Rolf Alexander Skar ( kjemi ) : 61 13 52 60 Krigsskolen: Per Harald Ninive: 99 587 672 Faglig kontakt møter i eksamenslokalet: NEI ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du ønsker å kontakte faglærer. Noter gjerne spørsmålet ditt på forhånd. InsperaScan: I oppgave [3,5,10,12, 19] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse>>. Vekting av oppgavene: Maksimal poengsum angis i hver oppgave. En oversikt over maksimal poengsum for alle oppgavene finnes i innholdsfortegnelsen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 a ) Finn natrium ( Na ) i periodesystemet, og velg riktig påstand. Periodesystemet er gitt i vedlagt \"Formelark kjemi\". Velg ett alternativ: ○ natrium er et ikke - metall og alle ikke - metaller har 1 elektron i ytterste skall natrium tilhører periode 2 og alle grunnstoff i periode 2 har 2 elektroner i ytterste skall O natrium tilhører gruppe 1 og har 1 elektron i ytterste skall ○ natrium tilhører gruppe 1 og alle grunnstoff i gruppe 1 har 1 elektronskall b ) Hva er elektronkonfigurasjonen til natrium ( Na ) ? Velg ett alternativ 1s²2s22p63s¹ ○ 1s22s22p5 1s22s22p6 1s22s22p63s² 82 c ) Hvor mange nøytroner er det i isotopen 206 Pb? Velg ett alternativ 124 4 82 206 2 d ) Hva er riktig om ionebindinger? Det er ... Velg ett alternativ O bindinger hvor elektroner deles mellom atomer ○ svake tiltrekningskrefter mellom polare molekyl Obindinger mellom ioner med ulik ladning svake tiltrekningskrefter mellom upolare molekyl 2 Balanser reaksjonsligningen ved å skrive inn tallene som mangler. As₂S3 + ( 14 ) NaNO3 + ( 6 ) Na2CO3 → NaNO2 + 6CO2. Maks poeng: 4 ( 2 ) NaзAsO4 + ( 3 ) Na2SO4 + ( 14 ) Maks poeng: 2 3 a ) Beregn følgende i 200 g PbSO4 ( 3 poeng ) : i ) Antall mol PbSО4. ii ) Antall O - atomer. iii ) Antall gram bly ( Pb ) . b ) Propan ( C3H8 ) reagerer med oksygen ( O2 ) og det dannes karbondioksid ( CO2 ) og vann ( H2O ) i henhold til følgende reaksjonsligning: C3H8 ( g ) + 502 ( g ) → 3CO2 ( g ) + 4H2O ( g ) 50,0 g C3H8 ( g ) reagerer med 105,0 g O2 ( g ) . Beregn antall liter CO2 ( g ) som kan bli dannet ved 50°C og 2,0 atm. ( 4 poeng ) Molare masser: = M ( Pb ) 207,2 g / mol = M ( S ) 32,06 g / mol = M ( O ) 16,00 g / mol = M ( C ) 12,01 g / mol M ( H ) = 1,008 g / mol Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 7 4 a ) Gitt følgende likevektsreaksjon ( 1 ) : ( 1 ) 2NO2 ( g ) → N2O4 ( g ) Hva er riktig likevektskonstant, Kc, for reaksjonen? Velg ett alternativ ○ Kc ○ Kc [N204] = [NO2] [NO2]2 = [N2O4] [N2O4] ○ Kc = [NO2] 2 [NO2] ○ Kc = Кс [N2O4] b ) Likevektskonstanten, Kc, for reaksjon ( 1 ) i oppgave a ) er 1, 6. 10² ved 25°C. Likevektskonsentrasjonen av NO2 er 0,0162 mol / L. Hva er likevektskonsentrasjonen av N2O4 i mol / L? Velg ett alternativ 6,10.105 780 1,64.10 - 6 0,00128 ○ 0,0420 2,59 c ) Gitt følgende likevektsreaksjon ( 2 ) : ( 2 ) 2NOCI ( g ) 2NO ( g ) + Cl2 ( g ) En beholder på 1,0 L inneholder 0,500 mol NOCI ( g ) , 0,0500 mol NO ( g ) og 0,0155 mol Cl2 ( g ) . Hva er reaksjonskvotienten, Q? Velg ett alternativ: ○ 1,29 - 104 6451 7,75.10 - 5 ○ 0,00155 1,55.10 - 4 645 d ) Likevektskonstanten, Kc, for reaksjon ( 2 ) i oppgave c ) er 2, 17. 105. I hvilken retning vil reaksjonen gå for å innstille likevekt? Velg ett alternativ mot høyre Okan ikke avgjøres med informasjonen som er gitt ○ den vil ikke forskyves fordi den er ved likevekt mot venstre Maks poeng: 4 5 a ) Beregn løselighetsproduktet, Ksp, til PbCl 2 i rent vann ved 25°C hvis løseligheten er 0,0162 mol / L. ( 3 poeng ) b ) Beregn pH i en 0,010 mol / L HCI - løsning. ( 2 poeng ) c ) Beregn pH i en 0,100 mol / L NaCH3COO - løsning ved 25°C. Syrekonstanten, Ka, til CH3COOH ved 25°C: 1,74.105 ( 3 poeng ) - 5 Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 6 En bestemt elbil oppgis å ha et energiforbruk ved blandet kjøring på 1 kWh / mil. Hva tilsvarer dette i joule per meter: J / m? Oppgitt: 1 kWh = 3,6 106 J, 1 mil = 10 km. Velg ett alternativ: ○ 0,23 kJ / m ○ 1,0 J / m ○ 0,36 kJ / m ○ 1,0 kJ / m ○ 3,6 J / m . Maks poeng: 2 1,2 m / s². Hvor lang tid bruker bilen a ) En bil starter fra ro og akselererer rettlinjet med en akselerasjon a = på å tilbakelegge en strekning på 60 m? Velg ett alternativ: t = 10 s ○ t = 1,2 s Ot = 2,4 s ང O t = 12 s O t = 1,0 s b ) En ball skytes ut fra bakkenivå med startfart vo 10 m / s og utgangsvinkel a = horisontalt, og vi neglisjerer luftmotstand. Se figuren under. = € 30°. Underlaget er Vo α x Beregn avstanden x mellom utgangspunktet og der ballen lander. Velg ett alternativ x = 5,1 m x = 8,8 m x = 18 m x = 4,4 m ○ x = 2,2 m Maks poeng: 4 8 a ) To steiner med samme masse m er festet sammen med en masseløs snor. Steinene slippes fra en høy bygning, og faller loddrett mot jorda uten luftmotstand og uten å rotere slik figuren under viser. m m Avstanden mellom steinene endres ikke under fallet. Hva er snordraget S mens steinene faller? Velg ett alternativ: S = mg S = 0 S = mg S = 3mg S = 2mg b ) Vogna i en berg - og - dal - bane følger en sirkelformet bane ( \"loop\" ) . Vogna er ikke festet til underlaget, men beholder kontakten med underlaget gjennom hele banen. Det virker ikke noen form for friksjon / luftmotstand på vogna. På figuren under er det markert fire punkter i banen: C D ◎ ☐ B A A: Nederste punkt i loopen B: Midtveis til toppen, på vei opp C: Toppunktet D: Midtveis til toppen, på vei ned La N angi normalkrafta fra underlaget på vogna. Hvilken påstand er riktig? Velg ett alternativ ○ N størst i punkt A ON størst i punkt B ON størst i punkt C ON størst i punkt D N har samme verdi i alle fire punktene Maks poeng: 4 9 Figuren under viser fartsgrafen v ( t ) til en stein som slippes fra en høy bygning ved t = ned mot bakken. Etter en viss tid har steinen nådd terminalfarten Umax. Se figuren under. ν 0 og faller vannrett Vmax Hvordan blir den tilsvarende akselerasjonsgrafen for steinen? a a a A C E Velg ett alternativ: A B C D E a a D B Maks poeng: 2 10 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En bil bråbremser fra en startfart v₁ til stillestående på et horisontalt underlag i løpet av en strekning s. Bilen bremser så hardt det er mulig uten å blokkere hjulene, og den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. Vo Ms S V = 0 a ) Tegn kreftene som virker på bilen under oppbremsingen, dersom vi behandler bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) b ) Vis at bilens bremselengde er gitt ved s = ( 4 poeng ) v² 2gμs Den samme bilen kjører så i en nedoverbakke med helningsvinkel O. Bilen bråbremser så hardt det er mulig uten å blokkere hjulene, fra startfart vo til stillestående i løpet av en strekning s. Den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. S μs A v = 0 c ) Tegn kreftene som virker på bilen under oppbremsingen i nedoverbakken, dersom vi ser på bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) d ) Vis at bilens bremselengde i nedoverbakken er gitt ved s = v 2g ( μs cos 0 - sinė ) \" ( 4 poeng ) e ) Dersom bakken blir for bratt, vil det være umulig å stoppe, uansett hvor liten vo er. Hva er den største verdien kan ha for at bilen skal klare å stoppe, dersom friksjonskoeffisienten er us 0,80? ( 4 poeng ) = Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her eller bruk Scantron - ark. Maks poeng: 20 11 En syklist sykler oppover en bakke med helningsvinkel 0 = 10° med konstant fart v = 10 km / h. Farten er såpass lav at luftmotstand kan neglisjeres. Sykkelen med syklisten oppå har en total masse m = 80 kg. Se figuren under. m V Ꮎ Bestem effekten P som syklisten må produsere for å holde en konstant fart oppover bakken. Velg ett alternativ: OP = 0,78 kW OP = 0,078 kW ○ P = 1,4 kW ○ P = 0, 14 kW Р OP = 0,38 kW Maks poeng: 2 12 Denne oppgaven har flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En massiv, homogen sylinder med masse M = 0,50 kg og radius R = 0, 10 m ruller oppover et skråplan med helningsvinkel ẞ = 20°. Sylinderen er ved t = 0 nederst på skråplanet, og da har massesenteret farten vo = 3,0 m / s oppover skråplanet. Den fortsetter å rulle uten å gli oppover skråplanet. Figuren under viser sylinderens posisjon ved tiden t = 0, samt det høyeste punktet der den snur. S snur t = 0 Vo B Vi ser bort fra luftmotstand i hele denne oppgaven. a ) Tegn kreftene som virker på sylinderen når den ruller oppover skråplanet. For full uttelling må alle krefter ha navn og det må være et rimelig størrelsesforhold mellom kreftene. ( 3 poeng ) b ) Vis at absoluttverdien av akselerasjonen til sylinderens massesenter mens den ruller oppover er 2,2 m / s² med retning nedover langs skråplanet. ( 3 poeng ) a = c ) Bestem strekningen s som sylinderen ruller oppover skråplanet før den snur ( se figuren over ) . ( 3 poeng ) d ) Skisser og forklar fartsgrafen, dvs. v ( t ) , for sylinderen når den ruller på skråplanet. Grafen må vise v ( t ) for tidsrommet fra t = 0 til den er tilbake til utgangspunktet. Det kreves ingen eksakt graf med eksplisitte tallverdier, men grafens form må framgå tydelig. ( 3 poeng ) e ) Hvor lang tid tar det fra t = 0 til sylinderen er tilbake til startpunktet ved bunnen av skråplanet? ( 3 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantronark. Maks poeng: 15 13 To massive sylindre med ulike masser og ulike radier ligger i ro på toppen av et skråplan. Den største sylinderen har masse M og radius R, mens den minste sylinderen har masse m < M og radius r < R. De to sylinderne slippes samtidig fra samme høyde, og de ruller begge nedover skråplanet uten å skli. Se figuren under. Hvilken påstand er riktig? Velg ett alternativ: Sylinderen med masse M kommer til bunnen av skråplanet først fordi det virker størst tyngdekraft på denne Sylindrene kommer til bunnen av skråplanet samtidig ettersom massesentrene ( CM ) hele tiden samme fart Sylinderen med masse m kommer til bunnen først fordi denne har lavest treghetsmoment om rotasjonsaksen Sylindrene kommer til bunnen av skråplanet samtidig ettersom sylindrene hele tiden har samme vinkelfart Sylinderen med masse m kommer til bunnen av skråplanet først fordi det virker lavest friksjon på denne Maks poeng: 2 14 Et tannhjul med radius r er forbundet via et stramt kjede med et mindre tannhjul med radius r / 2. Begge tannhjulene roterer om sitt faste sentrum. Når det største tannhjulet roterer med vinkelfart w₁, roterer det minste med vinkelfart w2. Se figuren under. @1 r @2 r / 2 Hva er forholdet mellom vinkelfartene w₂ og w₁ til hhv. det minste og det største tannhjulet? [Hint: alle punkter på kjedet må ha samme lineære fart.] Velg ett alternativ: ○ W2 / W1 ○ W₂ / W1 rac{02}{01} ○ W2 / W1 W2 / W1 = = = = = 12 1 2 1 \\sqrt2 Maks poeng: 2 15 En kloss er festet i en fjær og kan svinge friksjonsfritt på et horisontalt underlag. Klossen slippes med null startfart fra en startamplitude x₁ = A. På figuren under er det indikert fire punkter: x1 = som tilsvarer slapp fjær ) og x4 = - A ( startpunktet ) , x2 = A / 2, x30 ( likevektspunktet - A / 4. m x4 = - A / 4 X3 x3 = 0 likevekts - X₂ = A / 2 X1 = startpunkt X A stilling I hvilket av punktene er absoluttverdien til klossens akselerasjon størst? Velg ett alternativ: X1 X2 x3 X4 Akselerasjonen har samme verdi i alle de fire punktene Maks poeng: 2 16 | Realfagsbygget i Trondheim henger en pendel som kan modelleres som en punktmasse som svinger med små utslag i en masseløs snor. Vi måler perioden til T = 10,0 s. Hva er lengden L til pendelsnora? Velg ett alternativ: L = 98,1 m L = 36,9 m OL = 24,8 m OL = 3,87 m ○ L = 9,81 m Maks poeng: 2 l 17 Hangarskipet USS \"Gerald R. Ford\" har en masse m = 1,0.108 kg. Skipet kan modelleres som en rektangulær kasse med jevn massefordeling og med lengde 7 = 320 m og bredde b = 40 m. Vannet har massetetthet p = 1,0∙ 10³ kg / m³. Se figuren under. h b - - vannlinje Bestem dybden h som skroget stikker ned i vannet ( dvs. den vertikale avstanden mellom vannlinja og bunnen av skroget ) . Velg ett alternativ ○ h = 32 m ○ h = 13 m h = 7,8 m ○ h = 41 m ○ h = 21 m Maks poeng: 2 18 En kraftforsterker består av et bevegelig stempel med sirkulært tverrsnitt og diameter D₁ som er forbundet via en inkompressibel væske med et annet, større stempel med sirkulært tverrsnitt og diameter D2. Når en kraft F1 ( \"input\" ) virker på det minste stempelet, er kraften F2 på det største stempelet ( \"output\" ) . Se figuren under. F2 D2 F₁ 1 D₁ Hva må forholdet mellom diametrene D2 og D1 av stemplene være dersom kraftforsterkeren skal ha en forsterkning på 100 ganger ( dvs. F2 = 100F₁ ) ? Velg ett alternativ: ○ D2 / D₁ = 1,4 ○ D2 / D₁ = \\sqrt\\sqrt2 ○ D2 / D₁ = 10³ D2 / D₁ = 10 ○ D2 / D₁ = 102 Maks poeng: 2 19 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. Et svømmebasseng har rektangulær grunnflate A1 = 10 m x 5,0 m og det er fylt vann i høyde h = 3,0 m over bassengbunnen. Bassenget skal tømmes gjennom et horisontalt rør med sirkulært tverrsnitt og diameter D = 75 mm som ligger i samme dybde som bassengbunnen. Over vannspeilet og ved rørutløpet er det lufttrykk po = 101 kPa. Se figuren under. A₁ Po D h Ро a ) Røret er i utgangspunktet stengt med en ventil. Hvor stort er trykket mot ventilen fra den siden som ligger an mot vannet? ( 2 poeng ) b ) Ventilen åpnes så helt, slik at vann strømmer gjennom røret. Vis at volumstrømmen i røret er 0, 034 m³ / s dersom vi ser bort fra alle former for tap. ( 2 poeng ) c ) Hva blir volumstrømmen dersom det monteres inn en vannmåler som utgjør en enkeltmotstand med tapskoeffisient = 7,0 like ved utløpet, og vi neglisjerer all rørfriksjon? ( 2 poeng ) I de to siste oppgavene skal vi se bort fra alle former for tap. d ) Vanndybden h avtar gradvis etter hvert som bassenget tømmes. La A2 være tverrsnittarealet av røret. Vis eller forklar at h ( t ) er løsningen av differensiallikningen dh A2 d = \\sqrt\\sqrt2gh. [Hint: Endring i bassengvolum per tidsenhet må tilsvare volumstrøm i røret] ( 2 poeng ) dt — e ) Hvis tappingen starter ved t = 0, er løsningen gitt ved ( du behøver IKKE å vise dette for full uttelling ) 2 h ( t ) = h ( 0 ) A2 A1 t Hvor lang tid tar det å tømme bassenget dersom vanndybden ved t = 0 er h ( 0 ) = 3,0 m ? ( 2 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantron - ark. Maks poeng: 10 20 a ) Følgende to sinusformede tversbølger møtes og produserer en stående bølge: = Y₁ ( x,t ) = ( 1,0 m ) sin ( 1,0 m - 1 1 ( 0, Y2 ( x, t ) • x + 1,0 s¹t ) og ( 1,0 m ) sin ( 1, 0 m - 1 • x - 1,0 s¹. t ) . Hva blir den maksimale amplituden A, frekvensen f og bølgelengden for den resulterende stående bølgen? Velg ett alternativ A = 2,0 m, f = 0, 16 Hz, λ = 1,0 m OA = 1,0 m, f = 1,0 Hz, λ = 1,0 m A = 2,0 m, f = 0, 16 Hz, λ = 6,3 m OA = 2,0 m, f = 1,0 Hz, λ = 6,3 m A = 1,0 m, f = 0, 16 Hz, λ = 6,3 m = b ) En pianostreng med lengde L € 2,00 m og lineær massetetthet μ grunnfrekvensen for strengen, som er spent fast i begge ender, blir f1 = = 5,00 g / m skal strammes slik at 65,0 Hz. Hva må snorstrammingen ( \"tension\" ) i strengen være? Velg ett alternativ: FT = 676 N FT = 338 N FT = 3, 38 · 105 N OFT = 1, 30 N OFT 1,30 103 N = Maks poeng: 4",
  "i Institutt for fysikk Eksamensoppgave i IFYKJA1000 Fysikk / kjemi IFYKJG1000 Fysikk / kjemi IFYKJT1000 Fysikk / kjemi VB6104 Fysikk / kjemi Eksamensdato: 15.08.2023 Eksamenstid ( fra - til ) : 09:00 - 14:00 Hjelpemiddelkode / Tillatte hjelpemidler: C / Ingen skriftlige hjelpemidler utover formelarket vedlagt Inspera. Bestemt, enkel kalkulator eller en av følgende kalkulatorer: Casio FX9750, Casio FX9850, Casio FX9860GII ( også SD ) , Casio FXCG20, Casio FXCG50, Texas Instrument 84 Plus. Faglig kontakt under eksamen: Trondheim: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Christian Lauritsen ( kjemi ) : 41 25 06 67 Ålesund: Ben David Normann ( fysikk ) : 73 55 94 rac{59}{93} 84 87 23, Jonas Julius Harang ( kjemi ) : 99 114 520 Gjøvik: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Rolf Alexander Skar ( kjemi ) : 61 13 52 60 Krigsskolen: Per Harald Ninive: 99 587 672 Faglig kontakt møter i eksamenslokalet: NEI ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du ønsker å kontakte faglærer. Noter gjerne spørsmålet ditt på forhånd. InsperaScan: I oppgave [3,5,10,12, 19] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse>>. Vekting av oppgavene: Maksimal poengsum angis i hver oppgave. En oversikt over maksimal poengsum for alle oppgavene finnes i innholdsfortegnelsen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 a ) Finn natrium ( Na ) i periodesystemet, og velg riktig påstand. Periodesystemet er gitt i vedlagt \"Formelark kjemi\". Velg ett alternativ: ○ natrium er et ikke - metall og alle ikke - metaller har 1 elektron i ytterste skall natrium tilhører periode 2 og alle grunnstoff i periode 2 har 2 elektroner i ytterste skall O natrium tilhører gruppe 1 og har 1 elektron i ytterste skall ○ natrium tilhører gruppe 1 og alle grunnstoff i gruppe 1 har 1 elektronskall b ) Hva er elektronkonfigurasjonen til natrium ( Na ) ? Velg ett alternativ 1s²2s22p63s¹ ○ 1s22s22p5 1s22s22p6 1s22s22p63s² 82 c ) Hvor mange nøytroner er det i isotopen 206 Pb? Velg ett alternativ 124 4 82 206 2 d ) Hva er riktig om ionebindinger? Det er ... Velg ett alternativ O bindinger hvor elektroner deles mellom atomer ○ svake tiltrekningskrefter mellom polare molekyl Obindinger mellom ioner med ulik ladning svake tiltrekningskrefter mellom upolare molekyl 2 Balanser reaksjonsligningen ved å skrive inn tallene som mangler. As₂S3 + ( 14 ) NaNO3 + ( 6 ) Na2CO3 → NaNO2 + 6CO2. Maks poeng: 4 ( 2 ) NaзAsO4 + ( 3 ) Na2SO4 + ( 14 ) Maks poeng: 2 3 a ) Beregn følgende i 200 g PbSO4 ( 3 poeng ) : i ) Antall mol PbSО4. ii ) Antall O - atomer. iii ) Antall gram bly ( Pb ) . b ) Propan ( C3H8 ) reagerer med oksygen ( O2 ) og det dannes karbondioksid ( CO2 ) og vann ( H2O ) i henhold til følgende reaksjonsligning: C3H8 ( g ) + 502 ( g ) → 3CO2 ( g ) + 4H2O ( g ) 50,0 g C3H8 ( g ) reagerer med 105,0 g O2 ( g ) . Beregn antall liter CO2 ( g ) som kan bli dannet ved 50°C og 2,0 atm. ( 4 poeng ) Molare masser: = M ( Pb ) 207,2 g / mol = M ( S ) 32,06 g / mol = M ( O ) 16,00 g / mol = M ( C ) 12,01 g / mol M ( H ) = 1,008 g / mol Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 7 4 a ) Gitt følgende likevektsreaksjon ( 1 ) : ( 1 ) 2NO2 ( g ) → N2O4 ( g ) Hva er riktig likevektskonstant, Kc, for reaksjonen? Velg ett alternativ ○ Kc ○ Kc [N204] = [NO2] [NO2]2 = [N2O4] [N2O4] ○ Kc = [NO2] 2 [NO2] ○ Kc = Кс [N2O4] b ) Likevektskonstanten, Kc, for reaksjon ( 1 ) i oppgave a ) er 1, 6. 10² ved 25°C. Likevektskonsentrasjonen av NO2 er 0,0162 mol / L. Hva er likevektskonsentrasjonen av N2O4 i mol / L? Velg ett alternativ 6,10.105 780 1,64.10 - 6 0,00128 ○ 0,0420 2,59 c ) Gitt følgende likevektsreaksjon ( 2 ) : ( 2 ) 2NOCI ( g ) 2NO ( g ) + Cl2 ( g ) En beholder på 1,0 L inneholder 0,500 mol NOCI ( g ) , 0,0500 mol NO ( g ) og 0,0155 mol Cl2 ( g ) . Hva er reaksjonskvotienten, Q? Velg ett alternativ: ○ 1,29 - 104 6451 7,75.10 - 5 ○ 0,00155 1,55.10 - 4 645 d ) Likevektskonstanten, Kc, for reaksjon ( 2 ) i oppgave c ) er 2, 17. 105. I hvilken retning vil reaksjonen gå for å innstille likevekt? Velg ett alternativ mot høyre Okan ikke avgjøres med informasjonen som er gitt ○ den vil ikke forskyves fordi den er ved likevekt mot venstre Maks poeng: 4 5 a ) Beregn løselighetsproduktet, Ksp, til PbCl 2 i rent vann ved 25°C hvis løseligheten er 0,0162 mol / L. ( 3 poeng ) b ) Beregn pH i en 0,010 mol / L HCI - løsning. ( 2 poeng ) c ) Beregn pH i en 0,100 mol / L NaCH3COO - løsning ved 25°C. Syrekonstanten, Ka, til CH3COOH ved 25°C: 1,74.105 ( 3 poeng ) - 5 Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 6 En bestemt elbil oppgis å ha et energiforbruk ved blandet kjøring på 1 kWh / mil. Hva tilsvarer dette i joule per meter: J / m? Oppgitt: 1 kWh = 3,6 106 J, 1 mil = 10 km. Velg ett alternativ: ○ 0,23 kJ / m ○ 1,0 J / m ○ 0,36 kJ / m ○ 1,0 kJ / m ○ 3,6 J / m . Maks poeng: 2 1,2 m / s². Hvor lang tid bruker bilen a ) En bil starter fra ro og akselererer rettlinjet med en akselerasjon a = på å tilbakelegge en strekning på 60 m? Velg ett alternativ: t = 10 s ○ t = 1,2 s Ot = 2,4 s ང O t = 12 s O t = 1,0 s b ) En ball skytes ut fra bakkenivå med startfart vo 10 m / s og utgangsvinkel a = horisontalt, og vi neglisjerer luftmotstand. Se figuren under. = € 30°. Underlaget er Vo α x Beregn avstanden x mellom utgangspunktet og der ballen lander. Velg ett alternativ x = 5,1 m x = 8,8 m x = 18 m x = 4,4 m ○ x = 2,2 m Maks poeng: 4 8 a ) To steiner med samme masse m er festet sammen med en masseløs snor. Steinene slippes fra en høy bygning, og faller loddrett mot jorda uten luftmotstand og uten å rotere slik figuren under viser. m m Avstanden mellom steinene endres ikke under fallet. Hva er snordraget S mens steinene faller? Velg ett alternativ: S = mg S = 0 S = mg S = 3mg S = 2mg b ) Vogna i en berg - og - dal - bane følger en sirkelformet bane ( \"loop\" ) . Vogna er ikke festet til underlaget, men beholder kontakten med underlaget gjennom hele banen. Det virker ikke noen form for friksjon / luftmotstand på vogna. På figuren under er det markert fire punkter i banen: C D ◎ ☐ B A A: Nederste punkt i loopen B: Midtveis til toppen, på vei opp C: Toppunktet D: Midtveis til toppen, på vei ned La N angi normalkrafta fra underlaget på vogna. Hvilken påstand er riktig? Velg ett alternativ ○ N størst i punkt A ON størst i punkt B ON størst i punkt C ON størst i punkt D N har samme verdi i alle fire punktene Maks poeng: 4 9 Figuren under viser fartsgrafen v ( t ) til en stein som slippes fra en høy bygning ved t = ned mot bakken. Etter en viss tid har steinen nådd terminalfarten Umax. Se figuren under. ν 0 og faller vannrett Vmax Hvordan blir den tilsvarende akselerasjonsgrafen for steinen? a a a A C E Velg ett alternativ: A B C D E a a D B Maks poeng: 2 10 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En bil bråbremser fra en startfart v₁ til stillestående på et horisontalt underlag i løpet av en strekning s. Bilen bremser så hardt det er mulig uten å blokkere hjulene, og den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. Vo Ms S V = 0 a ) Tegn kreftene som virker på bilen under oppbremsingen, dersom vi behandler bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) b ) Vis at bilens bremselengde er gitt ved s = ( 4 poeng ) v² 2gμs Den samme bilen kjører så i en nedoverbakke med helningsvinkel O. Bilen bråbremser så hardt det er mulig uten å blokkere hjulene, fra startfart vo til stillestående i løpet av en strekning s. Den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. S μs A v = 0 c ) Tegn kreftene som virker på bilen under oppbremsingen i nedoverbakken, dersom vi ser på bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) d ) Vis at bilens bremselengde i nedoverbakken er gitt ved s = v 2g ( μs cos 0 - sinė ) \" ( 4 poeng ) e ) Dersom bakken blir for bratt, vil det være umulig å stoppe, uansett hvor liten vo er. Hva er den største verdien kan ha for at bilen skal klare å stoppe, dersom friksjonskoeffisienten er us 0,80? ( 4 poeng ) = Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her eller bruk Scantron - ark. Maks poeng: 20 11 En syklist sykler oppover en bakke med helningsvinkel 0 = 10° med konstant fart v = 10 km / h. Farten er såpass lav at luftmotstand kan neglisjeres. Sykkelen med syklisten oppå har en total masse m = 80 kg. Se figuren under. m V Ꮎ Bestem effekten P som syklisten må produsere for å holde en konstant fart oppover bakken. Velg ett alternativ: OP = 0,78 kW OP = 0,078 kW ○ P = 1,4 kW ○ P = 0, 14 kW Р OP = 0,38 kW Maks poeng: 2 12 Denne oppgaven har flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En massiv, homogen sylinder med masse M = 0,50 kg og radius R = 0, 10 m ruller oppover et skråplan med helningsvinkel ẞ = 20°. Sylinderen er ved t = 0 nederst på skråplanet, og da har massesenteret farten vo = 3,0 m / s oppover skråplanet. Den fortsetter å rulle uten å gli oppover skråplanet. Figuren under viser sylinderens posisjon ved tiden t = 0, samt det høyeste punktet der den snur. S snur t = 0 Vo B Vi ser bort fra luftmotstand i hele denne oppgaven. a ) Tegn kreftene som virker på sylinderen når den ruller oppover skråplanet. For full uttelling må alle krefter ha navn og det må være et rimelig størrelsesforhold mellom kreftene. ( 3 poeng ) b ) Vis at absoluttverdien av akselerasjonen til sylinderens massesenter mens den ruller oppover er 2,2 m / s² med retning nedover langs skråplanet. ( 3 poeng ) a = c ) Bestem strekningen s som sylinderen ruller oppover skråplanet før den snur ( se figuren over ) . ( 3 poeng ) d ) Skisser og forklar fartsgrafen, dvs. v ( t ) , for sylinderen når den ruller på skråplanet. Grafen må vise v ( t ) for tidsrommet fra t = 0 til den er tilbake til utgangspunktet. Det kreves ingen eksakt graf med eksplisitte tallverdier, men grafens form må framgå tydelig. ( 3 poeng ) e ) Hvor lang tid tar det fra t = 0 til sylinderen er tilbake til startpunktet ved bunnen av skråplanet? ( 3 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantronark. Maks poeng: 15 13 To massive sylindre med ulike masser og ulike radier ligger i ro på toppen av et skråplan. Den største sylinderen har masse M og radius R, mens den minste sylinderen har masse m < M og radius r < R. De to sylinderne slippes samtidig fra samme høyde, og de ruller begge nedover skråplanet uten å skli. Se figuren under. Hvilken påstand er riktig? Velg ett alternativ: Sylinderen med masse M kommer til bunnen av skråplanet først fordi det virker størst tyngdekraft på denne Sylindrene kommer til bunnen av skråplanet samtidig ettersom massesentrene ( CM ) hele tiden samme fart Sylinderen med masse m kommer til bunnen først fordi denne har lavest treghetsmoment om rotasjonsaksen Sylindrene kommer til bunnen av skråplanet samtidig ettersom sylindrene hele tiden har samme vinkelfart Sylinderen med masse m kommer til bunnen av skråplanet først fordi det virker lavest friksjon på denne Maks poeng: 2 14 Et tannhjul med radius r er forbundet via et stramt kjede med et mindre tannhjul med radius r / 2. Begge tannhjulene roterer om sitt faste sentrum. Når det største tannhjulet roterer med vinkelfart w₁, roterer det minste med vinkelfart w2. Se figuren under. @1 r @2 r / 2 Hva er forholdet mellom vinkelfartene w₂ og w₁ til hhv. det minste og det største tannhjulet? [Hint: alle punkter på kjedet må ha samme lineære fart.] Velg ett alternativ: ○ W2 / W1 ○ W₂ / W1 rac{02}{01} ○ W2 / W1 W2 / W1 = = = = = 12 1 2 1 \\sqrt2 Maks poeng: 2 15 En kloss er festet i en fjær og kan svinge friksjonsfritt på et horisontalt underlag. Klossen slippes med null startfart fra en startamplitude x₁ = A. På figuren under er det indikert fire punkter: x1 = som tilsvarer slapp fjær ) og x4 = - A ( startpunktet ) , x2 = A / 2, x30 ( likevektspunktet - A / 4. m x4 = - A / 4 X3 x3 = 0 likevekts - X₂ = A / 2 X1 = startpunkt X A stilling I hvilket av punktene er absoluttverdien til klossens akselerasjon størst? Velg ett alternativ: X1 X2 x3 X4 Akselerasjonen har samme verdi i alle de fire punktene Maks poeng: 2 16 | Realfagsbygget i Trondheim henger en pendel som kan modelleres som en punktmasse som svinger med små utslag i en masseløs snor. Vi måler perioden til T = 10,0 s. Hva er lengden L til pendelsnora? Velg ett alternativ: L = 98,1 m L = 36,9 m OL = 24,8 m OL = 3,87 m ○ L = 9,81 m Maks poeng: 2 l 17 Hangarskipet USS \"Gerald R. Ford\" har en masse m = 1,0.108 kg. Skipet kan modelleres som en rektangulær kasse med jevn massefordeling og med lengde 7 = 320 m og bredde b = 40 m. Vannet har massetetthet p = 1,0∙ 10³ kg / m³. Se figuren under. h b - - vannlinje Bestem dybden h som skroget stikker ned i vannet ( dvs. den vertikale avstanden mellom vannlinja og bunnen av skroget ) . Velg ett alternativ ○ h = 32 m ○ h = 13 m h = 7,8 m ○ h = 41 m ○ h = 21 m Maks poeng: 2 18 En kraftforsterker består av et bevegelig stempel med sirkulært tverrsnitt og diameter D₁ som er forbundet via en inkompressibel væske med et annet, større stempel med sirkulært tverrsnitt og diameter D2. Når en kraft F1 ( \"input\" ) virker på det minste stempelet, er kraften F2 på det største stempelet ( \"output\" ) . Se figuren under. F2 D2 F₁ 1 D₁ Hva må forholdet mellom diametrene D2 og D1 av stemplene være dersom kraftforsterkeren skal ha en forsterkning på 100 ganger ( dvs. F2 = 100F₁ ) ? Velg ett alternativ: ○ D2 / D₁ = 1,4 ○ D2 / D₁ = \\sqrt\\sqrt2 ○ D2 / D₁ = 10³ D2 / D₁ = 10 ○ D2 / D₁ = 102 Maks poeng: 2 19 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. Et svømmebasseng har rektangulær grunnflate A1 = 10 m x 5,0 m og det er fylt vann i høyde h = 3,0 m over bassengbunnen. Bassenget skal tømmes gjennom et horisontalt rør med sirkulært tverrsnitt og diameter D = 75 mm som ligger i samme dybde som bassengbunnen. Over vannspeilet og ved rørutløpet er det lufttrykk po = 101 kPa. Se figuren under. A₁ Po D h Ро a ) Røret er i utgangspunktet stengt med en ventil. Hvor stort er trykket mot ventilen fra den siden som ligger an mot vannet? ( 2 poeng ) b ) Ventilen åpnes så helt, slik at vann strømmer gjennom røret. Vis at volumstrømmen i røret er 0, 034 m³ / s dersom vi ser bort fra alle former for tap. ( 2 poeng ) c ) Hva blir volumstrømmen dersom det monteres inn en vannmåler som utgjør en enkeltmotstand med tapskoeffisient = 7,0 like ved utløpet, og vi neglisjerer all rørfriksjon? ( 2 poeng ) I de to siste oppgavene skal vi se bort fra alle former for tap. d ) Vanndybden h avtar gradvis etter hvert som bassenget tømmes. La A2 være tverrsnittarealet av røret. Vis eller forklar at h ( t ) er løsningen av differensiallikningen dh A2 d = \\sqrt\\sqrt2gh. [Hint: Endring i bassengvolum per tidsenhet må tilsvare volumstrøm i røret] ( 2 poeng ) dt — e ) Hvis tappingen starter ved t = 0, er løsningen gitt ved ( du behøver IKKE å vise dette for full uttelling ) 2 h ( t ) = h ( 0 ) A2 A1 t Hvor lang tid tar det å tømme bassenget dersom vanndybden ved t = 0 er h ( 0 ) = 3,0 m ? ( 2 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantron - ark. Maks poeng: 10 20 a ) Følgende to sinusformede tversbølger møtes og produserer en stående bølge: = Y₁ ( x,t ) = ( 1,0 m ) sin ( 1,0 m - 1 1 ( 0, Y2 ( x, t ) • x + 1,0 s¹t ) og ( 1,0 m ) sin ( 1, 0 m - 1 • x - 1,0 s¹. t ) . Hva blir den maksimale amplituden A, frekvensen f og bølgelengden for den resulterende stående bølgen? Velg ett alternativ A = 2,0 m, f = 0, 16 Hz, λ = 1,0 m OA = 1,0 m, f = 1,0 Hz, λ = 1,0 m A = 2,0 m, f = 0, 16 Hz, λ = 6,3 m OA = 2,0 m, f = 1,0 Hz, λ = 6,3 m A = 1,0 m, f = 0, 16 Hz, λ = 6,3 m = b ) En pianostreng med lengde L € 2,00 m og lineær massetetthet μ grunnfrekvensen for strengen, som er spent fast i begge ender, blir f1 = = 5,00 g / m skal strammes slik at 65,0 Hz. Hva må snorstrammingen ( \"tension\" ) i strengen være? Velg ett alternativ: FT = 676 N FT = 338 N FT = 3, 38 · 105 N OFT = 1, 30 N OFT 1,30 103 N = Maks poeng: 4",
  "i Institutt for fysikk Eksamensoppgave i IFYKJA1000 Fysikk / kjemi IFYKJG1000 Fysikk / kjemi IFYKJT1000 Fysikk / kjemi VB6104 Fysikk / kjemi Eksamensdato: 15.08.2023 Eksamenstid ( fra - til ) : 09:00 - 14:00 Hjelpemiddelkode / Tillatte hjelpemidler: C / Ingen skriftlige hjelpemidler utover formelarket vedlagt Inspera. Bestemt, enkel kalkulator eller en av følgende kalkulatorer: Casio FX9750, Casio FX9850, Casio FX9860GII ( også SD ) , Casio FXCG20, Casio FXCG50, Texas Instrument 84 Plus. Faglig kontakt under eksamen: Trondheim: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Christian Lauritsen ( kjemi ) : 41 25 06 67 Ålesund: Ben David Normann ( fysikk ) : 73 55 94 rac{59}{93} 84 87 23, Jonas Julius Harang ( kjemi ) : 99 114 520 Gjøvik: Knut B. Rolstad ( fysikk ) : 73 55 92 rac{03}{99} 444 263, Rolf Alexander Skar ( kjemi ) : 61 13 52 60 Krigsskolen: Per Harald Ninive: 99 587 672 Faglig kontakt møter i eksamenslokalet: NEI ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du ønsker å kontakte faglærer. Noter gjerne spørsmålet ditt på forhånd. InsperaScan: I oppgave [3,5,10,12, 19] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse>>. Vekting av oppgavene: Maksimal poengsum angis i hver oppgave. En oversikt over maksimal poengsum for alle oppgavene finnes i innholdsfortegnelsen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 a ) Finn natrium ( Na ) i periodesystemet, og velg riktig påstand. Periodesystemet er gitt i vedlagt \"Formelark kjemi\". Velg ett alternativ: ○ natrium er et ikke - metall og alle ikke - metaller har 1 elektron i ytterste skall natrium tilhører periode 2 og alle grunnstoff i periode 2 har 2 elektroner i ytterste skall O natrium tilhører gruppe 1 og har 1 elektron i ytterste skall ○ natrium tilhører gruppe 1 og alle grunnstoff i gruppe 1 har 1 elektronskall b ) Hva er elektronkonfigurasjonen til natrium ( Na ) ? Velg ett alternativ 1s²2s22p63s¹ ○ 1s22s22p5 1s22s22p6 1s22s22p63s² 82 c ) Hvor mange nøytroner er det i isotopen 206 Pb? Velg ett alternativ 124 4 82 206 2 d ) Hva er riktig om ionebindinger? Det er ... Velg ett alternativ O bindinger hvor elektroner deles mellom atomer ○ svake tiltrekningskrefter mellom polare molekyl Obindinger mellom ioner med ulik ladning svake tiltrekningskrefter mellom upolare molekyl 2 Balanser reaksjonsligningen ved å skrive inn tallene som mangler. As₂S3 + ( 14 ) NaNO3 + ( 6 ) Na2CO3 → NaNO2 + 6CO2. Maks poeng: 4 ( 2 ) NaзAsO4 + ( 3 ) Na2SO4 + ( 14 ) Maks poeng: 2 3 a ) Beregn følgende i 200 g PbSO4 ( 3 poeng ) : i ) Antall mol PbSО4. ii ) Antall O - atomer. iii ) Antall gram bly ( Pb ) . b ) Propan ( C3H8 ) reagerer med oksygen ( O2 ) og det dannes karbondioksid ( CO2 ) og vann ( H2O ) i henhold til følgende reaksjonsligning: C3H8 ( g ) + 502 ( g ) → 3CO2 ( g ) + 4H2O ( g ) 50,0 g C3H8 ( g ) reagerer med 105,0 g O2 ( g ) . Beregn antall liter CO2 ( g ) som kan bli dannet ved 50°C og 2,0 atm. ( 4 poeng ) Molare masser: = M ( Pb ) 207,2 g / mol = M ( S ) 32,06 g / mol = M ( O ) 16,00 g / mol = M ( C ) 12,01 g / mol M ( H ) = 1,008 g / mol Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 7 4 a ) Gitt følgende likevektsreaksjon ( 1 ) : ( 1 ) 2NO2 ( g ) → N2O4 ( g ) Hva er riktig likevektskonstant, Kc, for reaksjonen? Velg ett alternativ ○ Kc ○ Kc [N204] = [NO2] [NO2]2 = [N2O4] [N2O4] ○ Kc = [NO2] 2 [NO2] ○ Kc = Кс [N2O4] b ) Likevektskonstanten, Kc, for reaksjon ( 1 ) i oppgave a ) er 1, 6. 10² ved 25°C. Likevektskonsentrasjonen av NO2 er 0,0162 mol / L. Hva er likevektskonsentrasjonen av N2O4 i mol / L? Velg ett alternativ 6,10.105 780 1,64.10 - 6 0,00128 ○ 0,0420 2,59 c ) Gitt følgende likevektsreaksjon ( 2 ) : ( 2 ) 2NOCI ( g ) 2NO ( g ) + Cl2 ( g ) En beholder på 1,0 L inneholder 0,500 mol NOCI ( g ) , 0,0500 mol NO ( g ) og 0,0155 mol Cl2 ( g ) . Hva er reaksjonskvotienten, Q? Velg ett alternativ: ○ 1,29 - 104 6451 7,75.10 - 5 ○ 0,00155 1,55.10 - 4 645 d ) Likevektskonstanten, Kc, for reaksjon ( 2 ) i oppgave c ) er 2, 17. 105. I hvilken retning vil reaksjonen gå for å innstille likevekt? Velg ett alternativ mot høyre Okan ikke avgjøres med informasjonen som er gitt ○ den vil ikke forskyves fordi den er ved likevekt mot venstre Maks poeng: 4 5 a ) Beregn løselighetsproduktet, Ksp, til PbCl 2 i rent vann ved 25°C hvis løseligheten er 0,0162 mol / L. ( 3 poeng ) b ) Beregn pH i en 0,010 mol / L HCI - løsning. ( 2 poeng ) c ) Beregn pH i en 0,100 mol / L NaCH3COO - løsning ved 25°C. Syrekonstanten, Ka, til CH3COOH ved 25°C: 1,74.105 ( 3 poeng ) - 5 Denne oppgaven skal besvares i tekstboksen under, eller ved bruk av scantronark. Skriv ditt svar her, eller bruk scantronark. Maks poeng: 6 En bestemt elbil oppgis å ha et energiforbruk ved blandet kjøring på 1 kWh / mil. Hva tilsvarer dette i joule per meter: J / m? Oppgitt: 1 kWh = 3,6 106 J, 1 mil = 10 km. Velg ett alternativ: ○ 0,23 kJ / m ○ 1,0 J / m ○ 0,36 kJ / m ○ 1,0 kJ / m ○ 3,6 J / m . Maks poeng: 2 1,2 m / s². Hvor lang tid bruker bilen a ) En bil starter fra ro og akselererer rettlinjet med en akselerasjon a = på å tilbakelegge en strekning på 60 m? Velg ett alternativ: t = 10 s ○ t = 1,2 s Ot = 2,4 s ང O t = 12 s O t = 1,0 s b ) En ball skytes ut fra bakkenivå med startfart vo 10 m / s og utgangsvinkel a = horisontalt, og vi neglisjerer luftmotstand. Se figuren under. = € 30°. Underlaget er Vo α x Beregn avstanden x mellom utgangspunktet og der ballen lander. Velg ett alternativ x = 5,1 m x = 8,8 m x = 18 m x = 4,4 m ○ x = 2,2 m Maks poeng: 4 8 a ) To steiner med samme masse m er festet sammen med en masseløs snor. Steinene slippes fra en høy bygning, og faller loddrett mot jorda uten luftmotstand og uten å rotere slik figuren under viser. m m Avstanden mellom steinene endres ikke under fallet. Hva er snordraget S mens steinene faller? Velg ett alternativ: S = mg S = 0 S = mg S = 3mg S = 2mg b ) Vogna i en berg - og - dal - bane følger en sirkelformet bane ( \"loop\" ) . Vogna er ikke festet til underlaget, men beholder kontakten med underlaget gjennom hele banen. Det virker ikke noen form for friksjon / luftmotstand på vogna. På figuren under er det markert fire punkter i banen: C D ◎ ☐ B A A: Nederste punkt i loopen B: Midtveis til toppen, på vei opp C: Toppunktet D: Midtveis til toppen, på vei ned La N angi normalkrafta fra underlaget på vogna. Hvilken påstand er riktig? Velg ett alternativ ○ N størst i punkt A ON størst i punkt B ON størst i punkt C ON størst i punkt D N har samme verdi i alle fire punktene Maks poeng: 4 9 Figuren under viser fartsgrafen v ( t ) til en stein som slippes fra en høy bygning ved t = ned mot bakken. Etter en viss tid har steinen nådd terminalfarten Umax. Se figuren under. ν 0 og faller vannrett Vmax Hvordan blir den tilsvarende akselerasjonsgrafen for steinen? a a a A C E Velg ett alternativ: A B C D E a a D B Maks poeng: 2 10 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En bil bråbremser fra en startfart v₁ til stillestående på et horisontalt underlag i løpet av en strekning s. Bilen bremser så hardt det er mulig uten å blokkere hjulene, og den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. Vo Ms S V = 0 a ) Tegn kreftene som virker på bilen under oppbremsingen, dersom vi behandler bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) b ) Vis at bilens bremselengde er gitt ved s = ( 4 poeng ) v² 2gμs Den samme bilen kjører så i en nedoverbakke med helningsvinkel O. Bilen bråbremser så hardt det er mulig uten å blokkere hjulene, fra startfart vo til stillestående i løpet av en strekning s. Den statiske friksjonskoeffisienten mellom dekkene og underlaget er μs. Se figuren under. S μs A v = 0 c ) Tegn kreftene som virker på bilen under oppbremsingen i nedoverbakken, dersom vi ser på bilen som en \"kloss\". For full uttelling må det være et rimelig størrelsesforhold mellom kreftene, og alle kreftene må ha navn. ( 4 poeng ) d ) Vis at bilens bremselengde i nedoverbakken er gitt ved s = v 2g ( μs cos 0 - sinė ) \" ( 4 poeng ) e ) Dersom bakken blir for bratt, vil det være umulig å stoppe, uansett hvor liten vo er. Hva er den største verdien kan ha for at bilen skal klare å stoppe, dersom friksjonskoeffisienten er us 0,80? ( 4 poeng ) = Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her eller bruk Scantron - ark. Maks poeng: 20 11 En syklist sykler oppover en bakke med helningsvinkel 0 = 10° med konstant fart v = 10 km / h. Farten er såpass lav at luftmotstand kan neglisjeres. Sykkelen med syklisten oppå har en total masse m = 80 kg. Se figuren under. m V Ꮎ Bestem effekten P som syklisten må produsere for å holde en konstant fart oppover bakken. Velg ett alternativ: OP = 0,78 kW OP = 0,078 kW ○ P = 1,4 kW ○ P = 0, 14 kW Р OP = 0,38 kW Maks poeng: 2 12 Denne oppgaven har flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. En massiv, homogen sylinder med masse M = 0,50 kg og radius R = 0, 10 m ruller oppover et skråplan med helningsvinkel ẞ = 20°. Sylinderen er ved t = 0 nederst på skråplanet, og da har massesenteret farten vo = 3,0 m / s oppover skråplanet. Den fortsetter å rulle uten å gli oppover skråplanet. Figuren under viser sylinderens posisjon ved tiden t = 0, samt det høyeste punktet der den snur. S snur t = 0 Vo B Vi ser bort fra luftmotstand i hele denne oppgaven. a ) Tegn kreftene som virker på sylinderen når den ruller oppover skråplanet. For full uttelling må alle krefter ha navn og det må være et rimelig størrelsesforhold mellom kreftene. ( 3 poeng ) b ) Vis at absoluttverdien av akselerasjonen til sylinderens massesenter mens den ruller oppover er 2,2 m / s² med retning nedover langs skråplanet. ( 3 poeng ) a = c ) Bestem strekningen s som sylinderen ruller oppover skråplanet før den snur ( se figuren over ) . ( 3 poeng ) d ) Skisser og forklar fartsgrafen, dvs. v ( t ) , for sylinderen når den ruller på skråplanet. Grafen må vise v ( t ) for tidsrommet fra t = 0 til den er tilbake til utgangspunktet. Det kreves ingen eksakt graf med eksplisitte tallverdier, men grafens form må framgå tydelig. ( 3 poeng ) e ) Hvor lang tid tar det fra t = 0 til sylinderen er tilbake til startpunktet ved bunnen av skråplanet? ( 3 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantronark. Maks poeng: 15 13 To massive sylindre med ulike masser og ulike radier ligger i ro på toppen av et skråplan. Den største sylinderen har masse M og radius R, mens den minste sylinderen har masse m < M og radius r < R. De to sylinderne slippes samtidig fra samme høyde, og de ruller begge nedover skråplanet uten å skli. Se figuren under. Hvilken påstand er riktig? Velg ett alternativ: Sylinderen med masse M kommer til bunnen av skråplanet først fordi det virker størst tyngdekraft på denne Sylindrene kommer til bunnen av skråplanet samtidig ettersom massesentrene ( CM ) hele tiden samme fart Sylinderen med masse m kommer til bunnen først fordi denne har lavest treghetsmoment om rotasjonsaksen Sylindrene kommer til bunnen av skråplanet samtidig ettersom sylindrene hele tiden har samme vinkelfart Sylinderen med masse m kommer til bunnen av skråplanet først fordi det virker lavest friksjon på denne Maks poeng: 2 14 Et tannhjul med radius r er forbundet via et stramt kjede med et mindre tannhjul med radius r / 2. Begge tannhjulene roterer om sitt faste sentrum. Når det største tannhjulet roterer med vinkelfart w₁, roterer det minste med vinkelfart w2. Se figuren under. @1 r @2 r / 2 Hva er forholdet mellom vinkelfartene w₂ og w₁ til hhv. det minste og det største tannhjulet? [Hint: alle punkter på kjedet må ha samme lineære fart.] Velg ett alternativ: ○ W2 / W1 ○ W₂ / W1 rac{02}{01} ○ W2 / W1 W2 / W1 = = = = = 12 1 2 1 \\sqrt2 Maks poeng: 2 15 En kloss er festet i en fjær og kan svinge friksjonsfritt på et horisontalt underlag. Klossen slippes med null startfart fra en startamplitude x₁ = A. På figuren under er det indikert fire punkter: x1 = som tilsvarer slapp fjær ) og x4 = - A ( startpunktet ) , x2 = A / 2, x30 ( likevektspunktet - A / 4. m x4 = - A / 4 X3 x3 = 0 likevekts - X₂ = A / 2 X1 = startpunkt X A stilling I hvilket av punktene er absoluttverdien til klossens akselerasjon størst? Velg ett alternativ: X1 X2 x3 X4 Akselerasjonen har samme verdi i alle de fire punktene Maks poeng: 2 16 | Realfagsbygget i Trondheim henger en pendel som kan modelleres som en punktmasse som svinger med små utslag i en masseløs snor. Vi måler perioden til T = 10,0 s. Hva er lengden L til pendelsnora? Velg ett alternativ: L = 98,1 m L = 36,9 m OL = 24,8 m OL = 3,87 m ○ L = 9,81 m Maks poeng: 2 l 17 Hangarskipet USS \"Gerald R. Ford\" har en masse m = 1,0.108 kg. Skipet kan modelleres som en rektangulær kasse med jevn massefordeling og med lengde 7 = 320 m og bredde b = 40 m. Vannet har massetetthet p = 1,0∙ 10³ kg / m³. Se figuren under. h b - - vannlinje Bestem dybden h som skroget stikker ned i vannet ( dvs. den vertikale avstanden mellom vannlinja og bunnen av skroget ) . Velg ett alternativ ○ h = 32 m ○ h = 13 m h = 7,8 m ○ h = 41 m ○ h = 21 m Maks poeng: 2 18 En kraftforsterker består av et bevegelig stempel med sirkulært tverrsnitt og diameter D₁ som er forbundet via en inkompressibel væske med et annet, større stempel med sirkulært tverrsnitt og diameter D2. Når en kraft F1 ( \"input\" ) virker på det minste stempelet, er kraften F2 på det største stempelet ( \"output\" ) . Se figuren under. F2 D2 F₁ 1 D₁ Hva må forholdet mellom diametrene D2 og D1 av stemplene være dersom kraftforsterkeren skal ha en forsterkning på 100 ganger ( dvs. F2 = 100F₁ ) ? Velg ett alternativ: ○ D2 / D₁ = 1,4 ○ D2 / D₁ = \\sqrt\\sqrt2 ○ D2 / D₁ = 10³ D2 / D₁ = 10 ○ D2 / D₁ = 102 Maks poeng: 2 19 Denne oppgaven inneholder flere deloppgaver som omhandler samme problemstilling, men som kan besvares uavhengig av hverandre. Et svømmebasseng har rektangulær grunnflate A1 = 10 m x 5,0 m og det er fylt vann i høyde h = 3,0 m over bassengbunnen. Bassenget skal tømmes gjennom et horisontalt rør med sirkulært tverrsnitt og diameter D = 75 mm som ligger i samme dybde som bassengbunnen. Over vannspeilet og ved rørutløpet er det lufttrykk po = 101 kPa. Se figuren under. A₁ Po D h Ро a ) Røret er i utgangspunktet stengt med en ventil. Hvor stort er trykket mot ventilen fra den siden som ligger an mot vannet? ( 2 poeng ) b ) Ventilen åpnes så helt, slik at vann strømmer gjennom røret. Vis at volumstrømmen i røret er 0, 034 m³ / s dersom vi ser bort fra alle former for tap. ( 2 poeng ) c ) Hva blir volumstrømmen dersom det monteres inn en vannmåler som utgjør en enkeltmotstand med tapskoeffisient = 7,0 like ved utløpet, og vi neglisjerer all rørfriksjon? ( 2 poeng ) I de to siste oppgavene skal vi se bort fra alle former for tap. d ) Vanndybden h avtar gradvis etter hvert som bassenget tømmes. La A2 være tverrsnittarealet av røret. Vis eller forklar at h ( t ) er løsningen av differensiallikningen dh A2 d = \\sqrt\\sqrt2gh. [Hint: Endring i bassengvolum per tidsenhet må tilsvare volumstrøm i røret] ( 2 poeng ) dt — e ) Hvis tappingen starter ved t = 0, er løsningen gitt ved ( du behøver IKKE å vise dette for full uttelling ) 2 h ( t ) = h ( 0 ) A2 A1 t Hvor lang tid tar det å tømme bassenget dersom vanndybden ved t = 0 er h ( 0 ) = 3,0 m ? ( 2 poeng ) Du kan skrive svaret i boksen under, eller skrive på Scantronark som leveres for innskanning. Vi anbefaler bruk av Scantron - ark. Skriv ditt svar her, eller bruk Scantron - ark. Maks poeng: 10 20 a ) Følgende to sinusformede tversbølger møtes og produserer en stående bølge: = Y₁ ( x,t ) = ( 1,0 m ) sin ( 1,0 m - 1 1 ( 0, Y2 ( x, t ) • x + 1,0 s¹t ) og ( 1,0 m ) sin ( 1, 0 m - 1 • x - 1,0 s¹. t ) . Hva blir den maksimale amplituden A, frekvensen f og bølgelengden for den resulterende stående bølgen? Velg ett alternativ A = 2,0 m, f = 0, 16 Hz, λ = 1,0 m OA = 1,0 m, f = 1,0 Hz, λ = 1,0 m A = 2,0 m, f = 0, 16 Hz, λ = 6,3 m OA = 2,0 m, f = 1,0 Hz, λ = 6,3 m A = 1,0 m, f = 0, 16 Hz, λ = 6,3 m = b ) En pianostreng med lengde L € 2,00 m og lineær massetetthet μ grunnfrekvensen for strengen, som er spent fast i begge ender, blir f1 = = 5,00 g / m skal strammes slik at 65,0 Hz. Hva må snorstrammingen ( \"tension\" ) i strengen være? Velg ett alternativ: FT = 676 N FT = 338 N FT = 3, 38 · 105 N OFT = 1, 30 N OFT 1,30 103 N = Maks poeng: 4"
]