[
  "IMAX1002 utsatt eksamen S2024 i Forside Institutt for matematiske fag Utsatt eksamen i IMAA1002, IMAG1002 og IMAT1002 Matematikk for ingeniørfag 1 Eksamensdato: 07.08.2024 Eksamenstid ( fra - til ) : 09:00 - 13:00 Hjelpemiddelkode / Tillatte hjelpemidler: C: Spesifiserte trykte og håndskrevne hjelpemidler tillatt. Bestemt, enkel kalkulator tillatt. Vi spesifiserer at ingen trykte eller håndskrevne hjelpemidler er tillatt, med unntak av det vedlagte formelarket. Tillatte kalkulatorer: • Casio FX - 82CW, Casio FC100 V2, Casio fx - 82ES PLUS og Casio fx - 82EX • Citizen SR - 270X og Citizen SR - 270X College • Hewlett Packard HP30S Faglig kontakt under eksamen: Anders Oulie Mobil: 414 33 354, kontor: 611 35201 Faglig kontakt møter i eksamenslokalet: Nei ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson skal kun kontaktes dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter gjerne spørsmålet ditt på forhånd. Håndtegninger: I oppgave 1, 2, 8 og 14 er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «Vis besvarelse». Vekting av oppgavene: Det er mulig å oppnå totalt 100 poeng. Oppgave 3 og 4 gir maksimalt 5 poeng. Oppgave 5 gir maksimalt 2 poeng. Oppgave 6, 7 og 13 gir maksimalt 4 poeng. Oppgave 9 gir maksimalt 6 poeng. rac{1}{15} IMAX1002 utsatt eksamen S2024 Resten av oppgavene gir maksimalt 10 poeng hver. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til “hamburgermenyen\" i øvre høyre hjørne og velg «<Lever blankt». Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. 1 Oppgave 1 Denne oppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. Løs det lineære likningssystemet ved Gausseliminasjon. x1 x2 x3 + x12x2x3 2x13x24x3 = = = 1 2 2 Maks poeng: 10 2 Oppgave 2 Denne deloppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. cos - sin 0 En lineær transformasjon er gitt ved T ( x ) = A ( 0 ) ã, hvor A ( 0 ) = sin 0 cos Transformasjonen medfører at vektoren & roteres en vinkel 0 mot klokka ( dersom 0 > 0 ) . Finn inversmatrisen, A - 1 ( 0 ) . Maks poeng: 10 rac{2}{15} 3 Oppgave 3 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 3 La A = og B = 2 4 - 2 [] Regn ut matriseproduktet AT B. ATB = 4 Oppgave 4 Maks poeng: 5 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Mengdene S = {8.8 ) og B = 1 2 {3}·}]} er begge basiser for R². 5 Førstnevnte ( S ) kalles gjerne standardbasis. 4 La v = B skrevet i standardbasisen S . Hva blir koordinatene til vektoren i basisen B? Maks poeng: 5 rac{3}{15} IMAX1002 utsatt eksamen S2024 5 Oppgave 5 Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vektorlikningen 2 x11x21 + x32x43 1 0 4 = - 8 3 2 kan skrives om som en matriselikning Ax = 0. Finn matrise A. A = = Maks poeng: 2 rac{4}{15} 6 Oppgave 6 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Finn en basis for nullrommet til det homogene likningssystemet som tilsvarer vektorlikningen 4 2 1 + x3 2x4 3 x11x21x32 1 0 3 2 0 = 0 0 Merk! Dette er samme likningssettet som i oppgave 5. Velg alle vektorene som til sammen danner en basis for nullrommet. rac{5}{15} Velg ett eller flere alternativer 2 1 1 2 3 1 1 0 0 0 0 0 1 1 1 2 1 1 1 3 1 1 0 IMAX1002 utsatt eksamen S2024 I denne deloppgaven får du trekk i poeng dersom du velger vektorer som ikke hører til basisen, men det er ikke mulig å få mindre enn 0 poeng totalt på oppgaven. Maks poeng: 4 rac{6}{15} 7 Oppgave 7 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. I oppgave 5 har du skrevet vektorlikningen 1 2 1 4 x11x21 + x32x4 3 0 3 2 0 = 0 0 om til en matriselikning Ax = 0. Finn en basis for kolonnerommet til A. Obs! Det kan være flere riktige svar. rac{7}{15} Velg ett eller flere alternativer 2 3 , 4 3 2 1 2 1 {A∙A} 1 1 2 1 2 {8 - 8 - 9 ) } 2 {B}} 3 {B}} 3 1 2 1 4 1 2 3 3 2 1 2 {8 - 6 - 8 ) 1 3 2 ( 8 - 6 ) 3 3 2 IMAX1002 utsatt eksamen S2024 I denne deloppgaven får du trekk i poeng dersom du velger et sett som ikke utgjør en basis for kolonnerommet, men det er ikke mulig å få mindre enn 0 poeng totalt på oppgaven. Maks poeng: 4 rac{8}{15} 8 Oppgave 8 IMAX1002 utsatt eksamen S2024 Denne deloppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. La z = 2e i 1 ) Tegn et punkt som representerer z i det komplekse planet. 2 ) Identifiser modulusen og argumentet til z. 3 ) Skriv z på polarform. 4 ) Skriv z på normalform, dvs, på formen a + bi. 5 ) Regn ut 24. Maks poeng: 10 rac{9}{15} 9 Oppgave 9 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. La z = 3 - 2i og w = 2 + i være to komplekse tall. 1 ) Regn ut z⚫ w og oppgi svaret på normalform, dvs a + bi. Oppgi svar korrekt avrundet til 1 desimal. 2.W = + i. พ 2 ) Regn ut og oppgi svaret på normalform, dvs a + bi. Oppgi svar korrekt avrundet til 1 desimal. EN = + نے. 3 ) Regn ut ( z + w ) . Z og oppgi svaret på normalform, dvs a + bi. Oppgi svar korrekt avrundet til 1 desimal. ( z + w ) · z = • + i. Notasjon: Zer det komplekse konjugatet til z. Maks poeng: 6 rac{10}{15} IMAX1002 utsatt eksamen S2024 10 Oppgave 10 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 ) Finn den generelle løsningen til den følgende differensiallikningen: y' - y² sin ( x ) = 0. Velg ett alternativ ○ y ( x ) = cos ( x ) + C ○ g ( r ) = x cos ( x ) + C 1 y ( x ) = — sin ( x ) + C ○ y ( x ) = x sin x + C ○ y ( x ) = - sin ( x ) + C - y ( x ) = = cos ( x ) + C 1 ○ y ( x ) = = sin ( x ) + C Y ( r ) 1 y ( x ) = cos ( x ) + C 2 ) Differensiallikningen xy' - 2y = x² har den generelle løsningen y ( x ) = x² ( ln ( x ) + C ) . Løs initialverdiproblemet xy' – 2y = x², y ( 1 ) = 0. rac{11}{15} Velg ett alternativ ○ y ( x ) = x² ( ln ( x ) + 3 ) y ( x ) = x² ( ln ( x ) + 2 ) ○ y ( x ) = x² ( ln ( x ) – 3 ) y ( x ) = x² ( In ( x ) + 1 ) ○ y ( x ) = x² ( ln ( x ) ) ○ y ( x ) = x² ( ln ( x ) — 1 ) - ○ y ( x ) = x² ( ln ( x ) — 2 ) IMAX1002 utsatt eksamen S2024 Maks poeng: 10 rac{12}{15} IMAX1002 utsatt eksamen S2024 11 Oppgave 11 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 ) Finn den generelle løsningen til den følgende differensiallikningen: Velg ett alternativ: C₁e - \\sqrt3x + C2e2 ○ C₁e + C2xe \\sqrt\\sqrt3e ( C₁ cos ( x ) + C2 sin ( x ) ) ○ C₁е¯x + C 2е² ○ C₁e¯ + C2e C₁e\\sqrt3x + C2xе\\sqrt3x ○ e²x ( C₁ cos ( x ) + C2 sin ( x ) ) e / 3x ( C₁ cos ( x ) + C2 sin ( x ) ) ex ( C₁ cos ( x ) + C2 sin ( 2x ) ) y\" — 2y' + 4y = 0. - ex * ( C₁ cos ( \\sqrt3x ) + C2 sin ( \\sqrt3x ) ) - 2 ) Differensiallikningen y\" - 2y' – 3 = 0 har den generelle løsningen y løsningen til det følgende initialverdiproblemet: = C₁e C2e. Finn y\" — 2y' – 3 = 0, y ( 0 ) = 1, y' ( 0 ) = 1. rac{13}{15} Velg ett alternativ ○ y ( x ) = - e³x + e - e3x ex 3x ○ y ( x ) = 1½ ½³ imes³ imes + e¯ * ○ y ( x ) = - e³x + ○ y ( x ) = e³x + 2e¯x ○ y ( x ) = 2e³x + e¯x ○ y ( x ) = e³x + ex 3x ○ y ( x ) = ½½ e³ imes + ½е X IMAX1002 utsatt eksamen S2024 Maks poeng: 10 12 Oppgave 12 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. 1 1 ) Er v = 1 }] - 3 - 12 2 2 en egenvektor til A = 0 - 2 0? Hvis ja, med hvilken egenverdi? - 4 9 3 Skriv inn - 555 dersom v ikke er en egenvektor til A, og skriv inn tilhørende egenverdi ellers. 入 = 2 3 - 12 2 2 ) Er w = 1 en egenvektor til A = 0 - 2 0 ? Hvis ja, med hvilken egenverdi? 1 4 9 3 Skriv inn - 555 dersom w ikke er en egenvektor til A, og skriv inn tilhørende egenverdi ellers. λ = Maks poeng: 10 rac{14}{15} 13 Oppgave 13 IMAX1002 utsatt eksamen S2024 Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vi vet at v er en egenvektor til matrisen A med tilhørende egenverdi - 1, og at w er en egenvektor til matrisen A med tilhørende egenverdi 2. • 1 ) Uttrykket 3 Av + 2Aw kan forenkles til k₁ · + k₂ · w, hvor k₁ og k₂ er heltall. Finn verdien til k₁ og k2. k1 = k2 = 2 ) Uttrykket 744 - A² kan også forenkles til m₁ + m² · w, hvor m₁og m2 er heltall. Finn verdien til m₁ og m2. • • m1 = ' m2 = 14 Oppgave 14 Denne deloppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. Diagonaliser den følgende matrisen: 2 1 01 A = 0 1 3 0 0 2 dvs finn en inverterbar matrise C og en diagonal matrise D slik at A = Maks poeng: 4 CDC - 1. Maks poeng: 10 rac{15}{15}",
  "Kopi av Eksamen IMAX2012 og IMAX2022 i Kopi av Fremside Institutt for matematiske fag Eksamensoppgave i IMAA2012, IMAA2022, IMAG2012, IMAG2022, IMAT2012 og IMAT2022 Eksamensdato: 10.05.2024 Eksamenstid ( fra - til ) : 09:00 - 13:00 Hjelpemiddelkode / Tillatte hjelpemidler: Hjelpemiddelkode C. Godkjent kalkulator. Ingen håndskevne eller trykte hjelpemidler, formelark er lagt ved eksamen som en pdf - fil. Faglig kontakt under eksamen: Tlf.: Stine Marie Berge ( 93478689 ) Faglig kontakt møter i eksamenslokalet: Nei ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson kontaktes kun dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. Håndtegninger: I oppgave [2, 7] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden Øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «<Vis besvarelse>>. Vekting av oppgavene: er gitt for hver oppgave. Det blir ikke gitt minus - poeng for feil eller manglende svar. Maksimal poengsum er 100 poeng på hele eksamen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. rac{1}{14} 1 Kopi av Oppgave 1: Partiell derivasjon Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 1 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. a ) Gitt funksjonen f ( x, y ) = 3x² + 2y – 4. Finn verdiene til de partiellderiverte i punktet ( 1, 1 ) . af ( 1, 1 ) = = dx af ( 1,1 ) = მყ a მე · f ( x, y ) | ( 1,1 ) a f ( x, y ) | ( 1,1 ) მყ = = b ) Gitt funksjonen g ( x, y ) = \\sqrt\\sqrt\\sqrtx4 + 2x²y + 2xy² + 3, x ≥ 0, y ≥ 0. Finn verdiene til de partiellderiverte i punktet ( 1, 2 ) . Angi svarene med 2 desimaler. dx ag ( 1,2 ) = მg ( 1,2 ) მყ = a მე a - g ( x, y ) | ( 1,2 ) ·g ( x, y ) | ( 1,2 ) Jy მყ = = 2 Kopi av Oppgave 2, kritiske punkt Oppgave 2 ( 10 Poeng ) Denne oppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. La f ( x, y ) = 8xy - 2x² - y². — — a ) Finn de kritiske punktene til funksjonen f. b ) Maks poeng: 10 Klassifiser de kritiske punktene til funksjonen f. Med andre ord, avgjør om de kritiske punktene er sadelpunkter, lokale maksimumspunkter, lokale minimumspunkter, eller ingen av delene. Maks poeng: 10 rac{2}{14} 3 Kopi av Oppgave 3: Retningsderivert Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 3 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vi har funksjonsuttrykket f ( x, y ) = 3x² - 2xy + 2y². a ) Finn gradienten i punktet ( x, y ) = ( 1, 1 ) . Vƒ ( 1,1 ) = i + 7 b ) Vi starter i punktet ( 1, 1 ) , og beveger oss i retningen u = + ½ = 1 + 2. Finn den retningsderiverte. Düf ( 1, 1 ) = c ) Figuren under viser nivåkurver for funksjonen f. I tillegg viser figuren en tangentlinje til nivåkurven i et valgt punkt. Hvilken retning vil gradientvektoren ha i punktet? • Alternativ 1: Gradientvektoren i punktet vil være parallell med tangentlinjen. Alternativ 2: Gradientvektoren i punktet vil stå vinkelrett på tangentlinjen. • Alternativ 3: Retningen til gradientvektoren i punktet er verken parallell eller vinkelrett på tangentlinjen. 2. 1 - - 1 - 2: 20 10 Svar: Alternativ ( skriv enten 1, 2, eller 3 i svarfeltet ) . Maks poeng: 10 rac{3}{14} 4 Kopi av Oppgave 4: Graf - forståelse Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 4 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Hvilken funksjon hører sammen med hvilken graf? Figur A 0 Figur B 0 2 2 I 2 3 - 2 rac{4}{14} rac{1}{2} - Figur C Kopi av Eksamen IMAX2012 og IMAX2022 0 I Figur D M < - 1 = I rac{5}{14} Figur E Kopi av Eksamen IMAX2012 og IMAX2022 3 Skriv bare én av bokstavene A, B, C, D, E i hvert felt under. • Funksjonen f ( x, y ) = cos ( xy ) og figuren hører sammen. • Funksjonen f ( x, y ) = y² - x² og figuren hører sammen. 1 • Funksjonen f ( x, y ) = og figuren hører sammen. 1 + x²y² ● Funksjonen f ( x, y ) = x • e - x² - —y² og figuren hører sammen. • Funksjonen f ( x, y ) = x² - y² og figuren hører sammen. Maks poeng: 10 rac{6}{14} 5 Kopi av Oppgave 5: Taylor 1D Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 5 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. La f ( x ) = tanx, a ) П - < x < . Finn verdiene til f' og f\" i punktet x = Angi svaret korrekt avrundet til 3 desimaler. . f' ( 4 ) = f' ( x ) = b ) Lag det 2. ordens taylorpolynomet P2 ( x ) om punktet x = for funksjonen f. Bruk polynomet P2 ( x ) til å finne en tilnærming til verdien tan ( rac{1}{4} + 0.1 ) . Angi svaret korrekt avrundet til 3 desimaler. П tan ( + 0.1 ) ≈ P₂ ( ½ + 0.1 ) = Maks poeng: 10 rac{7}{14} 6 Kopi av Oppgave 6: Fourierrekke Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 6 ( 8 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. La f ( t ) = sin² ( t ) . a ) Hva er sant om funksjonen funksjonen f? Velg ett alternativ Funksjonen fer verken jevn eller odde. ○ Funksjonen f er ikke periodisk. ○ Funksjonen f er jevn. ○ Funksjonen f er odde. ao La 20 + 1 ( an cos ( nt ) + b sin ( nt ) ) være fourierrekken til ƒ. b ) Hva er ao? Velg ett alternativ rac{1}{2} 1 11 - - 1 \\piT - rac{1}{2} c ) Hva er b₁? rac{8}{14} Velg ett alternativ 1 Kopi av Eksamen IMAX2012 og IMAX2022 - 2 0 2 - 1 d ) Hva er a1? Hint: Bruk variabelbytte u ( t ) = sin ( t ) . Velg ett alternativ 0 - 1 1 \\piT 1 \\piT Maks poeng: 8 rac{9}{14} Kopi av Eksamen IMAX2012 og IMAX2022 7 Kopi av Oppgave 7, jevn og odd fourierrekke Oppgave 7 ( 8 Poeng ) Denne oppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. La f ( t ) = 3 for 0 < t < 2. a ) Vi skal finne sinus - og cosinusrekken ( også kalt den odde - og jevne fourierrekken ) av funksjonen f. Hva er perioden L? b ) La ao + 1 an cos ( 2\\pi t ) være den jevne fourierrekken ( også kalt cosinusrekken ) til f. Finn fourierkoffisientene ao og an når n = 1, 2, 3, ... 3,... L Hint: Hva er den jevne utvidelsen av f? c ) 100 La 1 b sin ( 2 t ) være den odde fourierrekken ( også kalt sinusrekken ) til funksjonen ƒ. Finn fourierkoffisienten b₁. Maks poeng: 8 rac{10}{14} 8 Kopi av Oppgave 8: PDE Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 8 ( 8 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Funksjonen f ( x ) = 2 sin ( 3\\pix ) + sin ( лx ) - 4 sin ( 2x ) er periodisk med periode L = 2. a ) Da har vi at fourierkoeffisientene til f er som følger: • αo = • a1 = • a2 = b₁ • b₂ ● b3 = = = b ) La u ( x, t ) være løsningen til initialverdiproblemet for bølgeligningen. ( Uxx ( x, t ) - Utt ( x,t ) = 0 u ( x, 0 ) = 2sin ( 3\\pix ) + sin ( \\pix ) - 4 sin ( 2x ) u ( 0,t ) = u ( 1,t ) = 0 ( ut ( x, 0 ) = 0 x = [0,1], t> 0, t > 0, x = [0, 1], x = [0, 1]. Da er u ( 1, 1 ) = Hint: Finn først ut hva løsningen u ( x, t ) er. Maks poeng: 8 rac{11}{14} 9 Kopi av Oppgave 9: Fouriertransformasjon Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 9 ( 6 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. a ) La F ( w ) være fouriertransformasjonen til f ( t ) = = 0, for t<0, 1, for 0 <t≤ 1, 0, Da er F ( 2\\pi ) for t> 1. = + j. b ) La g ( t ) = 2e - ( - 3 ) ². Finn verdien F{g ( t ) } ( ) = avrundet til 3 desimaler. + j. Angi svaret korrekt c ) La h ( t ) = 4sgn ( t ) - 3jd ( t ) . Berekn F{h' ( t ) } ( w ) og finn F{h' ( t ) } ( - 2 ) = 10 Kopi av Oppgave 10: Konvolusjon = + j. Maks poeng: 6 Oppgave 10 ( 6 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Enhets - sprang funksjonen ( eller Heaviside funksjonen ) er u ( t ) = [0, dersom t < 0, 1, dersom t≥ 0. La h ( t ) = ( uu ) ( t ) være konvolusjonen av enhets - sprang funksjonen med seg selv. Hva er h ( - 1 ) = og h ( 2 ) : = ? Maks poeng: 6 rac{12}{14} 11 Kopi av Oppgave 11: DFT Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 11 ( 6 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Du er gitt følgende kode: 1 import numpy as np 2 3 from numpy import fft sampling rate = 5 np.array ( [1, 2, 1, 3, 1, 2, 1, 5, 1, 2, 3] ) = fft.fft ( signal ) 4 5 signal = 6 7 dft_{signal} 8 dft_{signal_freq} 9 10 dft_{signal} [np.abs ( dft_{signal_freq} ) > 0.5] = 0 11 new_{signal} = = fft.fftfreq ( dft_{signal}.size, 1 / sampling rate ) fft.ifft ( dft_{signal} ) Sampling rate er det engelske navnet på prøvefrekvensen også kalt prøveraten. a ) Hva er prøveavstanden? Det vil si avstanden mellom prøvene i koden over. Velg ett alternativ 0.2 1 5 0.5 b ) Hva skjer i linje 10 i koden? Velg ett alternativ Alle frekvensene som er mindre 0.5 blir satt til 0. Alle frekvensene som er mellom - 0.5 og 0.5 blir satt til 0. Alle frekvensene som er over 0.5 eller mindre en - 0.5 blir satt til O. Alle frekvensene som er over 0.5 blir satt til O. c ) Du har et lydsignal, men ønsker å fjerne støy som blei produsert av en liten vifte som stod på når lyden ble tatt opp. Du ønsker å beholde frekvenser mellom 70Hz og 3000Hz, men å fjerne viftestøyen på 6000Hz. Hvilket filter kan du bruke? rac{13}{14} Velg ett alternativ: ○ Lavpassfilter Høypassfilter Ingen av delene Kopi av Eksamen IMAX2012 og IMAX2022 Maks poeng: 6 12 Kopi av Oppgave 12: IDFT Oppgave 12 ( 8 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vi skal finne invers diskrete fouriertransformasjonen ( IDFT ) av sekvensen F[k] = 1, 4, 0, 0. Her er F[0] = 1, F[1] = 4, F[2] = 0 og F[3] = 0. Angi svaret korrekt avrundet til 3 desimaler. f[0] = D¯¹{F[k]} [0] = + j, ƒ[1] = D¯¹{F[k]}[1] = + j, ƒ[2] = D¯¹ {F[k]}[2] ƒ[3] = D¯¹{F[k]}[3] = + j, = + j. Maks poeng: 8 rac{14}{14}",
  "rac{8}{5} / 24, 5:34 PM i Fremside Institutt for matematiske fag S24, Eksamen IMAX2012 og IMAX2022 Utsatt eksamen i IMAA2012, IMAA2022, IMAG2012, IMAG2022, IMAT2012 og IMAT2022 Eksamensdato: 05.08.2024 Eksamenstid ( frå - til ) : 09:00 - 13:00 Hjelpemiddelkode / Tillatne hjelpemiddel: Hjelpemiddelkode C. Godkjend kalkulator. Ingen handskrivne eller trykte hjelpemidlar, formelark er lagt ved eksamen som ein pdf - fil. Fagleg kontakt under eksamen: Dag Wessel - Berg Tlf.: 92448828 Fagleg kontakt kjem til eksamenslokalet: NEI ANNA INFORMASJON: Skaff deg eit overblikk over oppgåvesettet før du byrjar å svare på oppgåvene. Les oppgåvene nøye, gjer deg opp dine eigne meiningar og presiser i svara dine kva for føresetnadar du har lagt til grunn i tolking / avgrensing av oppgåva. Fagleg kontaktperson kontaktast berre dersom du meiner det er direkte feil eller manglar i oppgåvesettet. Vend deg til ei eksamensvakt om du meiner det er feil eller manglar. Noter spørsmålet ditt på førehand. Handteikningar: I oppgåve [4, 7] er det lagt opp til at du skal svara på ark. Andre oppgåver skal svarast på direkte i Inspera. Nedst i oppgåva finn du ein sjusifra kode. Fyll inn denne koden øvst til venstre på dei arka du ynskjer å levere. Det er tilrådd å gjere dette undervegs i eksamen. Dersom du behøver tilgang til kodane etter at eksamenstida har gått ut, må du klikke «Sjå levering». Vekting av oppgåvene: er gjeve for kvar oppgåve. Det blir ikkje gjeve minus - poeng for feil eller manglande svar. Maksimal poengsum er 100 poeng for heile eksamen. Varslingar: Dersom det oppstår behov for å gje beskjedar til kandidatane medan eksamen er i gang ( f.eks. ved feil i oppgåvesettet ) , vil dette bli gjort via varslingar i Inspera. Eit varsel vil dukke opp som en dialogboks på skjermen i Inspera. Du kan finne att varselet ved å klikke på bjølla i Øvre høgre hjørne på skjermen. Trekk frå / avbroten eksamen: Blir du sjuk under eksamen, eller av andre grunnar ynskjer å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høgre hjørne og vel «Lever blankt>>. Dette kan ikkje angrast sjølv om prøven framleis er open. Tilgang til svara dine: Etter eksamen finn du svara dine i arkivet i Inspera. Merk at det kan ta ein vyrkedag før eventuelle handteikningar vert tilgjengelege i arkivet. https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{1}{17} rac{8}{5} / 24, 5:34 PM 1 Oppgave 1 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 1 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. a ) Gitt funksjonen f ( x, y ) = 2y² - x - 1. Finn verdiane til dei partiellderiverte i punktet ( 1, 1 ) . af ( 1, 1 ) = მე of ( 1,1 ) მყ b ) = a ax a f ( x, y ) | ( 1,1 ) = - f ( x, y ) | ( 1,1 ) მყ = ☐ Gitt funksjonen g ( x, y ) = sin ( x² + y² + 2x ) . Finn verdiane til dei partiellderiverte i punktet ( 0, 0 ) . Angi svara med 2 desimalar. ag ( 0,0 ) = = მთ ag ( 0,0 ) მყ = მ dx მ მყ - g ( x, y ) | ( 0,0 ) - g ( x, y ) | ( 0,0 ) = = Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{2}{17} rac{8}{5} / 24, 5:34 PM 2 Oppgave 2 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 2 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Kva for ein funksjon høyrer saman med kva for ein graf ( konturplott ) ? Graf 1: 2. 1 2 0 - 2 - 1 0 1 2 Graf 2: - 1· + https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{3}{17} rac{8}{5} / 24, 5:34 PM 2 S24, Eksamen IMAX2012 og IMAX2022 1 2 1 0 - 2 - 1 0 1 - 1 Graf 3: - 2 N N N + 0.8 0.6 0.4 0.2 0 - 2 2 - 2 https: / / ntnu.inspera.no / admin#author / test / 232806202 - 0.2 - 0.4 - 0.6 - 0.8 rac{4}{17} rac{8}{5} / 24, 5:34 PM Graf 4: P 2 S24, Eksamen IMAX2012 og IMAX2022 0.8 0.6 90 0.4 0.2 0 - 2 1 0 1 2 Graf 5: - 2 - - 0.2 - 0.4 - 0.6 - 0.8 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{5}{17} rac{8}{5} / 24, 5:34 PM 0.5 1 - S24, Eksamen IMAX2012 og IMAX2022 - 0.5 0 0.5 1 - 0.5 Funksjon 1: f1 ( x, y ) = x + y Funksjon 2: f2 ( x, y ) = - xy Funksjon 3: f3 ( x, y ) = sin ( x - y ) Funksjon 4: f4 ( x, y ) = sin ( 2x² + 2y² ) Funksjon 5: f ( x, y ) = exp ( - 2x² - 2y² ) - 1 0.8 0.6 0.4 10 0.2 - 0 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{6}{17} rac{8}{5} / 24, 5:34 PM Finn dei som passar saman f4 f2 f3 f5 f1 S24, Eksamen IMAX2012 og IMAX2022 Graf 1 Graf 5 Graf 3 Graf 2 Graf 4 Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{7}{17} rac{8}{5} / 24, 5:34 PM 3 Oppgave 3 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 3 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Konturplottet til funksjonen f ( x, y ) er avbilda under. J 2.0 1.8 1.6 - 1.6 1.4 1.2 1.4 - 0.8 1.2 - 1.0 0.8 0 0.5 1 1.5 I 0.6 0.4 0.2 a ) Finn forteiknet til den retningsderiverte i punktet ( 1,1 ) i retning øst ( 1, 0 ) . Vel eitt alternativ Null Positiv Kan ikkje finnes ut frå plottet Negativ b ) I kva for ei retning peiker gradienten Vƒ ( 1, 1 ) ? https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{8}{17} rac{8}{5} / 24, 5:34 PM S24, Eksamen IMAX2012 og IMAX2022 Vel eitt alternativ SON ( 0,1 ) ○ S ( 0, - 1 ) ○ E ( 1,0 ) ○ W ( - 1,0 ) Maks poeng: 10 4 Oppgave 4 Oppgåve 4 ( 10 Poeng ) Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. Finn det globale maksimum og det globale minimum til funksjonen - f ( x, y ) = 2x² - 3xy - y² + 2x + y - 1 i området avgrensa av 0 ≤ x ≤ 1 og 0 ≤ y ≤ 1. Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{9}{17} rac{8}{5} / 24, 5:34 PM 5 Oppgave 5 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 5 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Grafen til funksjonen f ( x, y ) = = log ( 1 + x² + 2y² ) er avbilda under. - 0.5 - 1.5 - 2 J 0 - 0 - 1 - 2 2 X a ) Finn lineariseringa, også kalla det første ordens taylorpolynomet, av f ( x, y ) rundt punktet ( 1, 1 ) . https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{10}{17} rac{8}{5} / 24, 5:34 PM Vel eitt alternativ ○ f ( x, y ) ≈ - log ( 4 ) - x - y — f ( x, y ) ≈ 4 - x - y - f ( x, y ) ≈ 4 — ½½ ( x - 1 ) — —½ ( y - 1 ) - - - ○ f ( x, y ) ≈ 4 — ½½ ( x - 1 ) — ( y - 1 ) S24, Eksamen IMAX2012 og IMAX2022 f ( x, y ) ≈ — log ( 4 ) — — ( x - 1 ) — ½ - ½ ( y – 1 ) - f ( x, y ) ≈ — log ( 4 ) — —½ - ½ ( x - 1 ) - ( y — 1 ) b ) Anta at f ( x, y ) representerer høgdeforskjellen i meter frå toppen av eit fjell ( slik at f er lik null ved toppen ) . Vi begynnar i punktet ( \\sqrt3,1 ) og beveger oss opp mot toppen ( 0, 0 ) . Hugs at fi ( ( x, y ) ) ² 2 af + მყ ( % ( x, y ) ) ² 2 stigninga til ƒ i punktet ( x, y ) er gitt som lengda av gradienten 1 ( of Kva for ein av dei følgande påstandane stemmer? Vel eitt alternativ Stigninga er alltid mindre enn ½ på veg mot toppen frå startpunktet ( \\sqrt3,1 ) . 6 Stigninga må være / eit sted mellom startpunktet ( \\sqrt3, 1 ) og toppen av fjellet. Det vil være mogleg å ta ein rute mot toppen frå startpunktet ( \\sqrt3,1 ) slik at stigninga aldri vil være nøyaktig. Stigninga er alltid større enn ½ - ½ på veg mot toppen frå startpunktet ( \\sqrt3, 1 ) . Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{11}{17} rac{8}{5} / 24, 5:34 PM 6 Oppgave 6 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 6 ( 8 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) f ( t ) = { 0 \\sqrt0 tЄ [ - 1,0 ) på intervallet ( - 1, 1 ) . La Ce 2 jt være den komplekse 1 tЄ [0,1 ) fourierrekkja til den periodiske utvidinga av f. Hint: Hugs at ¹ = - j. a ) Kva er perioden ▲ for den komplekse fourierrekkja? Vel eitt alternativ 2\\piT 1 2 П b ) Kva er verdien til co? Vel eitt alternativ со = 1 со = - 1 CO CO = 0 - 2 со = 12 со = 2 Co = 1 c ) Kva er verdien til c₁? https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{12}{17} rac{8}{5} / 24, 5:34 PM Vel eitt alternativ S24, Eksamen IMAX2012 og IMAX2022 C1 = j\" j\" C₁ = П C1 = j 2\\piT C1 = j 2\\piT C₁ = 0 d ) Kva er verdien til C_{2}? Vel eitt alternativ C - 2 = j П ○ C_{2} = 0 C - 2 = = j 2\\piT C - 2 = j 2\\piT C - 2 = j| \\piT Maks poeng: 8 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{13}{17} rac{8}{5} / 24, 5:34 PM 7 Oppgave 7 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 7 ( 10 Poeng ) Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. La f ( t ) = t for 0 ≤ t < 2. a ) Vi skal finne fourierrekkja av funksjonen f. Kva er perioden L til den periodiske utvidinga? b ) La + 1 ( an cos ( 2n t ) + b sin ( 2\\pin t ) ) være fourierrekkja til f. Finn fourierkoeffisientane ao, an og bn når n = 1, 2, 3, ... Hint: Hugs at delvis integrasjon seiar at for u ( t ) v' ( t ) dt = u ( t ) v ( t ) |å – få u' ( t ) v ( t ) dt. a 8 Oppgave 8 Maks poeng: 10 Oppgåve 8 ( 8 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) = 4 cos ( 2\\pit ) + 2 cos ( 4\\pit ) - 2 sin ( 4\\pit ) + 8 sin ( 8\\pit ) , som har periode L = 1. a ) Da har vi at fourierkoeffisientane a0, a1, og b₂ er: • • • ao = a1 = • b₂ = ' ' b ) Kva er integralet for f ( t ) ²dt? S₁₁ f ( t ) ²dt = https: / / ntnu.inspera.no / admin#author / test / 232806202 Maks poeng: 8 rac{14}{17} rac{8}{5} / 24, 5:34 PM 9 Oppgave 9 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 9 ( 6 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. a ) La F ( w ) være fouriertransformasjonen til 0, for t < 0, 0. f ( t ) = = Da er F ( 0 ) = + etij, for 0 <t≤ 2\\pi, fort > 2\\pi. j. Angi svaret korrekt avrunda til 3 desimalar. b ) La g ( t ) = e³tjet². Finn verdien F{g ( t ) } ( 5 ) til 3 desimalar. = = + j. Angi svaret korrekt avrunda c ) La h ( t ) = u ( t ) — 118 ( t - 1 ) , kor u ( t ) er einingssprang - funksjonen og 8 ( t ) er dirac - delta. funksjonen. Berekn F{h' ( t ) } ( w ) og finn F{h' ( t ) } ( \\pi ) = korrekt avrunda til 3 desimalar. + j. Angi svaret Maks poeng: 6 10 Oppgave 10 Oppgåve 10 ( 8 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) = 2u ( t ) e - 4t, kor u ( t ) er einingssprang - sprang funksjonen ( eller Heaviside funksjonen ) ( 0, dersom t < 0, u ( t ) = { 0 } 1, dersom t≥ 0. Finn F{f ( t ) } ( 0 ) = + jog F{f * f ( t ) } ( 0 ) = med 2 desimalars nøyaktigheit. + j. Angi svaret https: / / ntnu.inspera.no / admin#author / test / 232806202 Maks poeng: 8 rac{15}{17} rac{8}{5} / 24, 5:34 PM 11 Oppgave 11 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 11 ( 4 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Du er gitt følgande kode: 1 import numpy as np 2 from numpy import fft 3 4 sampling_{interval} 5 ☑ = 0.01 = np.array ( 0, 2, sampling_{interval} ) np.exp ( - 2x ) 6 7 f = 8 9 f dft = fft. fft ( f ) 10 omega = fft. fft freq ( f. size, sampling_{interval} ) Sampling interval er det engelske namnet på prøveavstanden. a ) Kva er prøvefrekvensen? Det vil si kor mange prøver som blir tatt per sekund. Vel eitt alternativ 100 200 0.2 0.01 0.005 b ) Kva for eit alternativ vil gi oss ei approksimering av F{f} ( 1 ) ( opp til multiplikasjon med ein konstant ) ? Vel eitt alternativ ○ f[x = = 1] ○ f_{dft}[omega f_{dft}[x = = f[omega 1] = = = = 1] 1] https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{16}{17} rac{8}{5} / 24, 5:34 PM S24, Eksamen IMAX2012 og IMAX2022 Maks poeng: 4 12 Oppgave 12 Oppgåve 12 ( 6 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Vi skal finne nokon av elementa i den diskrete fouriertransformasjonen ( DFT ) av sekvensen ƒ[k] = 2, 0, 1, 0, 0, 0, 0, 0. Her er f[0] = 2, ƒ[1] = 0, ƒ[2] = 1, ƒ[3] = 0, ƒ[4] = 0, f[5] = 0, f[6] = 0, og f[7] 0, og f[7] = 0. Angi svaret korrekt avrunda til 3 desimalar. F[0] = D{f[k]}[0] F[1] = D{ƒ[k]}[1] = = + j, = + j₁ F[7] = D{f[k]}[7] = + j. Maks poeng: 6 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{17}{17}",
  "rac{8}{5} / 24, 5:34 PM i Fremside Institutt for matematiske fag S24, Eksamen IMAX2012 og IMAX2022 Utsatt eksamen i IMAA2012, IMAA2022, IMAG2012, IMAG2022, IMAT2012 og IMAT2022 Eksamensdato: 05.08.2024 Eksamenstid ( frå - til ) : 09:00 - 13:00 Hjelpemiddelkode / Tillatne hjelpemiddel: Hjelpemiddelkode C. Godkjend kalkulator. Ingen handskrivne eller trykte hjelpemidlar, formelark er lagt ved eksamen som ein pdf - fil. Fagleg kontakt under eksamen: Dag Wessel - Berg Tlf.: 92448828 Fagleg kontakt kjem til eksamenslokalet: NEI ANNA INFORMASJON: Skaff deg eit overblikk over oppgåvesettet før du byrjar å svare på oppgåvene. Les oppgåvene nøye, gjer deg opp dine eigne meiningar og presiser i svara dine kva for føresetnadar du har lagt til grunn i tolking / avgrensing av oppgåva. Fagleg kontaktperson kontaktast berre dersom du meiner det er direkte feil eller manglar i oppgåvesettet. Vend deg til ei eksamensvakt om du meiner det er feil eller manglar. Noter spørsmålet ditt på førehand. Handteikningar: I oppgåve [4, 7] er det lagt opp til at du skal svara på ark. Andre oppgåver skal svarast på direkte i Inspera. Nedst i oppgåva finn du ein sjusifra kode. Fyll inn denne koden øvst til venstre på dei arka du ynskjer å levere. Det er tilrådd å gjere dette undervegs i eksamen. Dersom du behøver tilgang til kodane etter at eksamenstida har gått ut, må du klikke «Sjå levering». Vekting av oppgåvene: er gjeve for kvar oppgåve. Det blir ikkje gjeve minus - poeng for feil eller manglande svar. Maksimal poengsum er 100 poeng for heile eksamen. Varslingar: Dersom det oppstår behov for å gje beskjedar til kandidatane medan eksamen er i gang ( f.eks. ved feil i oppgåvesettet ) , vil dette bli gjort via varslingar i Inspera. Eit varsel vil dukke opp som en dialogboks på skjermen i Inspera. Du kan finne att varselet ved å klikke på bjølla i Øvre høgre hjørne på skjermen. Trekk frå / avbroten eksamen: Blir du sjuk under eksamen, eller av andre grunnar ynskjer å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høgre hjørne og vel «Lever blankt>>. Dette kan ikkje angrast sjølv om prøven framleis er open. Tilgang til svara dine: Etter eksamen finn du svara dine i arkivet i Inspera. Merk at det kan ta ein vyrkedag før eventuelle handteikningar vert tilgjengelege i arkivet. https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{1}{17} rac{8}{5} / 24, 5:34 PM 1 Oppgave 1 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 1 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. a ) Gitt funksjonen f ( x, y ) = 2y² - x - 1. Finn verdiane til dei partiellderiverte i punktet ( 1, 1 ) . af ( 1, 1 ) = მე of ( 1,1 ) მყ b ) = a ax a f ( x, y ) | ( 1,1 ) = - f ( x, y ) | ( 1,1 ) მყ = ☐ Gitt funksjonen g ( x, y ) = sin ( x² + y² + 2x ) . Finn verdiane til dei partiellderiverte i punktet ( 0, 0 ) . Angi svara med 2 desimalar. ag ( 0,0 ) = = მთ ag ( 0,0 ) მყ = მ dx მ მყ - g ( x, y ) | ( 0,0 ) - g ( x, y ) | ( 0,0 ) = = Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{2}{17} rac{8}{5} / 24, 5:34 PM 2 Oppgave 2 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 2 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Kva for ein funksjon høyrer saman med kva for ein graf ( konturplott ) ? Graf 1: 2. 1 2 0 - 2 - 1 0 1 2 Graf 2: - 1· + https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{3}{17} rac{8}{5} / 24, 5:34 PM 2 S24, Eksamen IMAX2012 og IMAX2022 1 2 1 0 - 2 - 1 0 1 - 1 Graf 3: - 2 N N N + 0.8 0.6 0.4 0.2 0 - 2 2 - 2 https: / / ntnu.inspera.no / admin#author / test / 232806202 - 0.2 - 0.4 - 0.6 - 0.8 rac{4}{17} rac{8}{5} / 24, 5:34 PM Graf 4: P 2 S24, Eksamen IMAX2012 og IMAX2022 0.8 0.6 90 0.4 0.2 0 - 2 1 0 1 2 Graf 5: - 2 - - 0.2 - 0.4 - 0.6 - 0.8 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{5}{17} rac{8}{5} / 24, 5:34 PM 0.5 1 - S24, Eksamen IMAX2012 og IMAX2022 - 0.5 0 0.5 1 - 0.5 Funksjon 1: f1 ( x, y ) = x + y Funksjon 2: f2 ( x, y ) = - xy Funksjon 3: f3 ( x, y ) = sin ( x - y ) Funksjon 4: f4 ( x, y ) = sin ( 2x² + 2y² ) Funksjon 5: f ( x, y ) = exp ( - 2x² - 2y² ) - 1 0.8 0.6 0.4 10 0.2 - 0 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{6}{17} rac{8}{5} / 24, 5:34 PM Finn dei som passar saman f4 f2 f3 f5 f1 S24, Eksamen IMAX2012 og IMAX2022 Graf 1 Graf 5 Graf 3 Graf 2 Graf 4 Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{7}{17} rac{8}{5} / 24, 5:34 PM 3 Oppgave 3 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 3 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Konturplottet til funksjonen f ( x, y ) er avbilda under. J 2.0 1.8 1.6 - 1.6 1.4 1.2 1.4 - 0.8 1.2 - 1.0 0.8 0 0.5 1 1.5 I 0.6 0.4 0.2 a ) Finn forteiknet til den retningsderiverte i punktet ( 1,1 ) i retning øst ( 1, 0 ) . Vel eitt alternativ Null Positiv Kan ikkje finnes ut frå plottet Negativ b ) I kva for ei retning peiker gradienten Vƒ ( 1, 1 ) ? https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{8}{17} rac{8}{5} / 24, 5:34 PM S24, Eksamen IMAX2012 og IMAX2022 Vel eitt alternativ SON ( 0,1 ) ○ S ( 0, - 1 ) ○ E ( 1,0 ) ○ W ( - 1,0 ) Maks poeng: 10 4 Oppgave 4 Oppgåve 4 ( 10 Poeng ) Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. Finn det globale maksimum og det globale minimum til funksjonen - f ( x, y ) = 2x² - 3xy - y² + 2x + y - 1 i området avgrensa av 0 ≤ x ≤ 1 og 0 ≤ y ≤ 1. Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{9}{17} rac{8}{5} / 24, 5:34 PM 5 Oppgave 5 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 5 ( 10 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Grafen til funksjonen f ( x, y ) = = log ( 1 + x² + 2y² ) er avbilda under. - 0.5 - 1.5 - 2 J 0 - 0 - 1 - 2 2 X a ) Finn lineariseringa, også kalla det første ordens taylorpolynomet, av f ( x, y ) rundt punktet ( 1, 1 ) . https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{10}{17} rac{8}{5} / 24, 5:34 PM Vel eitt alternativ ○ f ( x, y ) ≈ - log ( 4 ) - x - y — f ( x, y ) ≈ 4 - x - y - f ( x, y ) ≈ 4 — ½½ ( x - 1 ) — —½ ( y - 1 ) - - - ○ f ( x, y ) ≈ 4 — ½½ ( x - 1 ) — ( y - 1 ) S24, Eksamen IMAX2012 og IMAX2022 f ( x, y ) ≈ — log ( 4 ) — — ( x - 1 ) — ½ - ½ ( y – 1 ) - f ( x, y ) ≈ — log ( 4 ) — —½ - ½ ( x - 1 ) - ( y — 1 ) b ) Anta at f ( x, y ) representerer høgdeforskjellen i meter frå toppen av eit fjell ( slik at f er lik null ved toppen ) . Vi begynnar i punktet ( \\sqrt3,1 ) og beveger oss opp mot toppen ( 0, 0 ) . Hugs at fi ( ( x, y ) ) ² 2 af + მყ ( % ( x, y ) ) ² 2 stigninga til ƒ i punktet ( x, y ) er gitt som lengda av gradienten 1 ( of Kva for ein av dei følgande påstandane stemmer? Vel eitt alternativ Stigninga er alltid mindre enn ½ på veg mot toppen frå startpunktet ( \\sqrt3,1 ) . 6 Stigninga må være / eit sted mellom startpunktet ( \\sqrt3, 1 ) og toppen av fjellet. Det vil være mogleg å ta ein rute mot toppen frå startpunktet ( \\sqrt3,1 ) slik at stigninga aldri vil være nøyaktig. Stigninga er alltid større enn ½ - ½ på veg mot toppen frå startpunktet ( \\sqrt3, 1 ) . Maks poeng: 10 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{11}{17} rac{8}{5} / 24, 5:34 PM 6 Oppgave 6 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 6 ( 8 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) f ( t ) = { 0 \\sqrt0 tЄ [ - 1,0 ) på intervallet ( - 1, 1 ) . La Ce 2 jt være den komplekse 1 tЄ [0,1 ) fourierrekkja til den periodiske utvidinga av f. Hint: Hugs at ¹ = - j. a ) Kva er perioden ▲ for den komplekse fourierrekkja? Vel eitt alternativ 2\\piT 1 2 П b ) Kva er verdien til co? Vel eitt alternativ со = 1 со = - 1 CO CO = 0 - 2 со = 12 со = 2 Co = 1 c ) Kva er verdien til c₁? https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{12}{17} rac{8}{5} / 24, 5:34 PM Vel eitt alternativ S24, Eksamen IMAX2012 og IMAX2022 C1 = j\" j\" C₁ = П C1 = j 2\\piT C1 = j 2\\piT C₁ = 0 d ) Kva er verdien til C_{2}? Vel eitt alternativ C - 2 = j П ○ C_{2} = 0 C - 2 = = j 2\\piT C - 2 = j 2\\piT C - 2 = j| \\piT Maks poeng: 8 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{13}{17} rac{8}{5} / 24, 5:34 PM 7 Oppgave 7 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 7 ( 10 Poeng ) Du skal svara på denne oppgåva på papir ( med sjusifra kode ) som vert skanna inn. La f ( t ) = t for 0 ≤ t < 2. a ) Vi skal finne fourierrekkja av funksjonen f. Kva er perioden L til den periodiske utvidinga? b ) La + 1 ( an cos ( 2n t ) + b sin ( 2\\pin t ) ) være fourierrekkja til f. Finn fourierkoeffisientane ao, an og bn når n = 1, 2, 3, ... Hint: Hugs at delvis integrasjon seiar at for u ( t ) v' ( t ) dt = u ( t ) v ( t ) |å – få u' ( t ) v ( t ) dt. a 8 Oppgave 8 Maks poeng: 10 Oppgåve 8 ( 8 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) = 4 cos ( 2\\pit ) + 2 cos ( 4\\pit ) - 2 sin ( 4\\pit ) + 8 sin ( 8\\pit ) , som har periode L = 1. a ) Da har vi at fourierkoeffisientane a0, a1, og b₂ er: • • • ao = a1 = • b₂ = ' ' b ) Kva er integralet for f ( t ) ²dt? S₁₁ f ( t ) ²dt = https: / / ntnu.inspera.no / admin#author / test / 232806202 Maks poeng: 8 rac{14}{17} rac{8}{5} / 24, 5:34 PM 9 Oppgave 9 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 9 ( 6 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. a ) La F ( w ) være fouriertransformasjonen til 0, for t < 0, 0. f ( t ) = = Da er F ( 0 ) = + etij, for 0 <t≤ 2\\pi, fort > 2\\pi. j. Angi svaret korrekt avrunda til 3 desimalar. b ) La g ( t ) = e³tjet². Finn verdien F{g ( t ) } ( 5 ) til 3 desimalar. = = + j. Angi svaret korrekt avrunda c ) La h ( t ) = u ( t ) — 118 ( t - 1 ) , kor u ( t ) er einingssprang - funksjonen og 8 ( t ) er dirac - delta. funksjonen. Berekn F{h' ( t ) } ( w ) og finn F{h' ( t ) } ( \\pi ) = korrekt avrunda til 3 desimalar. + j. Angi svaret Maks poeng: 6 10 Oppgave 10 Oppgåve 10 ( 8 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. La f ( t ) = 2u ( t ) e - 4t, kor u ( t ) er einingssprang - sprang funksjonen ( eller Heaviside funksjonen ) ( 0, dersom t < 0, u ( t ) = { 0 } 1, dersom t≥ 0. Finn F{f ( t ) } ( 0 ) = + jog F{f * f ( t ) } ( 0 ) = med 2 desimalars nøyaktigheit. + j. Angi svaret https: / / ntnu.inspera.no / admin#author / test / 232806202 Maks poeng: 8 rac{15}{17} rac{8}{5} / 24, 5:34 PM 11 Oppgave 11 S24, Eksamen IMAX2012 og IMAX2022 Oppgåve 11 ( 4 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Du er gitt følgande kode: 1 import numpy as np 2 from numpy import fft 3 4 sampling_{interval} 5 ☑ = 0.01 = np.array ( 0, 2, sampling_{interval} ) np.exp ( - 2x ) 6 7 f = 8 9 f dft = fft. fft ( f ) 10 omega = fft. fft freq ( f. size, sampling_{interval} ) Sampling interval er det engelske namnet på prøveavstanden. a ) Kva er prøvefrekvensen? Det vil si kor mange prøver som blir tatt per sekund. Vel eitt alternativ 100 200 0.2 0.01 0.005 b ) Kva for eit alternativ vil gi oss ei approksimering av F{f} ( 1 ) ( opp til multiplikasjon med ein konstant ) ? Vel eitt alternativ ○ f[x = = 1] ○ f_{dft}[omega f_{dft}[x = = f[omega 1] = = = = 1] 1] https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{16}{17} rac{8}{5} / 24, 5:34 PM S24, Eksamen IMAX2012 og IMAX2022 Maks poeng: 4 12 Oppgave 12 Oppgåve 12 ( 6 Poeng ) Du skal svara på denne oppgåva i Inspera. Du skal ikkje leggja ved utrekningar på papir. Vi skal finne nokon av elementa i den diskrete fouriertransformasjonen ( DFT ) av sekvensen ƒ[k] = 2, 0, 1, 0, 0, 0, 0, 0. Her er f[0] = 2, ƒ[1] = 0, ƒ[2] = 1, ƒ[3] = 0, ƒ[4] = 0, f[5] = 0, f[6] = 0, og f[7] 0, og f[7] = 0. Angi svaret korrekt avrunda til 3 desimalar. F[0] = D{f[k]}[0] F[1] = D{ƒ[k]}[1] = = + j, = + j₁ F[7] = D{f[k]}[7] = + j. Maks poeng: 6 https: / / ntnu.inspera.no / admin#author / test / 232806202 rac{17}{17}",
  "Kopi av Eksamen IMAX2012 og IMAX2022 i Kopi av Fremside Institutt for matematiske fag Eksamensoppgave i IMAA2012, IMAA2022, IMAG2012, IMAG2022, IMAT2012 og IMAT2022 Eksamensdato: 10.05.2024 Eksamenstid ( fra - til ) : 09:00 - 13:00 Hjelpemiddelkode / Tillatte hjelpemidler: Hjelpemiddelkode C. Godkjent kalkulator. Ingen håndskevne eller trykte hjelpemidler, formelark er lagt ved eksamen som en pdf - fil. Faglig kontakt under eksamen: Tlf.: Stine Marie Berge ( 93478689 ) Faglig kontakt møter i eksamenslokalet: Nei ANNEN INFORMASJON: Skaff deg overblikk over oppgavesettet før du begynner på besvarelsen din. Les oppgavene nøye, gjør dine egne antagelser og presiser i besvarelsen hvilke forutsetninger du har lagt til grunn i tolkning / avgrensing av oppgaven. Faglig kontaktperson kontaktes kun dersom det er direkte feil eller mangler i oppgavesettet. Henvend deg til en eksamensvakt hvis du mistenker feil og mangler. Noter spørsmålet ditt på forhånd. Håndtegninger: I oppgave [2, 7] er det lagt opp til å besvare på ark. Andre oppgaver skal besvares direkte i Inspera. Nederst i oppgaven finner du en sjusifret kode. Fyll inn denne koden Øverst til venstre på arkene du ønsker å levere. Det anbefales å gjøre dette underveis i eksamen. Dersom du behøver tilgang til kodene etter at eksamenstiden har utløpt, må du klikke «<Vis besvarelse>>. Vekting av oppgavene: er gitt for hver oppgave. Det blir ikke gitt minus - poeng for feil eller manglende svar. Maksimal poengsum er 100 poeng på hele eksamen. Varslinger: Hvis det oppstår behov for å gi beskjeder til kandidatene underveis i eksamen ( f.eks. ved feil i oppgavesettet ) , vil dette bli gjort via varslinger i Inspera. Et varsel vil dukke opp som en dialogboks på skjermen. Du kan finne igjen varselet ved å klikke på bjella øverst til høyre. Trekk fra / avbrutt eksamen: Blir du syk under eksamen, eller av andre grunner ønsker å levere blankt / avbryte eksamen, gå til \"hamburgermenyen\" i øvre høyre hjørne og velg «Lever blankt>>. Dette kan ikke angres selv om prøven fremdeles er åpen. Tilgang til besvarelse: Etter eksamen finner du besvarelsen din i arkivet i Inspera. Merk at det kan ta én virkedag før eventuelle håndtegninger vil være tilgjengelige i arkivet. rac{1}{14} 1 Kopi av Oppgave 1: Partiell derivasjon Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 1 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. a ) Gitt funksjonen f ( x, y ) = 3x² + 2y – 4. Finn verdiene til de partiellderiverte i punktet ( 1, 1 ) . af ( 1, 1 ) = = dx af ( 1,1 ) = მყ a მე · f ( x, y ) | ( 1,1 ) a f ( x, y ) | ( 1,1 ) მყ = = b ) Gitt funksjonen g ( x, y ) = \\sqrt\\sqrt\\sqrtx4 + 2x²y + 2xy² + 3, x ≥ 0, y ≥ 0. Finn verdiene til de partiellderiverte i punktet ( 1, 2 ) . Angi svarene med 2 desimaler. dx ag ( 1,2 ) = მg ( 1,2 ) მყ = a მე a - g ( x, y ) | ( 1,2 ) ·g ( x, y ) | ( 1,2 ) Jy მყ = = 2 Kopi av Oppgave 2, kritiske punkt Oppgave 2 ( 10 Poeng ) Denne oppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. La f ( x, y ) = 8xy - 2x² - y². — — a ) Finn de kritiske punktene til funksjonen f. b ) Maks poeng: 10 Klassifiser de kritiske punktene til funksjonen f. Med andre ord, avgjør om de kritiske punktene er sadelpunkter, lokale maksimumspunkter, lokale minimumspunkter, eller ingen av delene. Maks poeng: 10 rac{2}{14} 3 Kopi av Oppgave 3: Retningsderivert Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 3 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vi har funksjonsuttrykket f ( x, y ) = 3x² - 2xy + 2y². a ) Finn gradienten i punktet ( x, y ) = ( 1, 1 ) . Vƒ ( 1,1 ) = i + 7 b ) Vi starter i punktet ( 1, 1 ) , og beveger oss i retningen u = + ½ = 1 + 2. Finn den retningsderiverte. Düf ( 1, 1 ) = c ) Figuren under viser nivåkurver for funksjonen f. I tillegg viser figuren en tangentlinje til nivåkurven i et valgt punkt. Hvilken retning vil gradientvektoren ha i punktet? • Alternativ 1: Gradientvektoren i punktet vil være parallell med tangentlinjen. Alternativ 2: Gradientvektoren i punktet vil stå vinkelrett på tangentlinjen. • Alternativ 3: Retningen til gradientvektoren i punktet er verken parallell eller vinkelrett på tangentlinjen. 2. 1 - - 1 - 2: 20 10 Svar: Alternativ ( skriv enten 1, 2, eller 3 i svarfeltet ) . Maks poeng: 10 rac{3}{14} 4 Kopi av Oppgave 4: Graf - forståelse Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 4 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Hvilken funksjon hører sammen med hvilken graf? Figur A 0 Figur B 0 2 2 I 2 3 - 2 rac{4}{14} rac{1}{2} - Figur C Kopi av Eksamen IMAX2012 og IMAX2022 0 I Figur D M < - 1 = I rac{5}{14} Figur E Kopi av Eksamen IMAX2012 og IMAX2022 3 Skriv bare én av bokstavene A, B, C, D, E i hvert felt under. • Funksjonen f ( x, y ) = cos ( xy ) og figuren hører sammen. • Funksjonen f ( x, y ) = y² - x² og figuren hører sammen. 1 • Funksjonen f ( x, y ) = og figuren hører sammen. 1 + x²y² ● Funksjonen f ( x, y ) = x • e - x² - —y² og figuren hører sammen. • Funksjonen f ( x, y ) = x² - y² og figuren hører sammen. Maks poeng: 10 rac{6}{14} 5 Kopi av Oppgave 5: Taylor 1D Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 5 ( 10 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. La f ( x ) = tanx, a ) П - < x < . Finn verdiene til f' og f\" i punktet x = Angi svaret korrekt avrundet til 3 desimaler. . f' ( 4 ) = f' ( x ) = b ) Lag det 2. ordens taylorpolynomet P2 ( x ) om punktet x = for funksjonen f. Bruk polynomet P2 ( x ) til å finne en tilnærming til verdien tan ( rac{1}{4} + 0.1 ) . Angi svaret korrekt avrundet til 3 desimaler. П tan ( + 0.1 ) ≈ P₂ ( ½ + 0.1 ) = Maks poeng: 10 rac{7}{14} 6 Kopi av Oppgave 6: Fourierrekke Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 6 ( 8 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. La f ( t ) = sin² ( t ) . a ) Hva er sant om funksjonen funksjonen f? Velg ett alternativ Funksjonen fer verken jevn eller odde. ○ Funksjonen f er ikke periodisk. ○ Funksjonen f er jevn. ○ Funksjonen f er odde. ao La 20 + 1 ( an cos ( nt ) + b sin ( nt ) ) være fourierrekken til ƒ. b ) Hva er ao? Velg ett alternativ rac{1}{2} 1 11 - - 1 \\piT - rac{1}{2} c ) Hva er b₁? rac{8}{14} Velg ett alternativ 1 Kopi av Eksamen IMAX2012 og IMAX2022 - 2 0 2 - 1 d ) Hva er a1? Hint: Bruk variabelbytte u ( t ) = sin ( t ) . Velg ett alternativ 0 - 1 1 \\piT 1 \\piT Maks poeng: 8 rac{9}{14} Kopi av Eksamen IMAX2012 og IMAX2022 7 Kopi av Oppgave 7, jevn og odd fourierrekke Oppgave 7 ( 8 Poeng ) Denne oppgaven skal besvares på papir ( med sjusifret kode ) som skannes inn. La f ( t ) = 3 for 0 < t < 2. a ) Vi skal finne sinus - og cosinusrekken ( også kalt den odde - og jevne fourierrekken ) av funksjonen f. Hva er perioden L? b ) La ao + 1 an cos ( 2\\pi t ) være den jevne fourierrekken ( også kalt cosinusrekken ) til f. Finn fourierkoffisientene ao og an når n = 1, 2, 3, ... 3,... L Hint: Hva er den jevne utvidelsen av f? c ) 100 La 1 b sin ( 2 t ) være den odde fourierrekken ( også kalt sinusrekken ) til funksjonen ƒ. Finn fourierkoffisienten b₁. Maks poeng: 8 rac{10}{14} 8 Kopi av Oppgave 8: PDE Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 8 ( 8 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Funksjonen f ( x ) = 2 sin ( 3\\pix ) + sin ( лx ) - 4 sin ( 2x ) er periodisk med periode L = 2. a ) Da har vi at fourierkoeffisientene til f er som følger: • αo = • a1 = • a2 = b₁ • b₂ ● b3 = = = b ) La u ( x, t ) være løsningen til initialverdiproblemet for bølgeligningen. ( Uxx ( x, t ) - Utt ( x,t ) = 0 u ( x, 0 ) = 2sin ( 3\\pix ) + sin ( \\pix ) - 4 sin ( 2x ) u ( 0,t ) = u ( 1,t ) = 0 ( ut ( x, 0 ) = 0 x = [0,1], t> 0, t > 0, x = [0, 1], x = [0, 1]. Da er u ( 1, 1 ) = Hint: Finn først ut hva løsningen u ( x, t ) er. Maks poeng: 8 rac{11}{14} 9 Kopi av Oppgave 9: Fouriertransformasjon Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 9 ( 6 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. a ) La F ( w ) være fouriertransformasjonen til f ( t ) = = 0, for t<0, 1, for 0 <t≤ 1, 0, Da er F ( 2\\pi ) for t> 1. = + j. b ) La g ( t ) = 2e - ( - 3 ) ². Finn verdien F{g ( t ) } ( ) = avrundet til 3 desimaler. + j. Angi svaret korrekt c ) La h ( t ) = 4sgn ( t ) - 3jd ( t ) . Berekn F{h' ( t ) } ( w ) og finn F{h' ( t ) } ( - 2 ) = 10 Kopi av Oppgave 10: Konvolusjon = + j. Maks poeng: 6 Oppgave 10 ( 6 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Enhets - sprang funksjonen ( eller Heaviside funksjonen ) er u ( t ) = [0, dersom t < 0, 1, dersom t≥ 0. La h ( t ) = ( uu ) ( t ) være konvolusjonen av enhets - sprang funksjonen med seg selv. Hva er h ( - 1 ) = og h ( 2 ) : = ? Maks poeng: 6 rac{12}{14} 11 Kopi av Oppgave 11: DFT Kopi av Eksamen IMAX2012 og IMAX2022 Oppgave 11 ( 6 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Du er gitt følgende kode: 1 import numpy as np 2 3 from numpy import fft sampling rate = 5 np.array ( [1, 2, 1, 3, 1, 2, 1, 5, 1, 2, 3] ) = fft.fft ( signal ) 4 5 signal = 6 7 dft_{signal} 8 dft_{signal_freq} 9 10 dft_{signal} [np.abs ( dft_{signal_freq} ) > 0.5] = 0 11 new_{signal} = = fft.fftfreq ( dft_{signal}.size, 1 / sampling rate ) fft.ifft ( dft_{signal} ) Sampling rate er det engelske navnet på prøvefrekvensen også kalt prøveraten. a ) Hva er prøveavstanden? Det vil si avstanden mellom prøvene i koden over. Velg ett alternativ 0.2 1 5 0.5 b ) Hva skjer i linje 10 i koden? Velg ett alternativ Alle frekvensene som er mindre 0.5 blir satt til 0. Alle frekvensene som er mellom - 0.5 og 0.5 blir satt til 0. Alle frekvensene som er over 0.5 eller mindre en - 0.5 blir satt til O. Alle frekvensene som er over 0.5 blir satt til O. c ) Du har et lydsignal, men ønsker å fjerne støy som blei produsert av en liten vifte som stod på når lyden ble tatt opp. Du ønsker å beholde frekvenser mellom 70Hz og 3000Hz, men å fjerne viftestøyen på 6000Hz. Hvilket filter kan du bruke? rac{13}{14} Velg ett alternativ: ○ Lavpassfilter Høypassfilter Ingen av delene Kopi av Eksamen IMAX2012 og IMAX2022 Maks poeng: 6 12 Kopi av Oppgave 12: IDFT Oppgave 12 ( 8 Poeng ) Denne oppgaven skal besvares i Inspera. Du skal ikke legge ved utregninger på papir. Vi skal finne invers diskrete fouriertransformasjonen ( IDFT ) av sekvensen F[k] = 1, 4, 0, 0. Her er F[0] = 1, F[1] = 4, F[2] = 0 og F[3] = 0. Angi svaret korrekt avrundet til 3 desimaler. f[0] = D¯¹{F[k]} [0] = + j, ƒ[1] = D¯¹{F[k]}[1] = + j, ƒ[2] = D¯¹ {F[k]}[2] ƒ[3] = D¯¹{F[k]}[3] = + j, = + j. Maks poeng: 8 rac{14}{14}"
]